{"id":"89d5d29efd50d875810de32b96a0b81a5faa9b68","title":"Women’s Congressional Staff Foundation Scholarship 2026: Applications Now Open","url":"https://opportunitiesforyouth.org/2026/02/26/womens-congressional-staff-foundation-scholarship-2026-applications-now-open/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T05:10:36Z","summary":"The Women s Congressional Staff Foundation Scholarship (WCSF) aims to create the path to a career on Capitol Hill, when for many women, especially those from middle- and low-income backgrounds, the financial burden of living and working in Washington, D.C., can put these opportunities out of reach. Through its 2026 Scholarship Program, the Foundation is once again supporting aspiring female staffers and working to create a more equitable and inclusive workplace on Capitol Hill. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Applications for the summer 2026 scholarship are open now , with all materials due no later than 11:59 PM EST on April 15, 2026 . ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Supporting Women With Women s Congressional Staff Foundation Scholarship The WCSF Scholarship is designed to ensure that more women from diverse backgrounds are able to access congressional internships positions that often serve as the entry point for long-term legislative careers. The Foundation s mission centers on broadening representation, elevating women s voices, and ensuring that the experiences of women inform the policymaking process from the very beginning. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Beyond financial support, scholarship recipients gain access to a valuable professional network. Members of the WCSF Board provide mentorship, career guidance, and connections that can shape a recipient s long-term trajectory in public service. Why This Scholarship Matters Interning on Capitol Hill is an exciting opportunity, but it can also be financially demanding. The cost of housing, transportation, and basic living expenses in D.C. can quickly add up making internships inaccessible for many talented women. WCSF seeks to remove this barrier by ensuring that a student s economic background does not define her ability to serve. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); By supporting early-career women at this pivotal stage, the Foundation strengthens the pipeline of future congressional staffers and leaders. Many previous recipients have gone on to full-time roles in congressional offices, political communications, public policy, and advocacy organizations. The program is not only empowering individuals it is reshaping the landscape of representation on Capitol Hill. Deadline and Selection Timeline All application materials must be submitted by Wednesday, April 15, 2026, at 11:59 PM EST . Finalists will then be contacted to schedule interviews with members of the selection committee. Final scholarship awards will be announced no later than May 24, 2026 . Applications are reviewed on a rolling basis, and candidates are strongly encouraged to apply early. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Eligibility Requirements To qualify, applicants must already have applied for an internship with a congressional office whether with a Member, Delegate, or Resident Commissioner of Congress, or with a U.S. Senate or House committee, caucus, or leadership office based in Washington, D.C. Confirmation of the internship will be required before the scholarship funds are awarded. Applicants must identify as a woman, be at least 18 years old, and hold a diploma from an accredited high school. What the Selection Committee Looks For The WCSF committee evaluates applicants holistically, placing high priority on: ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Demonstrated financial need, including anticipated expenses related to the internship A clear connection between the internship and academic or professional goals Applications submitted for high-responsibility internships Strong writing, references, and overall application quality A solid academic track record Program Expectations Scholarship recipients are expected to complete the full internship described in their application. Withdrawing early or misrepresenting financial need may require forfeiture or repayment of funds, except in extraordinary circumstances approved by the Foundation s board. The award is tied to the specific internship listed in the application and cannot be transferred. Empowering Women on Capitol Hill Through mentorship, financial assistance, and long-term professional support, the Women s Congressional Staff Foundation is shaping the future of equitable leadership in Washington, D.C. The 2026 scholarship cycle is an opportunity for emerging women leaders to take their first steps toward meaningful service and impact. Women pursuing internships on Capitol Hill are encouraged to apply before April 15, 2026 , and begin a journey that could define their careers for years to come. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Application can be accessed here . To know more about such opportunities, click here . The post Women’s Congressional Staff Foundation Scholarship 2026: Applications Now Open appeared first on Opportunities for Youth .","tags":["education","America","Scholarships","congressional internships","financial aid for students","public service careers","scholarships 2026","Washington DC opportunities","women empowerment","women in politics"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"c1ef9b112a5534cb44cdc67ee9f83b53efee4052","title":"Human-Centred Conservation Storytelling Grant: Empowering Journalism Rooted in Real People and Real Landscapes","url":"https://opportunitiesforyouth.org/2026/02/26/human-centred-conservation-storytelling-grant-empowering-journalism-rooted-in-real-people-and-real-landscapes/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T05:01:44Z","summary":"The Human-Centred Conservation Storytelling Grant invites experienced journalists and storytellers to rethink how conservation narratives are shaped, told, and understood. Too often, global conversations around conservation focus solely on wildlife or landscapes, overlooking the people whose lives are inextricably tied to ecological outcomes. This grant seeks to transform that narrative. By supporting high-quality, publishable stories that centre human realities in African conservation contexts, the program aims to elevate storytelling that is nuanced, responsible, and grounded in lived experiences. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About Human-Centred Conservation Storytelling Grant Conservation is never just about ecosystems; it is about the people who sustain, live within, and depend on them. The grant responds to a pervasive issue in public storytelling: narratives are frequently simplified, romanticised, or disconnected from crucial social, political, and economic dynamics. This initiative challenges that pattern by commissioning stories that reflect complexity rather than gloss over it. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Human-Centred Conservation places people at the heart of every story. It considers how rights, livelihoods, governance systems, and cultural relationships shape outcomes on the ground. From land-use decisions to resource access, from coexistence with wildlife to health and economic pressures, the approach recognises that conservation is deeply intertwined with daily realities. Stories supported through this grant may highlight successful models that empower local communities or reveal what happens when people are excluded from decision-making. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); What Kind of Stories Will Be Supported? The grant seeks strong, original ideas rooted in rigorous reporting and thoughtful examination. Ideal stories acknowledge that conservation is not linear. They explore where human-centred approaches drive positive change, where they fall short, and where tensions and trade-offs define everyday life. This includes stories that: Showcase innovation, resilience, and hope led by communities Illuminate challenges, contradictions, or unintended consequences Investigate governance, livelihoods, coexistence with wildlife, food systems, or climate adaptation Highlight land-use decisions shaped by cultural, economic, or political pressures There is no prescribed angle or format, allowing storytellers to work across print, film, photography, or audio. What matters is editorial maturity, depth, and respect for complexity. This grant is specifically designed for creators who already work to professional publishing standards and can deliver work suitable for established media platforms. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); What Will Not Be Funded To maintain high editorial integrity, the grant will not support promotional content, advocacy material, or simplified wildlife stories lacking a human focus. Narratives that present conservation as universally successful or universally failing, without acknowledging lived conditions and context, also fall outside the program s scope. Additionally, proposals requiring significant development support or capacity-building are unlikely to be selected, as this opportunity is intended for experienced professionals. Funding Tiers and What Applicants Can Expect Applicants may apply for one of three funding tiers: Tier 1: Up to USD 5,000 Tier 2: Up to USD 8,000 Tier 3: Up to USD 12,000 Budgets must be realistic and proportional to the proposed story. The application process requires a concise pitch, previous work samples, details on likely publication or broadcast pathways, and a summary budget. Selection Criteria and Review Process A selection panel will evaluate applications based on the clarity and quality of the pitch, alignment with Human-Centred Conservation principles, evidence of professional experience, and feasibility of the budget. Not all eligible applications will receive funding, making clarity and originality crucial. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Key Dates Applications open: 1 February 2026 Deadline: 23:59 GMT on 8 March 2026 Applicants with questions may contact the organising team, though individual feedback on proposals will not be provided. A Commitment to Thoughtful, People-Centred Storytelling The Human-Centred Conservation Storytelling Grant underscores a powerful truth: conservation cannot succeed without understanding the people who shape and are shaped by it. By supporting storytellers who elevate these human dimensions, the program aims to contribute to more informed, inclusive, and impactful global conversations on conservation. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Application can be accessed from here . To know more about such opportunities, click here . The post Human-Centred Conservation Storytelling Grant: Empowering Journalism Rooted in Real People and Real Landscapes appeared first on Opportunities for Youth .","tags":["education","Africa","Grants","Africa environmental reporting","climate and governance","community livelihoods","conservation storytelling","human-centred conservation","journalism grant 2026","wildlife coexistence"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"3a4a039d4f65e6dfc71a19a92cc6e7d223574d74","title":"Smithsonian Young Ambassadors Program 2026: A Transformative Leadership Opportunity","url":"https://opportunitiesforyouth.org/2026/02/26/smithsonian-young-ambassadors-program-2026-a-transformative-leadership-opportunity/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T04:54:39Z","summary":"The Smithsonian Young Ambassadors Program (YAP) returns in 2026 with another year of transformative learning, cultural exploration, and leadership development. Hosted by the National Museum of the American Latino, this nationally recognized program empowers rising high school seniors across the United States and Puerto Rico to become community-conscious leaders through exposure to the Smithsonian s world-class resources. As the program enters another year, it continues to nurture the next generation of thinkers, creatives, and changemakers. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Smithsonian Young Ambassadors Program Goals and Mission YAP is designed to cultivate leaders in the arts, sciences, humanities, and civic life. The program promotes higher education by exposing students to a wide range of academic disciplines and introducing them to Latino role models in these fields. This representation is powerful showcasing diverse professional paths and inspiring students to envision their own futures in new ways. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Another core goal is to provide hands-on learning environments that build strong 21st-century skills. Throughout the program, students gain experience in communication, collaboration, critical thinking, and professional development. These transferable skills prepare them for college life, internships, and future leadership roles, ensuring they leave the program confident and capable. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Washington Week Experience A major highlight of YAP is the immersive Washington Week in Washington, D.C. During this once-in-a-lifetime learning experience, students participate in workshops led by leading scholars, museum professionals, and community advocates. They explore topics related to STEM, the arts, history, and culture while engaging directly with the Smithsonian s exhibitions and collections. For many participants, Washington Week becomes a defining moment in their academic and personal journeys. The exposure to new ideas, the opportunity to connect with inspiring professionals, and the sense of belonging within a national institution create an unforgettable foundation for their future ambitions. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Making History Community Practicum Following Washington Week, students participate in the Making History Community Practicum , a key component that bridges their experiences in Washington with their communities back home. Through this practicum, students engage with local organizations, contribute to civic initiatives, and explore what it means to serve as ambassadors of their communities. This hands-on involvement helps students understand how museums can function as spaces for representation, storytelling, and community engagement. It also instills a deep sense of civic responsibility, encouraging participants to view themselves as active contributors to the world around them. Alumni Network and Long-Term Impact YAP s impact extends far beyond the summer experience. The program maintains a strong and active Alumni Network that provides graduates with continued leadership development, mentorship, and professional opportunities. Many alumni go on to pursue degrees and careers in fields such as the arts, education, business, technology, and public service. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); The program s track record speaks to its success: a 97% college graduation rate, 354 alumni, 19 years of programming, and engagement across 18 cities throughout the United States and Puerto Rico. YAP alumni consistently serve their communities with creativity, confidence, and purpose, demonstrating the long-term value of the program s mission. Application Details and Deadline Applications for the 2026 Young Ambassadors Program open on February 23, 2026 , and will remain open until April 10, 2026 . The program is open to rising high school seniors regardless of race or ethnicity. All programming is offered in English, and applicants are not required to speak Spanish. Students interested in leadership, culture, and community engagement are encouraged to apply. With its unique blend of academic enrichment, cultural learning, and hands-on experience, YAP continues to be one of the nation s premier youth leadership opportunities. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Application Deadline: April 10, 2026. Application can be accessed from here . To know more about such opportunities, click here . The post Smithsonian Young Ambassadors Program 2026: A Transformative Leadership Opportunity appeared first on Opportunities for Youth .","tags":["education","Latin America and the Caribbean","high school internships","Latino community empowerment","Smithsonian education programs","Smithsonian YAP 2026","student civic engagement","Washington Week","youth leadership program"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"60b8c98efbbb69225dc6f7f24713bb73f8a27f11","title":"2026 Japan International Award for Young Agricultural Researchers","url":"https://opportunitiesforyouth.org/2026/02/26/2026-japan-international-award-for-young-agricultural-researchers/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T04:21:55Z","summary":"The Japan International Award for Young Agricultural Researchers (Japan Award) is now open for nominations for its 20th presentation in 2026 . Established in 2007, the award recognizes exceptional young researchers from developing countries who have demonstrated excellence in research and development in agriculture, forestry, fisheries, and related fields. The program aims to encourage innovation, strengthen global scientific collaboration, and inspire the next generation of leaders in agricultural science. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The deadline for submission is May 15, 2026 (JST) . About the Japan International Award The Japan Award seeks to boost motivation among young researchers working to improve agricultural systems in developing regions. Through this award, the Japan International Research Center for Agricultural Sciences (JIRCAS) highlights researchers whose work contributes to sustainable food production, environmental stewardship, and technological advancement in agriculture. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Up to three awardees will be selected through a competitive international evaluation process conducted by the selection committee. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Eligibility Criteria Nominees must meet all of the following requirements: Be researchers from a developing country or territory . Be under 40 years old as of January 1, 2026 . Be affiliated with a non-Japanese research institute or university . Be actively engaged in research and development related to agriculture, forestry, fisheries, or related industries in developing regions. Candidates must also satisfy at least one of the following conditions: Have demonstrated outstanding performance in research that benefits agricultural development in a developing region. Have achieved research results that show strong potential for future technological innovation . Applicants who were not selected in previous years may re-apply . ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Awardees must, in principle, be able to attend the awarding ceremony in Japan and deliver a lecture. Award Components Up to three selected researchers will receive: An official testimonial , awarded by the Chairman of the AFFRC during the awarding ceremony A cash prize of USD 5,000 , supported through the MOTAI JIRCAS Award An invitation to Japan for the ceremony and related events The MOTAI JIRCAS Award is funded by a donation from Mr. Shigeru Motai , former Chairman of the AFFRC of MAFF, and is administered by JIRCAS. Application Process Applications must be submitted by the recommending research institutes , whether Japanese or non-Japanese. Each institute may recommend only one researcher , including any branch institutions. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Application Deadline: May 15, 2026 (Friday, JST) Key phases of the 2026 cycle: Nomination submission deadline: May 15, 2026 Selection and determination of awardees: August or September 2026 (tentative) Awarding Ceremony: October or November 2026 (tentative) Nomination packages must include all required forms, including the application form, self-advertisement sheet, research achievements list, and checklist, along with supporting documentation. Complete guidelines and templates are provided in the official application materials. Purpose and Impact The Japan Award plays a vital role in supporting scientific talent in the Global South. By elevating the work of young researchers, the award encourages innovations that can strengthen food security, enhance climate resilience, and transform agricultural technologies in developing regions. Awardees become part of a global network committed to advancing sustainable agriculture and contributing to improved livelihoods and food systems worldwide. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Submission Details Applications must be submitted by post to the Secretariat of the Japan International Award for Young Agricultural Researchers, at the JIRCAS Headquarters in Tsukuba, Japan. Application Deadline: May 15, 2026 (JST) Announcement of Winners: August September 2026 (tentative) Award Ceremony: October November 2026 (tentative) To further strengthen its global impact, the Japan International Award for Young Agricultural Researchers also serves as a bridge between scientific innovation and real-world application. By bringing awardees to Japan for the ceremony and lecture delivery, the programme fosters international exchange, collaboration, and the sharing of cutting-edge knowledge across continents. This in-person engagement not only elevates the visibility of young scientists but also exposes them to Japan s advanced research ecosystem, encouraging long-term partnerships that can accelerate agricultural transformation in developing regions. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Application can be accessed from here . To know more about such opportunities, click here . The post 2026 Japan International Award for Young Agricultural Researchers appeared first on Opportunities for Youth .","tags":["education","Asia","Awards","Agricultural Research","developing countries","food security","forestry and fisheries","global innovation","Japan Award 2026","JIRCAS","research funding","science awards","sustainable agriculture","young researchers"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"713eae8e1660189f68910433dcee59992e0c40a8","title":"ITLOS – Nippon Foundation Capacity-Building and Training Programme 2026–2027 (Fully Funded Law of the Sea Fellowship in Germany)","url":"https://opportunitiesforyouth.org/2026/02/25/itlos-nippon-foundation-capacity-building-and-training-programme-2026-2027-fully-funded-law-of-the-sea-fellowship-in-germany/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T18:43:59Z","summary":"Key Details Programme: ITLOS Nippon Foundation Capacity-Building and Training Programme on Dispute Settlement under UNCLOS ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Location: Hamburg, Germany Duration: July 2026 March 2027 (9 months, full-time) Funding: Fully funded (travel, accommodation, medical insurance, and monthly allowance) ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Application Deadline: 6 March 2026 Eligibility: Junior to mid-level government officials and researchers, mainly from developing countries ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Age Requirement: 25 40 years Language: English and French (programme mainly conducted in English) Overview In cooperation with the Nippon Foundation , the Tribunal runs an annual capacity-building and training programme on dispute settlement under the United Nations Convention on the Law of the Sea ( UNCLOS ). The full-time programme, which runs for nine months and begins in July each year, takes place at the seat of the Tribunal in Hamburg, Germany. Contingent upon the availability of funds, a call for applications is generally announced each year during the month of January or February. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); The programme is aimed at junior to mid-level government officials and researchers mainly from developing countries who are currently working on issues related to the law of the sea, maritime law or dispute settlement. It provides participants with a unique opportunity to develop their legal skills and deepen their practical knowledge of dispute settlement in the law of the sea under UNCLOS. All participants costs, including travel, accommodation, medical insurance and a monthly allowance, are covered by the Nippon Foundation. Flyer Lectures A series of lectures takes place throughout the nine months of the programme. Lectures are generally held over the course of two days, offering the fellows the possibility of close debate with the lecturers. The faculty of lecturers is drawn from Judges of the Tribunal, Registry officials, United Nations and international organizations, universities, law firms and other relevant institutions. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); At the beginning of the programme, the fellows take part in the four-week Summer Academy of the International Foundation for the Law of the Sea . This course focuses on law of the sea and maritime law and is attended by around 40 young professionals from around the world working in the fields of law of the sea and maritime law. Some examples of lectures given during recent programmes are: Dispute settlement under UNCLOS The mechanism for the settlement of disputes under Part XV of UNCLOS with a special focus on ITLOS Contentious and advisory proceedings Giving evidence before international courts and tribunals Provisional measures Prompt release International organizations and the law of the sea The role of international organizations in the implementation of UNCLOS The work of the Division for Ocean Affairs and the Law of the Sea, Office of Legal Affairs, United Nations The mandate and work of the Commission on the Limits of the Continental Shelf under UNCLOS The interaction between the International Seabed Authority and the Tribunal Current issues related to the law of the sea Law of maritime delimitation Law of the sea and human rights The Arctic and UNCLOS The establishment of the limits of the continental shelf Fisheries management Marine scientific research Marine biological diversity of areas beyond national jurisdiction International environmental law General principles of international environmental law UNCLOS and the regional seas programmes The precautionary principle and the protection of the marine environment Climate change and the law of the sea Biodiversity and protection of ecosystems Maritime law lecture series Maritime security Ship registration Vessel pollution International law lecture series Sources of international law law of international organizations State responsibility Law of treaties Training Training sessions and workshops are arranged in order to enhance the practical and professional skills of the fellows. The programme offers training in negotiation and mediation. Workshops are organized to prepare the fellows for their potential role as agents, counsel, or legal advisers in cases before international courts and tribunals. The tools used for this purpose include exercises in drafting documents relating to cases, attendance at oral proceedings at the Tribunal, the International Court of Justice or the Permanent Court of Arbitration, and presentation skills using audio-visual tools. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Collaborating institutes An integral part of the training and capacity-building programme on dispute settlement under UNCLOS is the cooperative arrangement with Max Planck Foundation for International Peace and the Rule of Law in Heidelberg, Germany, and the Norwegian Centre for the Law of the Sea in Troms , Norway. Cooperation is undertaken in the following areas: Max Planck Foundation for International Peace and the Rule of Law in Heidelberg, Germany: training on conflict resolution and visits to the library of the Max Planck Institute for Comparative Public Law and International Law . Norwegian Centre for the Law of the Sea in Troms , Norway: discussions and training on the law of the sea and visits to relevant institutions. Study visits Group visits of between two and five days complement the knowledge gained and training given in dispute settlement and issues/topics related to the law of the sea. Accompanied by a legal officer, the fellows are given exclusive access to experts from the institutions and have the chance to attend hearings or meetings. In previous years, the following visits have been organized for the fellows: ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Belgium: Brussels European Commission s Directorate-General for Maritime Affairs and Fisheries Germany: Berlin, Bremen, Cuxhaven, Hamburg, Hanover, Kiel Alfred Wegener Institut Federal Coastguard Federal Institute for Geosciences and Natural Resources Federal Maritime Hydrographic Agency GEOMAR Helmholtz Center for Ocean Research Kiel Hamburg Port Authority Maritime Safety and Security Centre Italy: Rome Food and Agriculture Organization of the United Nations Switzerland: Geneva The United Nations Office at Geneva Geneva Center for International Dispute Settlement The Netherlands: The Hague International Court of Justice International Criminal Court Permanent Court of Arbitration United Kingdom: London International Maritime Organization International Oil Pollution Compensation Funds OSPAR Commission Research Research on law of the sea disputes and other ocean matters relevant to governments and institutions of the participants is an integral part of the training. After a training session on legal research methodology, the fellows undertake research using the library facilities of the Tribunal. Participants undertake their research under the guidance and supervision of the Registry. Participants have also the opportunity to refer questions concerning their research topics to the Judges of the Tribunal. The results of the research are presented to the Judges of the Tribunal at the end of the programme. Eligibility Applicants must be between the ages of 25 and 40. Applicants must have a first university degree in law and demonstrate a capacity to undertake independent scientific research, study and training. Applicants must be: Junior to mid-level government officials from an administration or government agency, dealing with ocean affairs or maritime matters as well as legal issues relating thereto; or Researchers from an institute (academic or government) dealing with ocean-related or maritime matters as well as legal issues relating thereto. Applicants must indicate the research topic which they intend to pursue during the programme. The research topic should address legal issues of relevance to the State and institutions of the participants regarding the implementation of UNCLOS, in particular Part XV thereof. The administration or institute nominating the applicant must indicate on the nomination form the tasks performed by the applicant and explain the extent to which the training programme will benefit the institution/State concerned. Applicants must have an excellent knowledge of one of the official languages of the Tribunal (English and French) and a working knowledge of the other language. The lectures and activities of the Programme are mainly held in English. Procedure The following documents must be submitted in order for an application to be processed: Fellowship Application Form to be duly completed, signed and submitted by the applicant. Nomination Form to be duly completed, signed and directly submitted by the nominating agency. The submitted form must be typed. In the case of government officials, the nominating agency should be a relevant governmental body. For researchers, the nominating agency may be the institute or academic department of the university to which they are affiliated. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Nominating agencies are invited to submit two copies of the Nomination Form: One scanned version of the signed original; and One electronic version. The Nomination Form should preferably be sent by e-mail to training@itlos.org , by fax to: +49 40 35607-245, or by post to: Office of the Registrar International Tribunal for the Law of the Sea Am Internationalen Seegerichtshof 1 22609 Hamburg Germany ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Conditional acceptance to the programme Admitted applicants must submit the following documents: A medical certificate issued by a duly qualified physician stating that they are in good health and fit to complete the entire programme (from July 2026 until March 2027). The certificate must indicate that the admitted applicant is able to travel inside Germany and overseas. A certificate issued by the nominating agency indicating that the candidate is granted permission to travel to Hamburg and to participate in the full nine-month programme from July 2026 to March 2027. Final admission to the programme will be contingent upon submission of the medical and permission certificates. Admitted applicants must submit a copy of the certificates within two weeks of announcing the admission. The original certificates must be submitted on the first day of the programme and must be in either English or French or accompanied by a certified translation. Participants costs, including travel, accommodation, medical insurance and a monthly subsistence allowance, are covered by the Nippon Foundation. Participants are responsible for obtaining a visa for Germany for the period of the programme at their own cost, although assistance may be provided in order to facilitate the visa application process. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); During the programme, the fellows become part of the ITLOS community and are fully integrated in the life of the Registry for nine months. They interact with staff, Judges and participants of the other training programmes run at the Tribunal. As ITLOS alumni, the fellows join a growing network of young professionals from around the world working in the field. Fellows are provided with a fully equipped office with computer, printer and internet connection for the duration of the programme. Fellows have access to the Tribunal s specialized Library, which houses a comprehensive collection on the law of the sea and related subjects, such as maritime law, environmental law, ocean affairs, coastal management, international courts and tribunals, international organizations, dispute settlement, arbitration, and general issues of public international law. Accommodation in the vicinity of the Tribunal is provided in studio apartments, with a bedroom/sitting area, kitchen and bathroom. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); During their first weeks in Hamburg, the fellows are introduced to life in Germany and given German language classes. Language training in French may also be provide For further information please contact: The ITLOS-Nippon Programme Coordinator International Tribunal for the Law of the Sea Am Internationalen Seegerichtshof 1 22609 Hamburg Germany Tel.: (+49) 40 35607-243 Fax: (+49) 40 35607-245 training@itlos.org Source: https://www.itlos.org/en/main/the-registry/training/itlos-nippon-foundation-capacity-building-and-training-programme/ The post ITLOS – Nippon Foundation Capacity-Building and Training Programme 2026–2027 (Fully Funded Law of the Sea Fellowship in Germany) appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Fellowship","Latin America and the Caribbean","Middle East and North Africa","Short Courses","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"96098219a6009acea37822be5e5e5ef6846552eb","title":"Manaaki New Zealand Scholarships 2027: Fully Funded Postgraduate Study in New Zealand","url":"https://opportunitiesforyouth.org/2026/02/25/manaaki-new-zealand-scholarships-2027-fully-funded-postgraduate-study-in-new-zealand/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T17:53:53Z","summary":"Applications for the Manaaki New Zealand Scholarships will open on March 1, 2026. Funded by the Government of New Zealand , these fully funded scholarships support applicants from eligible countries to undertake full-time postgraduate studies in 2027. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This prestigious program aims to build leadership capacity and contribute to sustainable development in partner countries. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Scholarship Overview The Manaaki New Zealand Scholarships provide full financial support for selected international students pursuing postgraduate qualifications in New Zealand. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Priority Sectors Applicants must align their proposed studies with one of the following priority development areas: Climate resilience, science and environment Economic resilience and the private sector Food security and agriculture Governance Infrastructure Peace, security and justice Resilient societies Programs of study should clearly demonstrate how they contribute to development outcomes in the applicant s home country. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Eligible Educational Institutions Scholarship recipients may study at the following New Zealand institutions: Auckland University of Technology Lincoln University Massey University University of Auckland University of Canterbury University of Otago University of Waikato Victoria University of Wellington Southern Institute of Technology Unitec Institute of Technology Applicants must apply to eligible programs offered at these institutions. Who Can Apply? Applicants must: Be from an eligible country Apply for full-time postgraduate study (Master s or PhD level) Demonstrate alignment with priority development sectors Meet academic and English language requirements Intend to return to their home country after completion Key Dates to Remember Applications Open: March 1, 2026 Applications Close: March 30, 2026 ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Late applications are not accepted, so early preparation is strongly advised. Application Period March 1 March 30, 2026 Official Scholarship Information. Eligible Countries List. For more OFY Schorlarship opportunities, click here. #Scholarships #StudyInNewZealand #ManaakiScholarships #FullyFunded #Postgraduate The post Manaaki New Zealand Scholarships 2027: Fully Funded Postgraduate Study in New Zealand appeared first on Opportunities for Youth .","tags":["education","Scholarships","Master","PhD"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"40f9a28cf4ee6ac27e95b09cc1ab5c6450033179","title":"Global Leadership Opportunity: Transatlantic Future Leaders Forum Internship 2026","url":"https://opportunitiesforyouth.org/2026/02/25/global-leadership-opportunity-transatlantic-future-leaders-forum-internship-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T17:10:47Z","summary":"The Transatlantic Future Leaders Forum (TFLF) is a prestigious internship platform designed to give the brightest Polish university students an opportunity to gain hands-on experience in the offices of top lawmakers in Washington, D.C. and London . ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Through this program, participants are immersed in transatlantic policymaking environments, working alongside decision-makers and gaining valuable insights into legislative processes in both the United States and the United Kingdom. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Beyond the internship experience, TFLF provides a robust support and mentoring structure for talented students, helping them build professional skills, expand their networks, and prepare for leadership roles in public life. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); What TFLF Offers TFLF is more than an internship it is a comprehensive leadership development platform that equips participants with knowledge, exposure, and connections. Participants benefit from: Internships with leading policymakers in the U.S. Congress and the UK House of Commons ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Mentorship and career support from experienced professionals Exclusive meetings with leaders in politics, academia, and business Exposure to think tanks, companies, and professional service organizations in both countries A strong network of high-achieving Polish peers and alumni The program is built and led by former interns of U.S. Congress and the UK Parliament who are committed to creating opportunities for the next generation of Polish leaders. Vision and Mission The Transatlantic Future Leaders Forum aims to: Connect exceptional Polish students with open-minded and influential decision-makers in Washington and London ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Provide educational and professional development opportunities through real-world policy experience Build a strong network of future Polish leaders equipped with international perspectives Foster long-term collaboration between Polish scholars and global institutions Through its programming, TFLF serves as a bridge between academic excellence and real-world policymaking. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Why Apply to TFLF? The Transatlantic Future Leaders Forum offers a rare opportunity to: Gain real-world experience in global policymaking Learn directly from influential lawmakers and institutions Build a competitive international profile Join a prestigious network of future Polish leaders For ambitious Polish students passionate about public policy, international relations, and leadership, TFLF is a transformative stepping stone toward a global career. Application Process 1. Online Application To apply for the 2026 summer internship program , candidates must complete the official online application form . ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Deadline: 31 March 2026 (23:59 CET) Applicants should prepare the following before starting the application: Answers to assessment questions (in plain text format) Personal details and availability information Updated CV Note: The application form cannot be saved midway, so all required information must be ready before starting. Applicants seeking guidance can attend an online information session (date to be announced), with registration details available on the program s website. 2. Oral Examination (Assessment Centre) Shortlisted candidates will be invited to an Assessment Centre in Warsaw , where they will participate in: An interview Practical exercises conducted in English The program committee will evaluate candidates based on their overall performance and recommend top applicants for internship placement. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); 3. Final Candidate Selection Recommended candidates will have their applications forwarded to participating Members of Parliament and Members of Congress. Each office may: Conduct its own internal review Invite candidates for an additional phone interview Successful applicants will be notified by TFLF once their placement is confirmed with a specific office. Key Deadline Application Deadline: 31 March 2026 (23:59 CET) Start your journey toward transatlantic leadership with TFLF and become part of the next generation shaping the future of global policy. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Discover more Internship Opportunities Here The post Global Leadership Opportunity: Transatlantic Future Leaders Forum Internship 2026 appeared first on Opportunities for Youth .","tags":["education","Europe","Continent","Internships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"fb7ac00eac99aaf99a2a0a1f4bbcd3fa94d144f9","title":"Hermès Internships 2026 in Paris & Île-de-France: Paid 6-Month Luxury Industry Opportunities in Communication, Marketing, Finance, Quality, Retail & Product Development","url":"https://opportunitiesforyouth.org/2026/02/25/hermes-internships-2026-in-paris-ile-de-france-paid-6-month-luxury-industry-opportunities-in-communication-marketing-finance-quality-retail-product-development/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T17:01:31Z","summary":"Are you looking to launch your career inside one of the world s most prestigious luxury maisons? Herm s, the iconic French house founded in 1837, is offering multiple paid, full-time internships for 2026 across its Communication, Marketing, Finance, Quality, Product Development, and Retail Education departments. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); These six-month internships, primarily based in Paris, Pantin, Fontenay-sous-Bois, and surrounding le-de-France locations, provide exceptional hands-on experience within a global luxury group employing more than 25,000 people worldwide. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Herm s is recognized for its craftsmanship, creativity, entrepreneurial spirit, and commitment to excellence. Interns will work alongside experienced professionals in a dynamic, high-performance environment that values ethics, diversity, inclusion, and responsible management. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); All internships are full-time and paid, lasting six months. Start dates vary between July and September 2026 depending on the position. About Herm s: A Global Leader in Luxury Craftsmanship Herm s is a French, family-owned, and independent company with nearly two centuries of heritage. The House operates across sixteen artisanal m tiers, producing leather goods, fashion accessories, crystal, jewelry, saddlery, ready-to-wear, and more. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); With nearly 300 stores worldwide, Herm s maintains a unique artisanal model rooted in local production in France, respecting both people and nature. These internships are hosted within Herm s International (the holding company), Herm s Sellier, Herm s Manufacture de M taux, and Cristallerie Saint Louis. Why Apply to Herm s Internships? Work within a globally respected luxury maison Gain hands-on experience in real projects Build international exposure Develop technical, analytical, and creative skills Strengthen your professional network in luxury, communication, finance, and innovation ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Herm s promotes ethics, diversity, inclusion, and equal opportunity. Overview of Available Herm s Internships 2026 1. Assistant Press Officer (Accessories) Paris Location: Paris Duration: 6 months Start: Second half of 2026 Within the Press/Influence Department, interns will support media and influencer relations strategy. Key Responsibilities: Preparing, sending, and managing press samples for French and international distribution Coordinating with media outlets and influencers (print, TV, radio, digital) ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Supporting press events and ensuring media coverage Managing communication between subsidiaries and internal departments Profile: Student in Communication/Public Relations Strong organizational skills Fluent English Proficient in Word, Excel, Internet tools Appreciation for high-end products Learn more HERE . 2. Assistant Project Manager Institutional Communication (Advertising Campaigns) Paris Location: Paris Duration: 6 months Start: Second half of 2026 This role supports paid advertising campaigns including cross-business campaigns, holiday campaigns, and store openings. Responsibilities: Coordinating with advertising agencies and subsidiaries Managing campaign timelines and budgets Designing editorial pages for hermes.com Overseeing styling logistics and production Managing digital and print deliverables Preparing campaign reports Profile: Business/Communication school student Prior internship experience in agency or corporate communications Fluent English Skilled in PowerPoint, Excel, Word Strong project management skills Learn more HERE . 3. Operational Marketing Assistant Cristallerie Saint Louis (Pantin) Location: Pantin Start: July 2026 Duration: 6 months Saint-Louis creates exceptional handcrafted crystal pieces. Responsibilities: Supporting sales promotions, trade shows, and events Developing communication materials Coordinating window display adaptations internationally Supporting video content creation Monitoring sales tools and promotional materials Profile: Marketing student Proficient in PowerPoint Excel Fluent English Interest in interior design and lifestyle Learn more HERE . 4. Assistant Management Controller Finance ( le-de-France) Locations: Pantin, Fontenay-Sous-Bois, Bobigny Duration: 6 months Start: Second half of 2026 Responsibilities: Supporting budget review and financial closing Preparing Excel and PowerPoint financial reports Developing performance indicators Conducting benchmarking analysis Assisting in cross-functional financial projects Profile: Finance or Business School student Strong Excel skills Analytical mindset Prior experience in management control preferred Learn more HERE . 5. Quality Assistant Herm s Manufacture de M taux (Fontenay-sous-Bois) Location: Fontenay-sous-Bois Start: September 2026 Duration: 6 months Responsibilities: Supplier monitoring and audit prioritization Implementing Master Data management tools Developing quality documents Creating KPIs Supporting continuous improvement initiatives Profile: Engineering student (Master s level) Knowledge of manufacturing processes Excel, Power BI proficiency Fluent English Learn more HERE . 6. Development Assistant Project Manager Jewelry Leather Enamel Division (Pantin) Location: Pantin Start: September 2026 Duration: 6 months Responsibilities: Managing prototype and runway schedules Coordinating suppliers and production sites Monitoring product development phases Managing reporting and inventory updates Supporting podium campaign execution Profile: Business or Engineering student Interest in Supply Chain Strong Excel PowerPoint skills Highly organized and adaptable Learn more HERE . 7. Retail Education Assistant Fashion Accessories (Pantin) Location: Pantin Start: September 2026 Duration: 6 months Responsibilities: Developing product training materials Creating e-learning modules Organizing international Train The Trainers seminars Designing creative educational tools Supporting internal communications Profile: Master s-level student Fluent English Strong PowerPoint skills Retail experience valued Creative and organized Learn more HERE . Frequently Asked Questions (FAQ) Are Herm s internships paid? Yes. All listed internships are paid and full-time for six months. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Where are the internships located? Primarily in Paris and the le-de-France region including Pantin, Fontenay-sous-Bois, and Bobigny. Who can apply? Students enrolled in undergraduate (rising junior or above), Master s programs, or recent graduates depending on role. Is English required? Yes. Most roles require fluency in English (written and spoken). ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Are beginners accepted? Yes. Beginners are accepted, though prior internship experience is valued for some roles. Do I need to send both a CV and cover letter? Yes. Applicants must submit both documents and specify availability. Visit HERE to find more information about the Herm s Internships 2026 in Paris. Discover more Internship opportunities HERE . The post Hermès Internships 2026 in Paris Île-de-France: Paid 6-Month Luxury Industry Opportunities in Communication, Marketing, Finance, Quality, Retail Product Development appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Continent","Europe","Internships","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"c0ea3b33236d638849fa037ab2a4c77e51d59042","title":"5 Fully Funded Commonwealth Scholarships for MSc in Global Development at The Open University (U.K.)","url":"https://opportunitiesforyouth.org/2026/02/25/5-fully-funded-commonwealth-scholarships-for-msc-in-global-development-at-the-open-university-u-k/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T16:49:00Z","summary":"If you are a Malawian development professional eager to advance your career in global development, peace, security and governance , this is one of the most prestigious and high-impact scholarship opportunities available this year. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the Programme MSc in Global Development This Master of Science (MSc) in Global Development focuses on building skills that strengthen: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Peace and security Development policy analysis Governance and leadership in development settings ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); It is delivered via distance learning , meaning you can continue working and contributing to your community while pursuing your studies. The course is taught by The Open University and delivered in partnership with Civil Society Agriculture Network (CISANET) in Malawi. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); What s on Offer? The Commonwealth Distance Learning Scholarships have awarded five fully funded awards worth 90,000 to support Malawian nationals to study for the highly respected MSc in Global Development delivered by The Open University (U.K.) Why This Scholarship Matters Fully funded scholarships (tuition covered) Study a globally recognised Master s degree from a top UK distance-learning institution Continue working at home while studying part-time Become a leader in development policy, peace, governance and security Make a measurable impact in your community and country This programme has supported over 220 East African professionals to date. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Benefits Here s what the scholarship includes: 1. Full tuition fee coverage for the MSc 2. Ability to study part-time via distance learning 3. A Master s degree from a respected UK university 4. Enhanced skills in development policy, governance, peace and security 5. Boosted professional credibility and career prospects Note : Scholarships generally cover tuition only; living costs are your responsibility. Eligibility Criteria To be considered for one of the five Commonwealth Scholarships, applicants must: ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); 1. Be Malawian nationals 2. Be employed by a development agency (government, NGO or private sector) in Malawi 3. Have at least two years of professional experience working on development issues in Malawi 4. Hold a good undergraduate degree (preferably in a relevant development field) 5. Demonstrate a strong commitment to local and national development goals 6. Meet scholarship and degree entry requirements set by the Foreign, Commonwealth Development Office (FCDO) and CSC. This scholarship is designed for professionals with leadership potential and practical experience. Application Process To apply: Step 1 Create a CSC Account Go to the Commonwealth Scholarship Commission (CSC) application portal and sign up. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); You will find the eligible course MSc Global Development (distance learning) listed under Group 4: Strengthening global peace, security and governance . Step 2 Complete the Online Application Form Apply here Important: Provide a detailed explanation of how your degree will benefit Malawi . This narrative is a key part of the selection process. Step 3 Submit Before Deadline Submit all required materials before 16:00 GMT, 31st March 2026 . ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Important Dates Deadlines Deadline Detail 31st March 2026 16:00 GMT Final deadline to submit the scholarship application online. October 2026 Expected programme start date for MSc in Global Development scholars. Pro Tip: Submit early late or incomplete applications will not be considered. This is a rare and highly competitive scholarship for development professionals in Malawi one that can truly elevate your career and multiply your impact back home. For more information visit here For more global opportunities click here The post 5 Fully Funded Commonwealth Scholarships for MSc in Global Development at The Open University (U.K.) appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","Scholarships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"5f55355970f28b9f0acc9481f433ec696fe732f1","title":"£15,000 David McClure Public Interest Journalism Fellowship 2026–2031: Major Funding Opportunity for Investigative and Long-Form Journalism","url":"https://opportunitiesforyouth.org/2026/02/25/15000-david-mcclure-public-interest-journalism-fellowship-2026-2031-major-funding-opportunity-for-investigative-and-long-form-journalism/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T16:40:19Z","summary":"The David McClure Public Interest Journalism Fellowship is a prestigious, fully funded opportunity designed to support independent, non-fiction writers and journalists producing rigorously researched public interest journalism . From 2026 , one Fellow per year will receive 15,000 to complete an investigation that holds power to account and serves the public good. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Presented by the Oxford International Centre for Publishing (OICP) at Oxford Brookes University , this Fellowship honours the legacy of acclaimed investigative journalist David McClure , whose work exposed centuries-old institutional privilege and reshaped public understanding of royal wealth and power. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); About David McClure David McClure was a highly respected journalist, news producer, and author whose career was defined by deep forensic investigation and public accountability journalism . Over a decade, he uncovered how the British Royal Family s private estates and investments were shielded from scrutiny for centuries. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); His investigations resulted in two landmark non-fiction books Royal Legacy: How the Royal Family Have Made, Spent and Passed on Their Wealth (2014) and The Queen s True Worth: Unravelling the Public Private Finances of Queen Elizabeth II (2020). These works were serialised in the UK press, described as bombshell revelations , and covered extensively by global media. McClure passed away from cancer in June 2022. Why This Fellowship Matters Funding for investigative journalism has been under sustained pressure for more than a decade. The 2019 Cairncross Review highlighted the growing financial fragility of public interest reporting an issue that remains unresolved today. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); The David McClure Public Interest Journalism Fellowship directly addresses this challenge by providing dedicated financial support for investigations that are: Time-intensive Costly to research Independent of political or commercial influence Essential to the public domain Without this Fellowship, many such investigations might never be completed or published. Fellowship Overview Award Amount: 15,000 Number of Fellows: 1 per year Duration: Five years (2026 2031) Start Date: September each year Funded By: David McClure Trust Fund Host Institution: Oxford International Centre for Publishing (OICP) The Fellowship supports the completion of a single, long-form piece of public interest journalism with strong contemporary relevance. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); What Type of Journalism Is Supported? The Fellowship is intentionally flexible, with minimal restrictions. However, the proposed investigation must be: Original Non-fiction Non-biased and non-partisan Rigorously researched Of clear public interest and contemporary relevance The selection panel s primary consideration is how deserving the investigation is to be in the public domain . Key Benefits of the Fellowship 15,000 in dedicated funding Institutional support from Oxford Brookes University Recognition associated with David McClure s investigative legacy Time and financial freedom to complete ambitious journalism Increased likelihood of publication and impact Eligibility and Qualifications Open to journalists, authors, and non-fiction writers worldwide No restrictions on: Age Nationality Background Career stage Diversity is welcomed, but merit and public value are the deciding factors ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Can I Apply If My Investigation Is Already Underway? Yes. The Fellowship is specifically designed for writers who have begun an investigation but cannot progress or complete it without financial support . Can I Apply If I Haven t Started Yet? The Fellowship prioritises projects already in progress. Applicants must demonstrate research undertaken and progress to date . Financial Need and Use of Funds Applicants will not be means-tested . However, applications must clearly explain: ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Why Fellowship funding is essential to complete the investigation How the 15,000 will be used (e.g. research time, travel, data access, legal review, archival work) The panel will prioritise public value over personal financial circumstances . Selection Panel The Fellow will be chosen by a panel comprising: Members of the Oxford International Centre for Publishing (OICP) Selected experts from its Publishing Advisory Board Selected experts from its Journalism Advisory Board Panel members include publishers, literary agents, journalists, authors, and senior industry professionals. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application Requirements Applicants must submit a 1,500-word pitch that includes: Synopsis of the investigation Aims and objectives Public interest relevance Key research undertaken so far Progress to date Why Fellowship support is essential Detailed explanation of how funds will be used Shortlisted applicants will be invited to an online interview . Deadlines and Key Dates Application Deadline: 31 May (annually) Interview Period: Summer Fellowship Start Date: September Frequency: Once per year, for five consecutive years starting in 2026 How to Apply Applications must be submitted via the official application form: Apply here (Shortlisted candidates will be contacted directly for interview details.) The David McClure Public Interest Journalism Fellowship is a rare and powerful opportunity for writers committed to truth, accountability, and public value . If you are pursuing an investigation that matters but lack the resources to finish it this Fellowship exists to make that work possible. For more information visit here For more global opportunities click here The post £15,000 David McClure Public Interest Journalism Fellowship 2026–2031: Major Funding Opportunity for Investigative and Long-Form Journalism appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Fellowship","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"0b170555ba74e01bcb0ae4c8477914b1482cde81","title":"Apple Finance Internship 2026: Launch Your Career with Apple’s Finance Development Program","url":"https://opportunitiesforyouth.org/2026/02/25/apple-finance-internship-2026-launch-your-career-with-apples-finance-development-program/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T16:05:32Z","summary":"Global technology leader Apple Inc. is now offering multiple Finance Internship opportunities for students passionate about building careers in finance, analytics, and business strategy. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This highly competitive internship provides hands-on experience within Apple s Finance organization and a potential pathway into the prestigious Finance Development Program (FDP). ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); If you are targeting a career in corporate finance, financial analysis, or data-driven business strategy, this is an opportunity to work at one of the most influential companies in the world. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); About the Apple Finance Internship Apple s Finance Internship allows students to work alongside top finance professionals while supporting key areas of the business. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Interns may be placed within departments such as: AppleCare Financial Services Internet Software Services Marketing Operations Research Development Retail Sales Worldwide Financial Planning Analysis And more During the internship, participants contribute directly to real business projects that impact Apple s global operations. What You ll Do as a Finance Intern As an intern, you will gain exposure to advanced financial and analytical work, including: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Conducting in-depth financial analysis using advanced Excel functions Working with SQL and data tools Creating dashboards using data visualization platforms such as Tableau Designing and optimizing data-driven reporting systems Building automated financial models and reporting solutions Collaborating with cross-functional teams to deliver strategic insights Identifying operational efficiencies through analytics and technical platforms This internship is structured to help students develop technical, analytical, and business communication skills at a world-class level. Pathway to the Finance Development Program (FDP) Successful summer interns may become eligible to join Apple s Finance Development Program (FDP) . ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); The FDP is a 12 18 month rotational program designed for entry-level finance talent. Participants typically rotate across four to six finance functions, gaining broad exposure across Apple s business. Upon completion of the FDP, participants transition into permanent Financial Analyst roles within Apple. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); This internship is therefore not just a summer role it can serve as a launchpad for a long-term finance career at Apple. Minimum Qualifications Applicants must: Be pursuing a Bachelor s degree in: Finance Data Science Mathematics Statistics Business Administration Economics Accounting Or a related field Have an expected graduation date of Winter 2027 or Spring 2028 ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application materials must include: Resume Cover letter Unofficial transcript Applications without these documents will not be considered. Preferred Qualifications Strong candidates will demonstrate: Advanced Excel proficiency Experience with SQL or Python (preferred but not required) Strong analytical and problem-solving skills Ability to thrive in fast-paced and ambiguous environments Excellent written and verbal communication skills Curiosity, initiative, and accountability Why You Should Apply This internship offers: Exposure to Apple s global finance operations Hands-on experience with advanced financial analytics Cross-functional collaboration experience Mentorship from leading finance professionals A potential pathway into Apple s Finance Development Program Career acceleration within a globally recognized technology company Apple is committed to inclusion and diversity and provides equal opportunity to all qualified applicants. How to Apply To apply, submit: Resume Cover letter Unofficial transcript For more information click here Apply here Early application is strongly encouraged due to the competitive nature of the program. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Discover more opportunities here The post Apple Finance Internship 2026: Launch Your Career with Apple’s Finance Development Program appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Europe","Internships","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T19:12:42Z","updated_at":"2026-02-25T19:12:42Z"}
{"id":"4f7f14521164085c5bdb880dafccd1ce8ee13929","title":"AI Skills 4 Women: Free AI Course by Founderz × Microsoft with Official Credential","url":"https://opportunitiesforyouth.org/2026/02/25/ai-skills-4-women-free-ai-course-by-founderz-x-microsoft-with-official-credential/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T15:42:24Z","summary":"The AI Skills 4 Women program is a free, fully online course designed to equip women with practical artificial intelligence skills no technical background required. This initiative is delivered by Founderz in collaboration with Microsoft to help close the gender gap in AI and technology. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); If you re looking to enter the AI space or strengthen your digital skills, this short but impactful program is worth exploring. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); What You ll Learn Participants will gain foundational and practical knowledge in: AI Fundamentals Practical AI Applications Prompt Engineering AI Ethics AI Cybersecurity Data Analytics Leadership Mentorship Skills ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The course is structured to be accessible, even for beginners with no prior technical experience. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Program Details Duration: 3 Hours Mode: 100% Online Credential: Official Microsoft Certificate Additional Benefit: Opportunity to win AI scholarships The short format makes it ideal for students, professionals, entrepreneurs, and career switchers who want to quickly build AI literacy. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Who Should Enroll? This program is open to: Women interested in technology and AI Students exploring digital careers Professionals looking to upskill Entrepreneurs integrating AI into their work Career switchers entering tech No prior coding or technical background is required. Why This Matters Women remain underrepresented in AI and emerging technologies. Programs like AI Skills 4 Women aim to increase participation, confidence, and leadership in the digital economy. By completing this course, participants gain both technical awareness and strategic insight into how AI is transforming industries worldwide. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); How to Enroll Enroll for free and begin your AI learning journey here . For more OFY short courses , click here The post AI Skills 4 Women: Free AI Course by Founderz × Microsoft with Official Credential appeared first on Opportunities for Youth .","tags":["education","Continent","Short Courses"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T19:12:42Z","updated_at":"2026-02-25T19:12:42Z"}
{"id":"6105a5a797ad37bf1de59f0810209716cf7828af","title":"LEAP Advance Leadership Development Program 2026: Elevate Your Impact in Higher Education","url":"https://opportunitiesforyouth.org/2026/02/25/leap-advance-leadership-development-program-2026-elevate-your-impact-in-higher-education/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T15:36:17Z","summary":"The LEAP Advance Leadership Development Program is an intensive leadership initiative designed to support higher education professionals in strengthening their leadership capacity and advancing their influence within academic institutions. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Delivered in partnership with the Asian Pacific Americans in Higher Education (APAHE) , the program prepares participants to lead with confidence through an Asian and Pacific Islander (API) cultural lens. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); This program is ideal for professionals seeking greater visibility, executive presence, and leadership effectiveness in colleges and universities. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); About LEAP Advance LEAP Advance is a structured leadership development experience tailored specifically for professionals working in higher education. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Through culturally responsive leadership training and mentorship, participants gain the tools needed to navigate institutional structures, enhance executive presence, and expand their professional influence. The program centers leadership development within the context of Asian and Pacific Islander identities, perspectives, and lived experiences, fostering both personal growth and systemic impact. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Curriculum Highlights The LEAP Advance curriculum is designed to provide both practical leadership skills and identity-based empowerment. Key components include: Culturally Responsive Leadership Development Participants explore leadership frameworks that integrate cultural identity and institutional dynamics. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); One-on-One and Small Group Mentoring Structured mentoring provides individualized support and professional guidance. Mock Interviewing Practice and Executive Presence Hands-on sessions help participants refine communication, confidence, and interview readiness for senior roles. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Engagement with Senior Higher Education Leaders Interactive sessions with senior administrators and college presidents offer insight into executive-level leadership. Key Outcomes Participants in LEAP Advance can expect: Enhanced leadership capacity within academic institutions Increased self-awareness of cultural leadership identity Strengthened executive presence and communication skills Expanded professional network within higher education Greater visibility and readiness for senior leadership roles This program is particularly impactful for professionals aiming to advance into administrative, executive, or institutional leadership positions. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Why You Should Apply If you are a higher education professional seeking to: Strengthen your leadership competencies Lead authentically through a culturally grounded lens Expand your professional network Prepare for senior-level roles in academia LEAP Advance offers a targeted pathway to elevate your influence and long-term career trajectory. How to Apply Interested applicants should visit the official program page through the organizing institution to access the application details and submission link . ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Apply here Discover more opportunities here The post LEAP Advance Leadership Development Program 2026: Elevate Your Impact in Higher Education appeared first on Opportunities for Youth .","tags":["education","Asia","Africa","America","Australia and Oceania","Europe","Latin America and the Caribbean","Middle East and North Africa","Short Courses","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T19:12:42Z","updated_at":"2026-02-25T19:12:42Z"}
{"id":"befd697313dc2e575ac0186d3c2ef1f2e2491daf","title":"UNEP Traditional Knowledge Internship 2026 (Remote Option Available): Work on Global Biodiversity Policy Ahead of COP17","url":"https://opportunitiesforyouth.org/2026/02/25/remote-check-out-these-internships-at-united-nations-environment-programme-unep-the-secretariat-of-the-convention-on-biological-diversity-under-the-united-nations-environment-programme-unep-has/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T15:16:33Z","summary":"The Secretariat of the Convention on Biological Diversity under the United Nations Environment Programme (UNEP) is now accepting applications for a six-month internship focused on traditional knowledge and engagement with indigenous peoples and local communities. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This opportunity is linked to preparations for major Convention on Biological Diversity processes, including COP17 and the Nature and Culture Summit. The internship can be undertaken at the Montreal duty station in Canada or remotely. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The application deadline is March 7, 2026. About the UNEP Internship 2026 Hosted by the United Nations Environment Programme (UNEP), this internship supports work under the Convention on Biological Diversity (CBD). The selected intern will contribute to biodiversity governance efforts that integrate culture, indigenous knowledge systems, and environmental sustainability. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The internship provides emerging professionals with exposure to multilateral environmental negotiations and global biodiversity policymaking in preparation for COP17. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Internship Location Montreal, Canada (Duty Station) Remote option available This flexibility allows eligible candidates worldwide to participate without relocation, depending on arrangements. Internship Focus and Responsibilities The intern will support research, drafting, and coordination activities related to biodiversity, culture, and traditional knowledge systems. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Key responsibilities include: Conducting research on biodiversity, indigenous peoples, and traditional knowledge Drafting background documents and meeting materials Supporting coordination with stakeholders and indigenous representatives Assisting in preparations for COP17 discussions Contributing to engagement processes linked to the Nature and Culture Summit This role provides hands-on experience in global environmental governance and collaboration with indigenous communities at the international level. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Language Requirements Fluency in English (oral and written) is mandatory Knowledge of French and/or Spanish is considered an asset Financial Information This internship is unpaid. Interns are responsible for: Travel arrangements Visa costs Accommodation Living expenses The United Nations does not charge any fees at any stage of the recruitment process. Eligibility Criteria Applicants must meet one of the following academic requirements: Be enrolled in or have completed a Master s or PhD programme ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Be in the final year of a Bachelor s degree Have recently completed a Bachelor s degree Candidates should demonstrate: Academic background in environmental studies, indigenous studies, law, public policy, or related disciplines Strong analytical and writing skills Knowledge of indigenous peoples, traditional knowledge, or biodiversity governance Computer literacy in standard software tools Interest in multilateral environmental processes Ability to work across diverse cultural contexts Alignment with the values of the United Nations Professional work experience is not mandatory, but relevant academic specialization is required. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Why You Should Apply This internship is ideal for students and recent graduates interested in: Global biodiversity governance Indigenous knowledge systems Environmental law and policy Multilateral negotiations International environmental diplomacy It offers rare exposure to international policy processes leading up to COP17, making it a valuable stepping stone for careers in environmental governance and global development. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); How to Apply Interested applicants should scroll to the official link provided by the host institution and submit their application before the deadline. The final date to apply is March 7, 2026. Early submission is strongly recommended. For more information click here Discover more opportunities here The post UNEP Traditional Knowledge Internship 2026 (Remote Option Available): Work on Global Biodiversity Policy Ahead of COP17 appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Europe","Internships","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T19:12:42Z","updated_at":"2026-02-25T19:12:42Z"}
{"id":"c96a73fbe7fd9b33f4d752f1c38853cb4306f439","title":"Become a Global Voice for Forests: Apply for the FAO Young Forest Champions Programme 2026","url":"https://opportunitiesforyouth.org/2026/02/24/fao-forest-champions/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T17:43:25Z","summary":"The FAO Young Forest Champions Programme 2026 is a targeted youth leadership initiative supporting young people who are actively advancing forest action in Ghana, Indonesia, Kenya, Peru, Uganda, and Zambia . Led by the Food and Agriculture Organization of the United Nations (FAO) under the AIM4Forests initiative, the programme aims to strengthen youth-led solutions for forest protection, restoration, and sustainable forest management. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The programme recognizes that young people in forest-rich countries are already driving change on the ground. By offering visibility, leadership development, and opportunities to engage with global forest processes, the initiative helps elevate local action to regional and international platforms. About the FAO Young Forest Champions Programme The Young Forest Champions Programme is designed to showcase and support youth-led initiatives that contribute to sustainable forest management and climate resilience in the six participating countries. Through the programme, FAO connects young leaders to global discussions on forests, biodiversity, and climate, while ensuring that local experiences and perspectives inform international policy conversations. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Selected participants become part of a cohort of Young Forest Champions whose work highlights innovative and community-driven approaches to forest stewardship. Why This Opportunity Matters Forests are essential for climate mitigation, biodiversity conservation, and the livelihoods of millions of people. Countries such as Ghana, Indonesia, Kenya, Peru, Uganda, and Zambia are home to critical forest ecosystems that face increasing pressure from deforestation, land degradation, and climate impacts. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); By investing in youth leadership in these contexts, the FAO Young Forest Champions Programme supports locally grounded solutions and strengthens youth participation in forest governance. The programme ensures that young people working directly with forest communities have a voice in shaping broader strategies and policies related to sustainable forest management. Who Can Apply The programme is open to: Young people typically between 18 and 35 years old . Applicants based in Ghana, Indonesia, Kenya, Peru, Uganda, or Zambia . Individuals or representatives of youth-led initiatives focused on forest-related action. Candidates who can demonstrate leadership, innovation, and measurable impact in their work. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Eligible initiatives may include forest conservation, restoration, sustainable forest use, agroforestry, community forestry, forest-based livelihoods, Indigenous and traditional knowledge, research, advocacy, or awareness-raising activities aligned with forest sustainability goals. What the Programme Offers Young Forest Champions receive non-financial support designed to increase visibility and influence, including: Global recognition through FAO platforms and communication channels. Expert mentorship and structured technical training Hands-on experience in forest restoration and ecosystem monitoring Exposure to advanced tools such as remote sensing and digital monitoring technologies Participation in a network of youth forest leaders ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); The programme does not provide direct funding but instead focuses on strengthening leadership, networks, and strategic positioning for long-term impact. Role and Expectations of Young Forest Champions Selected champions are expected to: Share experiences and lessons learned from their forest-related initiatives. Contribute youth perspectives to FAO-led dialogues and campaigns. Inspire peer engagement in forest action at local and national levels. Support knowledge exchange across countries and forest contexts. Selection Process Applications are reviewed by FAO based on: Alignment with forest sustainability and AIM4Forests objectives. Demonstrated leadership and commitment to youth engagement. Evidence of impact and potential for broader influence. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Shortlisted candidates may be contacted for additional information during the review process. Deadline Application deadline: 21 March 2026 Applicants are encouraged to apply early and clearly demonstrate how their work contributes to sustainable forest management in their country. Learn more and apply here . Looking for more opportunities? Check out the Opportunities for Youth website! ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); The post Become a Global Voice for Forests: Apply for the FAO Young Forest Champions Programme 2026 appeared first on Opportunities for Youth .","tags":["education","Africa","unknown"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T19:09:13Z","updated_at":"2026-02-24T19:09:13Z"}
{"id":"7ab348f27dee76b69e6138cbdd08f9a1f7964df4","title":"Apply to a SIT Study Abroad Program for Spring 2027!","url":"https://opportunitiesforyouth.org/2026/02/24/sit-study-abroad/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T17:29:13Z","summary":"Looking for an international study abroad experience that combines rigorous academics with real-world learning? The School for International Training (SIT Study Abroad) offers semester, summer, and academic-year programs across Africa, Asia, Latin America, Europe, and the Middle East. For 2027 , SIT programs provide immersive, field-based learning that allows students to explore critical global issues while earning academic credit. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); SIT programs are designed for students seeking transformative educational experiences that go beyond traditional classroom learning. Participants engage in experiential learning , combining coursework with practical fieldwork, community engagement, and independent research projects. Why Choose SIT SIT Study Abroad is ideal for students who want more than a traditional classroom experience. Programs emphasize intercultural competence, field-based learning, and real-world problem solving , providing skills and experiences that prepare students for careers in international development, environmental science, public health, education, and beyond. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); By combining immersive cultural experiences, academic rigor, and independent research , SIT enables students to develop a global perspective, build professional networks, and gain practical experience that sets them apart in both academic and professional environments. Who Can Apply SIT programs are open to: Undergraduate students enrolled at accredited colleges or universities. Students in good academic standing who meet program-specific prerequisites. Applicants interested in global issues such as sustainability, climate change, human rights, public health, development, and cultural studies . ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Each program may have additional requirements, such as language proficiency or specific prior coursework. Students are encouraged to consult the SIT website for detailed program requirements before applying. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Program Structure SIT Study Abroad programs blend academic instruction with hands-on learning , offering: Thematic courses focused on global challenges such as environmental sustainability, social inequality, migration, and health. Field-based learning , including site visits, community engagement, and applied research projects. Independent Study Projects (ISPs) that allow students to explore a topic of personal interest in depth, often involving field research or collaboration with local partners. Opportunities for cultural immersion, including homestays, local mentorship, and language learning. Semester programs typically run for 12 15 weeks, while academic-year programs can extend up to 30 weeks. Summer programs are shorter, offering 6 7 week immersive experiences with intensive learning and fieldwork. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Academic Credit and Support Students earn fully transferable academic credit through SIT s accredited U.S. institution. Academic advising, on-site staff support, and risk management systems ensure that participants have a safe and academically productive experience. SIT also provides guidance on visa applications, health and safety, and travel arrangements. Financial aid and scholarships may be available for eligible students, depending on program and funding cycles. Prospective participants are encouraged to review the website and consult their home institution s study abroad office early in the planning process. Fields of Study SIT programs cover a wide range of thematic areas: Climate and Environment: Programs exploring sustainability, conservation, and climate action in local contexts. Development and Inequality: Addressing social, economic, and political dimensions of development and social justice. Global Health: Studying public health challenges and community-based health initiatives in diverse regions. Peace, Conflict, and Human Rights: Engaging with issues of governance, migration, and human rights protection. Education and Cultural Studies: Examining learning systems, cultural preservation, and cross-cultural engagement. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Each program is grounded in local context, providing students with real-world exposure to regional challenges and opportunities. Application and Deadlines SIT operates on a rolling admissions basis , which means program availability and deadlines vary by location, academic term, and field of study. Popular programs, including Spring 2027 , fill quickly, so early application is strongly recommended. Applicants should: Review program prerequisites carefully. Coordinate with their home institution regarding credit transfer. Prepare academic transcripts, essays, and recommendation letters in advance. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Completing applications early increases the likelihood of placement in preferred programs and access to financial aid. Explore programs and more details here . Looking for more opportunities? Check out the Opportunities for Youth website! The post Apply to a SIT Study Abroad Program for Spring 2027! appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Continent","Europe","Latin America and the Caribbean","Middle East and North Africa","Short Courses","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T19:09:13Z","updated_at":"2026-02-24T19:09:13Z"}
{"id":"b78d7278f3abf010ec50aa5515042e94b3163f33","title":"Global Africa Translation Fellowship 2026: Up to $5,000 Grant to Translate African and Diaspora Texts into English, Arabic, and Beyond","url":"https://opportunitiesforyouth.org/2026/02/24/global-africa-translation-fellowship-2025-the-africa-institute-paid-remote-opportunity-for-scholars-translators/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T17:16:20Z","summary":"The Global Africa Translation Fellowship 2026, hosted by The Africa Institute at Global Studies University in Sharjah, UAE, is now open for applications. This non-residential fellowship provides funding of up to $5,000 to support the translation of significant works from the African continent and its diaspora into English or Arabic, with other target languages also considered. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); As part of The Africa Institute s African Languages and Translation Program, this initiative seeks to broaden global access to essential texts in African and African Diaspora studies, including literary, theoretical, and critical works that have shaped intellectual traditions across the Global South. About The Africa Institute The Africa Institute is a research and academic institution dedicated to the interdisciplinary study of Africa and its global connections. Based in Sharjah, United Arab Emirates, the Institute fosters scholarship, translation, publication, and dialogue that expands global understanding of African intellectual and cultural production. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The Global Africa Translation Fellowship reflects the Institute s commitment to linguistic accessibility, knowledge circulation, and scholarly exchange across regions. Fellowship Overview The Global Africa Translation Fellowship is designed to: Make foundational African and African Diaspora texts accessible to wider global audiences ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Support translators working across the Global South Encourage retranslations of classic works Fund previously untranslated texts Promote poetry, prose, and critical theory translations The fellowship is non-residential, meaning fellows complete their translation projects remotely and are not required to relocate to the UAE. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Funding ranges from $1,000 to $5,000, depending on: Project scope Complexity Quality of proposal Feasibility within the fellowship timeframe Why This Fellowship Matters Translation plays a vital role in: Knowledge democratization Decolonizing academic discourse Amplifying African voices Strengthening Global South intellectual exchange By funding translation projects, the fellowship enables African scholarship and literature to reach broader audiences and reshape global conversations. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); What Types of Projects Are Eligible? Eligible translation projects include: Previously untranslated African literary or theoretical works Retranslations of classic texts Poetry collections Prose works Critical theory texts Works-in-progress Newly conceived projects that can be completed within the fellowship period The fellowship is flexible in allowing projects that are either underway or newly initiated, provided they are feasible within the grant timeframe. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Funding Structure Grant Amount: $1,000 $5,000 Disbursement: First installment at project commencement Second installment upon successful completion Recipients must submit a copy of the completed translation for archival purposes. The Institute will not publish or use the translation without the awardee s consent. Who Can Apply? The fellowship is open to applicants from across the Global South. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Applicants must demonstrate: Strong translation capacity Academic or professional expertise Ability to complete the proposed work Selection is based on: Quality of proposal Significance of text Feasibility Demonstrated scholarly or translation experience Application Requirements Applicants must submit the following: Two-page CV/Resume Institutional affiliation Highest degree obtained Key publications or translation works ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Two-page Project Summary (single-spaced, font 12) Description of translation Significance of the work Justification for re-translation (if applicable) Proposed completion dates 4 5-page Sample (double-spaced, font 12) Original text excerpt Corresponding translation Copyright Documentation If not in the public domain Copy of copyright notice Letter from copyright holder confirming English-language rights availability ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Attachments must not exceed 3 MB each. Applications must be submitted through the online platform. Email submissions are not accepted. Selection Process Applications are reviewed by: Faculty members Research fellows at The Africa Institute Selection criteria include: Scholarly rigor Translation quality Cultural significance Clarity of proposal Feasibility ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Application Deadline Thursday, March 12, 2026. Late submissions will not be considered. APPLY HERE Contact Information For inquiries: applications@theafricainstitute.org Click here for more information about the Global Africa Translation Fellowship programme 2026. Discover more fellowship opportunities here . The post Global Africa Translation Fellowship 2026: Up to $5,000 Grant to Translate African and Diaspora Texts into English, Arabic, and Beyond appeared first on Opportunities for Youth .","tags":["education","Africa","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T19:09:13Z","updated_at":"2026-02-24T19:09:13Z"}
{"id":"659b113366231ff97c2c931e2a27d2f5dab0c159","title":"Apply Now for Junior Advisor Roles in Copenhagen – with Rasmussen Global 2026 Internship Program","url":"https://opportunitiesforyouth.org/2026/02/24/apply-now-for-junior-advisor-roles-in-copenhagen-with-rasmussen-global-2026-internship-program/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T15:16:19Z","summary":"Are you an ambitious student or recent graduate passionate about international affairs, geopolitics, public policy, and strategic communications ? Here s your chance to join one of Europe s leading geopolitical advisory firms, Rasmussen Global , as a Junior Advisor Intern for the 2026 Fall Internship Program a career-defining opportunity to work at the nexus of policy, politics, and business. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); What Is the Rasmussen Global Internship? Rasmussen Global s 2026 Junior Advisor Internship offers hands-on, professional experience working closely with expert advisers across global capitals, including Copenhagen, Brussels, and beyond. Interns support client work involving international politics, global security, open market advocacy, and strategic policy initiatives all while gaining unmatched exposure to decision-makers and leading industry experts. This internship is ideal for individuals who want to: Build expertise in international relations and geopolitics Gain real-world consulting and advisory experience Work in a dynamic, multicultural professional environment Contribute to shaping narratives on democracy, security, and global policy ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); What You ll Do: Junior Advisor Responsibilities As a Junior Advisor Intern , you will be expected to: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Assist with research and policy analysis on geopolitical topics Draft clear written reports, briefings, and client documents Support senior advisors during strategic planning and outreach Engage with political, business, and media stakeholders Contribute to real, client-facing work that informs decision-making This internship is both challenging and rewarding , requiring initiative, responsiveness, and professionalism . ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Top Benefits of the Internship While specific benefits are usually shared once offers are made, interns historically enjoy: 1.Professional Growth Work with senior experts and former policymakers Gain insights into international consulting and advisory services Build a global professional network 2.International Exposure Multi-location experience (primarily in Copenhagen) Cross-cultural teamwork and global policy engagement ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 3. Career Advantages A standout addition to any CV/portfolio Real world experience in geopolitics and strategy consulting Note: Compensation, travel support, or housing arrangements vary and are typically communicated at the offer stage. Where This Opportunity Is Based Primary Location: Copenhagen, Denmark Secondary collaboration may involve offices and partners in Brussels, Berlin, Madrid, Kyiv, and other global hubs. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Who Should Apply? Qualifications Eligibility This internship is competitive and structured for proactive learners who bring both academic foundation and drive . Ideal Candidate Profile: 1. Current bachelor s or master s student (final year preferred) 2. Studying Political Science, International Relations, Economics, Public Policy, Security Studies, or related fields 3. Strong analytical and communication skills (written + spoken) 4. Proactive, reliable, and capable of working with teams across time zones 5. Interest in geopolitics, international affairs, and cross-sector strategy While Rasmussen Global does not publicly list strict academic thresholds, relevant coursework and demonstrable leadership will make applicants stand out. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); How to Apply Official Links Steps To apply for this prestigious program, follow these steps: Prepare Your Application Materials Updated CV / Resume Motivational cover letter (focused on international affairs goals) Relevant academic transcripts Submit Through Official Channels While Rasmussen s LinkedIn post invites applications, the firm typically hosts application portals or contact emails. If contact emails are shared in future announcements (e.g. office emails for Copenhagen recruitment), be sure to follow those instructions precisely. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Follow Up If you don t hear back within 2 3 weeks, follow up politely to confirm receipt. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Because official applications are not always hosted publicly on LinkedIn, bookmarking the company s career page and professional site strongly increases your visibility. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Apply here Key Deadlines Application Timeline Program Start: Fall 2026 (Exact start dates typically in September/October) Application Deadline: Not officially fixed publicly yet Rasmussen Global typically reviews applications on a rolling basis, so apply early to maximize your chances . ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Tip: Early applications are hugely advantageous firms with rolling deadlines may close positions once they are filled. Insider Tips Boost Your Odds of Winning an Internship Apply well before the end of the submission period Emphasize global experience, research, language skills, and international perspectives Tailor your cover letter to why you specifically want to work at Rasmussen Global Highlight teamwork and analytical skills The Rasmussen Global Junior Advisor Internship 2026 Cohort is a high-impact international opportunity for students and future leaders seeking to launch careers in global affairs consultancy and strategic policy work. Early applications, persuasive materials, and global curiosity are your keys to success. ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); For more information visit here For more global opportunities click here The post Apply Now for Junior Advisor Roles in Copenhagen with Rasmussen Global 2026 Internship Program appeared first on Opportunities for Youth .","tags":["education","Continent","Europe","Internships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T19:09:13Z","updated_at":"2026-02-24T19:09:13Z"}
{"id":"ba29bee9f7b81411604e99333de19b913af7c53b","title":"HIGH IMPACT CLIMATE LEADERSHIP ROLE: Private Equity Stakeholder Project Hiring a Climate Director","url":"https://opportunitiesforyouth.org/2026/02/24/high-impact-climate-leadership-role-private-equity-stakeholder-project-hiring-a-climate-director/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T14:56:04Z","summary":"The Private Equity Stakeholder Project (PESP) has opened applications for a Climate Director (Remote) a rare senior-level opportunity for experienced climate, environmental justice, and corporate accountability professionals to directly challenge private equity s role in the climate crisis. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This is a fully remote, full-time leadership position with a competitive salary, strong benefits, and national-level influence across climate advocacy, sustainable finance, and environmental justice movements. If you have deep experience in climate campaigns, financial research, and leading advocacy teams , this role puts you at the center of high-stakes climate accountability work. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); About the Private Equity Stakeholder Project (PESP) PESP is a nonprofit financial watchdog organization that investigates how private equity firms impact communities, workers, and the environment. The organization focuses on increasing transparency in a sector that often operates behind closed doors especially when it comes to fossil fuel investments, energy infrastructure, and environmental harm . Through rigorous research, data-driven reporting, and coalition-based campaigns , PESP partners with: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Frontline and environmental justice communities Institutional investors Policymakers and regulators Labor unions and advocacy organizations Their work plays a growing role in shaping climate accountability within global finance. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Role Overview: Climate Director (Remote) The Climate Director will lead PESP s Climate Team and oversee all research, strategy, and campaign efforts focused on private equity s climate impact. This role blends: Strategic research leadership Corporate accountability campaigning Team management Coalition and investor engagement Environmental justice advocacy You ll report directly to the Executive Director and help shape national-level climate accountability strategies. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Why This Role Matters Private equity is reshaping the global energy system often quietly, and often in ways that accelerate climate harm . As Climate Director, you will: Confront opaque financial power structures Support communities on the frontlines of fossil fuel investment Influence investor behavior and policy discussions Help align financial systems with climate and justice goals This is not just a job it s a platform for high-impact climate leadership at a moment when accountability in finance has never mattered more. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Strategic Purpose of the Role Private equity firms control vast portfolios in: Fossil fuel extraction Power generation Energy infrastructure Carbon-intensive industries Yet they often face limited public oversight . The Climate Director s mission is to close this accountability gap by: Exposing harmful investment practices Building powerful coalitions Pressuring asset managers toward climate-aligned behavior Supporting frontline communities affected by fossil fuel investments ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Core Responsibilities 1. Climate Accountability Environmental Justice Leadership Lead PESP s corporate accountability work in the energy and fossil fuel sectors Identify pathways for systemic reform in private equity investment practices Center environmental justice and frontline community voices ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); 2. Team Leadership Management Supervise and mentor multiple research and campaign staff Strengthen internal research, advocacy, and data capacity Support professional growth and skill development 3. Research Oversight Data Strategy You will oversee sophisticated research initiatives, including: Managing multi-staff research workflows Developing and maintaining datasets on private equity energy investments Analyzing environmental and climate impact data Producing high-impact public reports for investors, policymakers, and advocates Collaborating across organizations on shared data systems 4. Campaign Strategy Public Engagement Design and execute strategic campaigns targeting private asset managers Set campaign priorities and action plans Coordinate with communications and design teams Edit reports for legal accuracy and strategic clarity Engage with media, policymakers, investors, unions, and grassroots groups ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); 5. Coalition Relationship Building Build partnerships with: Environmental justice organizations Frontline community groups ESG-focused institutional investors Climate and accountability coalitions Translate complex financial research into compelling, accessible narratives 6. Travel Organizational Reporting Report directly to the Executive Director Participate in occasional travel for coalition meetings, campaigns, and stakeholder engagement ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Required Experience Qualifications PESP is seeking senior-level candidates with: 1. Professional Experience 10+ years in strategic research and/or advocacy campaigning Proven leadership experience managing teams Demonstrated success in environmental justice or climate campaigns Experience developing and executing campaign strategies 2. Technical Data Skills Hands-on experience with: Large datasets and data analysis Airtable or SQL (data management) R or Python (analysis) Data visualization tools ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); 3. Communication Advocacy Exceptional written and verbal communication skills Experience engaging: Investors Policymakers Media Labor unions Community-based organizations 4. Values Commitment Strong understanding of financial advocacy within climate movements Deep commitment to social, economic, and climate justice Applications strongly encouraged from women, BIPOC, and LGBTQ+ candidates Salary, Compensation Benefits Salary Range: $105,000 $120,000 USD , based on experience Benefits Include: Medical, dental, and vision insurance 401(k) retirement savings plan Comprehensive employee benefits package Fully remote work structure ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); This compensation reflects the seniority, leadership responsibility, and national impact of the role. How to Apply: Applicants must complete a detailed online application form , including written responses addressing: Motivation for applying Commitment to social, economic, and climate justice Experience in environmental justice campaigns Experience analyzing environmental impact data Leadership and team management experience ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); Apply here IMPORTANT: Do NOT use artificial intelligence when writing your application responses or submitting writing samples. PESP explicitly evaluates authentic writing and communication skills. Application Deadline: 6th March 2026 For more information visit here For more global opportunties click here The post HIGH IMPACT CLIMATE LEADERSHIP ROLE: Private Equity Stakeholder Project Hiring a Climate Director appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Continent","Europe","Jobs","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T19:09:13Z","updated_at":"2026-02-24T19:09:13Z"}
{"id":"fa2539439c77c770fc0770561d4c64e62e46d59b","title":"Nelson Mandela Foundation is Hiring: International Relations Consultant","url":"https://opportunitiesforyouth.org/2026/02/24/nelson-mandela-foundation-is-hiring-international-relations-consultant/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T14:49:52Z","summary":"The Nelson Mandela Foundation is inviting applications for an International Relations Consultant to support its global justice programme. This is a 12-month independent contract that can be structured as either part-time or full-time , depending on the availability of the successful candidate. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This role offers a unique opportunity to contribute to impactful work advancing peace, human rights, and democracy across Africa and globally , in line with the legacy of Nelson Mandela . About the Role The consultant will support the Foundation s regional justice project , helping drive research, advocacy, and stakeholder coordination efforts that address contemporary political challenges across the African continent. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The role is ideal for a professional with strong grounding in political theory, African regional dynamics, and international relations , combined with the ability to engage with evolving political narratives and global power structures. Background Programme Focus Global justice is a strategic priority for the Foundation. Its work seeks to: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Promote awareness and action on peace, human rights, and democracy Address interconnected global and African conflicts Challenge structural inequalities and global power imbalances Foster equitable and democratic societies across the continent ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Through research, convening, and coalition-building, the Foundation aims to strengthen leadership, public awareness, and policy engagement on pressing African justice issues. Key Responsibilities The International Relations Consultant will: Support the Head of Department in implementing the regional justice project Conduct policy research and analysis on African and global justice issues ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Lead stakeholder engagement and convening Contribute to organisational knowledge and strategic insights Provide ad-hoc international relations research support across programmes Qualifications Experience To be considered, candidates should have: A Bachelor s or postgraduate degree in International Relations or a related field 3 5 years of relevant professional experience Demonstrated experience working on African regional issues Strong skills in research, writing, networking, and coordination Proficiency in Microsoft Office and digital collaboration tools ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Contract Details Contract Type: Independent consultant Duration: 12 months Work Arrangement: Part-time or full-time (depending on availability) Location: Flexible (with coordination across Foundation programmes) Why This Opportunity Matters This role is more than a consultancy it is a chance to shape conversations and action on justice in Africa and beyond . You will contribute to meaningful work that advances equity, strengthens democratic values, and challenges systems of oppression. Key Skills and Expertise The Foundation is seeking candidates with strong analytical and communication capabilities, including: ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Excellent research and writing skills Sound understanding of international relations , including: Peace and justice International governance and cooperation Political economy Ability to work independently and manage outputs Strong stakeholder engagement and relationship management skills Effective written, verbal, and listening communication abilities Required Attributes and Competencies Successful applicants will demonstrate: A proactive mindset and initiative A structured and organised approach to delivering outputs A solution-oriented work ethic The ability to engage effectively with diverse stakeholders ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application Process Please send the following documentation and information to recruitment@nelsonmandela.org Required Application Materials Updated CV with two contactable references Availability details (part-time or full-time; if part-time, specify days available per week) Salary expectations (for part-time or full-time) Earliest available start date Application Deadline 6 March 2026 Applications received after the deadline may not be considered, so early submission is strongly encouraged. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); For more detail about this role, click Here. This role is ideal for professionals passionate about policy, research, and social justice , who want to make a meaningful contribution to governance and public dialogue in South Africa and beyond. If you have the skills, passion, and commitment to drive change this is your opportunity to join one of Africa s most influential legacy institutions. Discover more Job opportunities Here The post Nelson Mandela Foundation is Hiring: International Relations Consultant appeared first on Opportunities for Youth .","tags":["education","Jobs","Africa","Continent"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T19:09:13Z","updated_at":"2026-02-24T19:09:13Z"}
{"id":"7c4ca2bc2b50e0b4c2f71127fa8df0fdde345226","title":"Apply Now: Atlantic Fellows for Health Equity 2026 – Fully Funded Global Leadership Fellowship to End Health Disparities","url":"https://opportunitiesforyouth.org/2026/02/24/apply-now-atlantic-fellows-for-health-equity-2026-fully-funded-global-leadership-fellowship-to-end-health-disparities/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T14:49:13Z","summary":"Are you a passionate early to mid-career leader committed to ending health disparities? Do you dream of joining a global network of change-makers equipped with the knowledge, skills, and network to transform health equity in your organization or community? If yes, this is one of the most powerful opportunities worldwide for emerging leaders like you. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); What Is the Atlantic Fellows for Health Equity Fellowship? The Atlantic Fellows for Health Equity is a fully funded, one-year leadership fellowship designed to develop global professionals committed to tackling inequities in health and well-being. It brings together diverse participants across sectors from healthcare and academia to law, media, housing, business, research, and more building leaders with a cross-sector mindset to drive impactful change. The fellowship is hosted by the Milken Institute School of Public Health at the George Washington University and is part of the Atlantic Fellows global community , a network dedicated to advancing equity around the world. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); What You ll Do: Program Structure Once selected, Fellows are expected to: Attend in-person convenings throughout the year (total ~4 weeks) Participate in a robust online curriculum (biweekly sessions + mentorship + team learning) Engage in peer mentoring, coaching, and leadership development Develop and advance a health equity project during the fellowship year ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); This hybrid learning experience includes both virtual and face-to-face components , designed to build real-world leadership and impact skills. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Benefits: Fully Funded Empowering One of the most compelling aspects of this fellowship is what it covers: 1. 100% of educational experiences and travel expenses are covered 2. Access to a global network of leaders in health equity 3. Leadership coaching, mentoring, and training 4. Collaborative peer community and lifelong connections 5. Opportunity to implement a meaningful project with expert support 6. Professional growth that strengthens your career and influence Note: There is no stipend or salary provided , and Fellows are expected to remain employed while participating. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Who Should Apply? Eligibility Qualifications The fellowship seeks candidates who: Are early to mid-career professionals Are currently engaged in health-related work Hold or have the potential for leadership roles Are motivated to address health inequities globally Value diverse perspectives and collaborative work Are proficient in English No specific degree or profession is required the program welcomes leaders from across disciplines including public health, medicine, law, research, government, social enterprise, media, and more. Apply here Selection Criteria: What Makes You Stand Out Candidates are evaluated based on: Strength of Statement of Interest Why you want this fellowship ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Project Proposal Quality Innovative, impactful health equity project Leadership Experience Commitment Demonstrated through your work Letters of Recommendation Professional references that speak to your potential Employer Support Form Signed by a supervisor confirming your participation ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Application Components Checklist Before you apply, be ready with: 1. Personal background information 2. Short written responses about your leadership journey 3. Project proposal details and expected impact 4. Employer Support Form (signed) 5. Two letters of recommendation (one from supervisor) 6. Current CV or Resume 7. Recorded video responses (after written submission) Pro tip: Prepare your written answers offline using the official worksheet available on the application page to ensure quality and accuracy. Important 2026 2027 Deadlines Timeline You can apply now to the 2027 cohort , which follows the 2026 application cycle. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application Timeline (2026 2027 Cycle): Event Date Applications Open February 18, 2026 Informational Webinar February 25, 2026 Application Deadline March 18, 2026 Applications Reviewed April May 2026 Interviews Invited June 2026 Acceptance Notifications Late July 2026 Program Year January November 2027 (approx.) Joining the Atlantic Fellows for Health Equity is not just about gaining skills it s about becoming part of a global force shaping the future of health justice . Alumni continue to collaborate, influence policy, and lead major initiatives long after the fellowship year ends. For more information visit here For more global opportunities click here The post Apply Now: Atlantic Fellows for Health Equity 2026 – Fully Funded Global Leadership Fellowship to End Health Disparities appeared first on Opportunities for Youth .","tags":["education","Fellowship","Africa","America","Continent","Europe","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T19:09:13Z","updated_at":"2026-02-24T19:09:13Z"}
{"id":"5e67675996a25495cc11f1665f1bcc7530143408","title":"Apply for DW Akademie Mini Grants for Media Outlets Reporting on Gender Based Violence Online in Syria","url":"https://opportunitiesforyouth.org/2026/02/24/apply-for-dw-akademie-mini-grants-for-media-outlets-reporting-on-gender-based-violence-online-in-syria/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T14:22:42Z","summary":"If you are a media outlet operating in Syria and passionate about strengthening ethical, gender-sensitive journalism this is one of the most valuable grant opportunities available right now. It offers training, mentorship, and mini-grants of up to 7,000 to support impactful reporting on gender-based violence online and elevate women s voices in media. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); What This Grant Is All About DW Akademie , the international media development arm of Germany s public broadcaster Deutsche Welle, has launched a dedicated Call for Applications aimed at media outlets across Syria. The initiative forms part of the project Strong Female Voices for a United Syria , funded by the German Ausw rtiges Amt (Federal Foreign Office) . This mini-grant scheme is designed to empower media organisations and journalists to: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Implement ethical, gender-sensitive reporting on online gender-based violence (GBV) Develop internal newsroom policies and protective measures for female journalists Build stronger networks for countering disinformation and online violence Receive hands-on support through training and mentorship to elevate quality reporting in challenging environments Grant Value Benefits Selected media outlets will receive: 1. Mini-Grants of up to 7,000 per organisation to implement proposed activities 2. Training Workshops on gender-sensitive reporting and newsroom safety 3. Mentorship and Coaching from experienced media professionals 4. Support developing ethical internal policies for newsroom gender inclusion 5. Opportunity to enhance visibility and strengthen media impact in Syria ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); This funding is not just financial it s a chance to build editorial capacity and amplify under-represented voices through ethical, survivor-centered journalism. Why This Matters Gender-based violence especially in online environments is a pressing issue in the Syrian context, where digital dynamics intersect with longstanding social challenges. Media reporting on GBV not only exposes systemic abuses but also helps shape public understanding and policy responses. This mini-grant programme supports media outlets that are ready to take on that responsibility with professional rigor and social impact. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Who Can Apply This opportunity welcomes media outlets from across Syria that are committed to journalistic integrity and impactful reporting on issues affecting women and girls in the digital space. Your organisation is encouraged to apply if you: 1. Are a registered media organisation working in print, broadcast, or digital formats 2. Have a track record in producing news, features, or investigative reporting 3. Are focused on issues including gender equality, digital safety, media ethics, or human rights 4. Are ready to implement concrete activities and reporting plans on gender-based violence online How to Apply Submission Requirements To apply, media outlets should prepare and submit a comprehensive application that typically includes: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Organisation Profile: Background, mission, and editorial focus Project Proposal: Clear description of planned activities to report on gender-based violence online, including goals, methods, timelines, and impact expectations Budget Plan: Justified use of the 7,000 or less grant for project implementation Team Information: Bios of key staff who will execute the project ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Contact Details: Primary contact person for communication and follow-up Apply here Ensure your submission is complete before the deadline late or partial applications will not be considered. Key Deadlines Timeline Application Deadline: 28th February Apply for DW Akademie Mini Grants for Media Outlets Reporting on Gender Based Violence Online in Syria2026 applications must be submitted by this date to be considered ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Award Announcements: Shortly after review Implementation Period: Following selection, grant activities and project implementation will begin in early 2026 Tips for a Strong Application Clearly define the scope and impact of your reporting plan Highlight how your outlet will implement ethical reporting standards Demonstrate your editorial capacity and organisational readiness to deliver Include gender safety measures for journalists in your strategy Show how your project contributes to long-term newsroom improvements This grant opportunity presents a significant boost for Syrian media outlets committed to ethical journalism, gender justice, and digital safety, with 7,000 in support, expert guidance, and lasting newsroom impact. Don t miss this chance to elevate your reporting, strengthen your organisation s policies, and contribute meaningfully to transforming media narratives around gender-based violence. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); For more information visit here For more global opportunities click here The post Apply for DW Akademie Mini Grants for Media Outlets Reporting on Gender Based Violence Online in Syria appeared first on Opportunities for Youth .","tags":["education","Continent","Asia","Grants"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T19:09:13Z","updated_at":"2026-02-24T19:09:13Z"}
{"id":"a3c9aafeb38aff3e2964838d31e772a71654228d","title":"Mastercard Foundation EdTech Fellowship 2026 (Cohort 3): Equity-Free Grant of Up to $60,000 for Growth-Stage EdTech Startups in Egypt with African Founders","url":"https://opportunitiesforyouth.org/2026/02/24/mastercard-foundation-edtech-fellowship-2026-cohort-3-equity-free-grant-of-up-to-60000-for-growth-stage-edtech-startups-in-egypt-with-african-founders/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T12:48:02Z","summary":"The Mastercard Foundation EdTech Fellowship 2026 (Cohort 3), delivered in partnership with EdVentures, is a transformative acceleration program designed to scale growth-stage EdTech startups in Egypt while driving inclusive, technology-enabled learning across Africa. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This 7 8 month fellowship empowers startups to expand market reach, strengthen business models, and increase access to digital education solutions particularly for women, youth (18 35), refugees, and people with disabilities. The program offers equity-free funding of up to $60,000, expert mentorship, Carnegie Mellon University (CMU) learning sessions, in-kind business services, and two years of post-program support. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Program Overview: Scaling EdTech for Impact Across Africa The Fellowship aims to revolutionize the MENA EdTech ecosystem through: Digital innovation Inclusive education solutions Youth empowerment Sustainable job creation Gender equity African-led entrepreneurship ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); It aligns with the strategic goals of the Mastercard Foundation and EdVentures to drive long-term transformation in education systems while strengthening entrepreneurship in Egypt with an African focus. Key Program Details Duration: 7 8 months Post-Program Support: 2 years Location Requirement: Incorporated in Egypt Eligible Founders: African origin or residing in Africa Funding: Equity-free grant of up to $59,600 $60,000 Stage: Growth-stage EdTech startups ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Who Can Apply? The program is open to: EdTech startups incorporated in Egypt Growth-stage startups operating for at least three years Startups with a developed product and post-revenue status Market-ready and scalable EdTech solutions Founders of African origin or residing in Africa Youth founders aged 18 35 (preferred) Women-led startups (preferred) The program strongly encourages solutions focused on inclusion, particularly those serving: Women and girls Young people Refugees People with disabilities ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Fellowship Benefits Selected startups receive: Mentorship Opportunities Guidance from experienced industry leaders and business experts. Training Sessions Structured growth-focused learning including business scaling strategies. Science of Learning Courses Specialized learning modules to strengthen education technology design. Networking Events Access to investors, partners, and ecosystem leaders. Equity-Free Grant Up to $60,000 in non-dilutive funding. Carnegie Mellon University (CMU) Support Advanced knowledge-sharing sessions and growth advisory. In-Kind Services Marketing services Legal services Cloud services Studio services Fintech solutions Media PR support Partner matchmaking ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Program Structure and Journey The Fellowship journey includes: Application submission Screening and shortlisting Initial interviews Intensive Bootcamp (3 days outside Cairo at a reputed hotel) Final presentations and pitch Official onboarding into the program 7 8 month acceleration phase Two years of post-program support The program incorporates milestone-driven monitoring and evaluation to ensure measurable growth outcomes. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); FREQUENTLY ASKED QUESTIONS (FAQ) What is the selection process like? The selection process includes: Application Screening Initial Interview Bootcamp Phase Final Pitch Presentation Official Program Entry What is EdTech? EdTech refers to technology-based tools, platforms, and solutions designed to enhance education systems, teaching methods, learning experiences, and institutional effectiveness. What criteria are used to evaluate applicants? Applicants are evaluated based on: The problem being solved Innovation and technology uniqueness Market potential Team expertise Scalability Alignment with program goals Social impact ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); What is the objective of the program? The Fellowship aims to empower growth-stage EdTech startups to scale operations and increase access to technology-enabled learning, with emphasis on women, youth, refugees, and people with disabilities. What are the eligibility criteria? Startups must: Be incorporated in Egypt Have operated for at least 3 years Be growth-stage with MVP and post-revenue Offer scalable EdTech solutions Preferably be women-led Preferably have youth founders (18 35) Encourage inclusive education models What resources will participants receive? Participants receive: Mentorship Workshops CMU sessions Networking In-kind services Equity-free grant funding Post-program support ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); How is the program structured? The program includes: Workshops Knowledge-sharing sessions Mentorship Networking Monitoring Evaluation support What is the program duration? 7 8 months, plus two years of post-program support. Where will the Bootcamp take place? Outside Cairo for three days in a reputed hotel. What stage should my startup be in? Growth-stage with developed product and post-revenue. Can I be a solo founder? Solo founders may apply, but teams with at least two co-founders and gender diversity are preferred. Application Deadline No specific deadline is publicly stated. Applications are currently open. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); APPLY HERE For more information about the Mastercard Foundation EdTech Fellowship, click HERE Visit HERE for more fellowship opportunities. The post Mastercard Foundation EdTech Fellowship 2026 (Cohort 3): Equity-Free Grant of Up to $60,000 for Growth-Stage EdTech Startups in Egypt with African Founders appeared first on Opportunities for Youth .","tags":["education","Africa","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T19:09:13Z","updated_at":"2026-02-24T19:09:13Z"}
{"id":"c1f196565b5c5021d1e6063f77ca513823760da9","title":"Realizing the Youth, Peace and Security Agenda: UNSSC Online Course 2026","url":"https://opportunitiesforyouth.org/2026/02/24/realizing-the-youth-peace-and-security-agenda-unssc-online-course-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T12:06:41Z","summary":"The United Nations System Staff College (UNSSC), in collaboration with the Folke Bernadotte Academy (FBA), is offering its flagship programme Realizing the Youth, Peace and Security Agenda in 2026. This comprehensive online learning experience equips practitioners with the skills and knowledge needed to meaningfully engage young people in peace and security efforts. The course runs from 13 April to 30 October 2026 , with enrollment open until 10 April 2026 . ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the UNSSC Course Young people are increasingly recognised as agents of positive change in conflict prevention, peacebuilding, and the promotion of just and inclusive societies. UN Security Council Resolutions 2250 (2015), 2419 (2018), and 2535 (2020) emphasize the need for youth participation, leadership, and influence in peace and security initiatives at local, national, and global levels. This course provides participants with a structured pathway to understand the Youth, Peace and Security (YPS) agenda and to apply it effectively within their own organizations, programmes, and communities. It is designed for practitioners across the UN system, NGOs, civil society, regional bodies, and security institutions working in youth engagement or peacebuilding contexts. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Course Format and Structure The programme is delivered fully online and is divided into two distinct learning phases: Part I Foundational Skills (13 April to 22 May 2026) Participants will complete three core modules that introduce the YPS agenda and explore the foundations of youth participation and conflict analysis. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Modules include: Introduction to the Youth, Peace and Security Agenda Enabling Meaningful Youth Participation Conducting Youth-Sensitive Conflict Analysis This phase includes one mandatory written assignment. Part II Applied Skills (14 September to 30 October 2026) Participants will select at least one of the three applied modules, each designed to translate YPS principles into practice. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Elective modules include: Serving as a YPS Adviser or Focal Point Youth-Responsive and YPS-Focused Programming In-Country Implementation of the YPS Agenda This second phase includes at least one written assignment. Across both parts, learners can expect approximately 3 4 hours of weekly study. The programme also includes facilitated webinars, peer exchanges, interactive activities, and ongoing guidance from UNSSC trainers. What Participants Gain By completing the course, participants will: Develop a strong understanding of youth roles in peace and security systems ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Strengthen their ability to design and implement youth-responsive initiatives Learn how to integrate youth perspectives into conflict analysis and programming Enhance their competency in supporting youth-led peacebuilding efforts Engage in a global peer network of practitioners committed to the YPS agenda ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); The course fosters both theoretical grounding and practical skills, preparing participants to champion youth participation in decision-making processes. Target Audience The programme is open to: UN staff members Practitioners in international and regional organisations NGO and civil society representatives Peacebuilding professionals working directly with youth Anyone seeking structured training in the YPS agenda This course is suitable for participants at all levels of experience, and no prior specialization is required. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Cost and Selection Criteria The course fee is 1,250 USD , covering access to all modules, live sessions, materials, and individualized support. Selection is based on motivation, relevant experience, commitment to the agenda, and diversity factors such as regional representation, gender balance, and sector background. UN staff applicants must include a supervisor endorsement. Important Dates Course Dates: 13 April 30 October 2026 Part I: 13 April 22 May 2026 Part II: 14 September 30 October 2026 Enrollment Deadline: 10 April 2026 ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application can be accessed from here . To know more about such opportunities, click here . The post Realizing the Youth, Peace and Security Agenda: UNSSC Online Course 2026 appeared first on Opportunities for Youth .","tags":["education","Short Courses","Europe","conflict analysis skills","online peacebuilding course","peace and security practitioners","UNSSC 2026","youth participation in peace","Youth Peace and Security","YPS agenda training"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T19:09:13Z","updated_at":"2026-02-24T19:09:13Z"}
{"id":"08b2da91a785ab28bfffa186f4d494d6ff642672","title":"Master AI in Just 10 Hours: Google Launches Game-Changing AI Professional Certificate on Coursera","url":"https://opportunitiesforyouth.org/2026/02/23/master-ai-in-just-10-hours-google-launches-game-changing-ai-professional-certificate-on-coursera/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T17:44:50Z","summary":"Google has officially launched its first AI Professional Certificate, expanding its Generative AI catalog on Coursera, which has already attracted nearly three million enrollments globally. This new program is designed to help professionals integrate artificial intelligence into their daily work with practical, job-ready skills that go beyond basic prompting. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); As AI fluency rapidly becomes a baseline expectation across industries, this certificate positions learners to stay competitive in an evolving workforce. According to recent research conducted by Google and IPSOS, more than half of job postings requesting AI skills are now outside traditional IT and computer science roles. However, only 40% of American workers currently use AI at work. This certificate aims to close that gap. What Makes the Google AI Professional Certificate Unique? The Google AI Professional Certificate focuses on universal, transferable skills developed through analysis of hundreds of job descriptions and collaboration with employers. It emphasizes hands-on learning and responsible AI use. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Every learner who enrolls receives: Three months of no-cost access to Google AI Pro Practical experience using Google s advanced AI models A portfolio of real-world AI projects Additionally, Google is offering free access to the certificate for U.S. small businesses, alongside tools such as Google Workspace Business Standard to support AI adoption nationwide. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Program Structure and Courses The certificate can be completed in approximately 10 hours and includes seven short courses plus a hands-on capstone project. Courses include: AI Fundamentals Learn foundational generative AI concepts and responsible evaluation of AI outputs. AI for Brainstorming and Planning Use AI to generate structured project plans. AI for Research and Insights Synthesize information for faster decision-making. AI for Writing and Communication Craft persuasive and audience-specific messaging. AI for Content Creation Develop and critique multimedia assets responsibly. AI for Data Analysis Convert complex datasets into clear, actionable insights. AI for App Building Build a custom AI-powered solution using natural language. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Throughout the program, learners work with tools such as Gemini, NotebookLM, and AI Studio, gaining hands-on experience directly from Google experts. Skills You Will Gain By the end of the certificate, participants will have developed: Reusable AI prompts Data-driven project plans AI-generated research and visual content A custom AI-powered application Strong understanding of responsible AI practices ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); The program is ideal for working professionals seeking to future-proof their careers and organizations aiming to upskill their teams. Deadline No official deadline has been announced. Enrollment is currently open. APPLY HERE For more information on this opportunity , click here. For more opportunities, click here. The post Master AI in Just 10 Hours: Google Launches Game-Changing AI Professional Certificate on Coursera appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Europe","Latin America and the Caribbean","Middle East and North Africa","Short Courses","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T19:11:42Z","updated_at":"2026-02-23T19:11:42Z"}
{"id":"b3df11a30e250ea25a553df187ce332454b27b2b","title":"Launch Your Career in Civic Engagement: Apply for the CIVICUS Communications & Network Engagement Internship","url":"https://opportunitiesforyouth.org/2026/02/23/launch-your-career-in-civic-engagement-apply-for-the-civicus-communications-network-engagement-internship/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T17:27:59Z","summary":"Are you passionate about civil society, citizen activism, and positive social change? CIVICUS, a global alliance of over 15,000 members across 189 countries, is looking for a Communications and Network Engagement Intern to join their team. This internship offers a unique opportunity to contribute to a worldwide mission defending people power and amplifying excluded voices, especially from the Global South. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); As a Communications and Network Engagement Intern, you will play a vital role in supporting CIVICUS global engagement through digital platforms. Your responsibilities will include creating compelling digital content, engaging with networks and membership, and collaborating with communicators across sectors to foster civic action. This role is perfect for someone who enjoys blending creativity, analytics, and relationship-building in a meaningful context. Key Responsibilities: Develop creative digital content for LinkedIn, X, Facebook, Instagram, and TikTok. Strengthen network engagement with CIVICUS Narratives Network and members. Build relationships with communicators across civil society sectors. Support initiatives that amplify citizen activism and civic participation. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Eligibility Requirements: Degree or equivalent experience in communications, marketing, social media, creative content development, or a related field. Excellent command of English; knowledge of a major Global South language is a plus. Experience in social media content creation, management, and analytics. Commitment to positive social change and civil society work. Strong interest in community engagement and civic action communications. How to Apply: Applications close 5th March 2026 at 11:59 PM SAST. Your application should include: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); A detailed CV including education, professional qualifications, significant positions, responsibilities, and achievements. A one-page cover note explaining your motivation for applying. Shortlisted candidates will be contacted within two weeks of the closing date. All applicants will be updated once the position has been filled. CIVICUS reserves the right to withdraw any vacancy at any time. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); This internship is an excellent pathway for emerging communicators and social change makers looking to gain hands-on experience in global civic engagement and digital network strategy. Deadline : 5th March,2026. APPLY HERE For more information on this opportunity, click here. For more job opportunities, click here . The post Launch Your Career in Civic Engagement: Apply for the CIVICUS Communications Network Engagement Internship appeared first on Opportunities for Youth .","tags":["education","Internships","Africa","America","Asia","Australia and Oceania","Europe","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T19:11:42Z","updated_at":"2026-02-23T19:11:42Z"}
{"id":"dd9cbc178bfa015e6e8e43cb179f63778b5a95b6","title":"EPIC Launches Brandt Research Fellowship and 2026–27 Pre-Doctoral Research Professional Roles in Climate & Energy Economics","url":"https://opportunitiesforyouth.org/2026/02/23/epic-launches-brandt-research-fellowship-and-2026-27-pre-doctoral-research-professional-roles-in-climate-energy-economics/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T17:12:30Z","summary":"The Energy Policy Institute at the University of Chicago (EPIC) has announced a major expansion of its early-career research opportunities with the launch of the Brandt Research Fellowship , alongside multiple full-time pre-doctoral Research Professional positions for the 2026 27 academic cycle. These opportunities are designed to strengthen global research and policy impact in climate change, energy markets, and environmental economics. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The Brandt Research Fellowship is supported by a generous gift from Ted Brandt, MBA 87, founder and CEO of Marathon Capital, a clean-economy-focused advisory firm. The fellowship operates within EPIC s highly regarded Pre-Doctoral Fellows Program, which serves as a bridge between undergraduate or master s education and doctoral study. Brandt emphasized the importance of rigorous energy research in today s global economy, noting that energy economics and geopolitics influence nearly every sector. Through this fellowship, EPIC continues to ask critical policy questions and deliver evidence-based solutions that shape decision-making worldwide. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); About the EPIC Pre-Doctoral Fellows Program Brandt Research Fellows join EPIC for one or two years, working closely with EPIC-affiliated faculty and researchers. Fellows gain hands-on experience across all stages of the research process, including project management, data collection and analysis, manuscript preparation, and policy engagement. Research spans energy markets, climate impacts, environmental externalities, and public policy, often using quasi-experimental and experimental methods with large-scale global datasets. EPIC pre-doctoral alumni have gone on to top PhD programs worldwide, and several have received highly competitive National Science Foundation grants. Fellows leave the program with advanced technical skills, strong professional networks, and deep exposure to policy-relevant research. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Research Focus and Methodology Research projects typically involve environmental and energy data from the United States, India, China, and other regions. Fellows apply advanced quantitative methods, computational modeling of energy markets, and policy evaluation techniques. In addition to research responsibilities, fellows participate in seminars and classes at EPIC, the University of Chicago , and partner institutions. Open Positions for the 2026 27 Academic Cycle EPIC is currently recruiting for multiple full-time, benefits-eligible Research Professional (Pre-Doctoral Fellow) roles beginning in Spring Summer 2026: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Research Professional Climate Impact Lab (Michael Greenstone) Fellows will work under the direction of Michael Greenstone , contributing to globally influential research that quantifies climate change impacts across sectors such as health, agriculture, labor, energy, conflict, migration, and coastal systems. This work supports the development of empirically derived estimates of the social cost of carbon. Salary range: $55,000 $62,000 annually Additional $2,000 professional development fund Duration: 1 2 years Expected start date: Spring Summer 2026 Applications reviewed on a rolling basis Research Professional Fiona Burlig, Erin Kelley Greg Lane This role focuses on experimental and data-intensive research in developing-country agriculture, climate adaptation, insurance markets, and climate risk forecasting, including randomized controlled trials in India. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Salary range: $55,000 $62,000 annually Additional $2,000 professional development fund Expected start date: July 1, 2026 Duration: 1 2 years APPLY HERE . For more information about this apportunity, click here . Discover more research fellowship opportunities here . Application Timeline and Deadlines Fall application cycle: Mid-November, with final decisions in mid-December Winter application cycle: Early March, with final decisions by late March ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Applicants must have completed a Bachelor s or Master s degree by June of the year of application and demonstrate strong quantitative and programming skills. EPIC offers a competitive salary, comprehensive benefits, and an exceptional research environment that prepares fellows for top-tier doctoral programs. The post EPIC Launches Brandt Research Fellowship and 2026–27 Pre-Doctoral Research Professional Roles in Climate Energy Economics appeared first on Opportunities for Youth .","tags":["education","Fellowship","Africa","America","Asia","Australia and Oceania","Continent","Europe","Jobs","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T19:11:42Z","updated_at":"2026-02-23T19:11:42Z"}
{"id":"0c656b4be6f9d9c2a9d781cee16dbdee0199418e","title":"Leadership Academy 2026 for African Youth: 10-Week Virtual & In-Person Leadership Program Empowering the Next Generation of African Leaders","url":"https://opportunitiesforyouth.org/2026/02/23/leadership-academy-2026-for-african-youth-10-week-virtual-in-person-leadership-program-empowering-the-next-generation-of-african-leaders/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T17:05:37Z","summary":"The Leadership Academy 2026 is now officially open for applications from February 1st, 2026. Designed to equip young Africans with transformative leadership, personal development, and professional skills, this comprehensive program empowers the next generation of ethical, community-driven leaders across the continent. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Organized by Leading Change Africa, the Leadership Academy is delivered through multiple formats virtual (English French) and select in-person cohorts in Burkina Faso and Mali ensuring accessibility across diverse African contexts. Application Windows: Virtual Leadership Academy (English French): February 1 28, 2026 In-Person Leadership Academy (Burkina Faso Mali): February 1 April 12, 2026 ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The 10-week virtual program runs from April to June 2026. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); What Is the Leadership Academy? The Leadership Academy is a structured leadership development initiative designed to strengthen African youth by building foundational and advanced leadership capabilities. It combines digital learning, facilitated discussions, mentorship, applied projects, and peer collaboration. The program is rooted in the belief that Africa s transformation depends on values-driven, socially responsible leaders equipped with modern professional and digital skills. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Through a blended learning approach, participants gain practical tools to: Lead themselves with clarity and integrity Influence others effectively Develop strategic thinking capabilities Build collaborative networks Apply leadership knowledge to real community challenges Program Formats: Choose Your Leadership Academy Track The Leadership Academy is structured to accommodate diverse learning needs and geographic realities. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 1. Virtual Leadership Academy (English French) The Virtual Leadership Academy is a 10-week online experience delivered via the YAM.edu platform. It includes: Self-paced learning modules Facilitated live virtual sessions Assignments and reflective exercises Group projects Personalized mentorship Peer-to-peer collaboration Access to guest speakers through the Inspiring Journeys Series This format allows African youth across the continent to participate regardless of location. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Application Window: February 1 28, 2026 Program Period: April June 2026 2. In-Person Leadership Academy (Burkina Faso Mali) The in-person track provides hands-on leadership development through: Physical workshops Community engagement projects Direct mentorship Experiential leadership activities These cohorts are location-based and subject to availability and selection criteria. Application Window: February 1 April 12, 2026 Program Objectives The Leadership Academy aims to: Develop transformative leadership capacity among African youth Strengthen self-awareness, integrity, communication, and ethical decision-making Bridge theory and practice through real-life case studies and applied group projects ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Strengthen digital and professional skills needed in modern African and global contexts Foster strong mentorship networks and peer collaboration Equip participants to create sustainable impact within their communities The program is built around the belief that leadership is both personal and societal requiring reflection, responsibility, and action. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Core Learning Areas Participants engage in structured modules covering: Foundations of Transformative Leadership Participants develop the ability to inspire trust, navigate complexity, and drive change through reflective practice and applied learning. Visionary Thinking Strategic Planning Learners build skills to craft compelling visions and convert them into strategic, actionable plans for long-term success. Collaboration Networking Participants learn how to build professional networks, manage diverse perspectives, and cultivate partnerships that enhance personal and organizational growth. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Ethical Leadership Integrity Strong emphasis is placed on values-driven leadership and responsible decision-making within African contexts. Program Structure Weekly Commitment The 10-week virtual program blends: Self-paced modules Weekly virtual sessions Assignments Group collaboration Reflection exercises Mentor feedback Participants are expected to fully engage in the learning journey, committing consistent weekly time to sessions, coursework, and collaboration. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); What Makes the Leadership Academy Unique? The Leadership Academy stands out because of: A blended virtual and in-person delivery model Africa-focused leadership curriculum Practical, application-oriented learning Strong mentorship and alumni network Emphasis on community-driven leadership Exposure to real-world leaders through the Inspiring Journeys Series The program does not focus on abstract theory alone it prioritizes actionable leadership development. Eligibility Criteria Applicants must: Be African youth aged 18 35 years Hold citizenship of an African nation Be passionate about leadership and personal development Be able to fully participate in the 10-week virtual program (April June 2026) ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Be proficient in English (for English track) or French (for French track) Have access to an internet-enabled device and stable internet connection ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Eligibility requirements may vary slightly by program track. Applicants are encouraged to review the specific track requirements before applying. Technical Requirements For virtual participants: Laptop or smartphone Stable internet connection Ability to access the YAM.edu platform Availability for live virtual sessions Program Outcomes After completing the Leadership Academy, participants gain: Enhanced leadership and professional skills Increased self-awareness and emotional intelligence Expanded pan-African network Access to mentors and alumni community Practical leadership project experience Stronger strategic planning abilities Exposure to cross-sector leadership insights ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); The Academy aims to create long-term leadership pipelines across Africa. Application Process Applications are open starting February 1, 2026. Applicants must select their preferred track: English Virtual Leadership Academy French Virtual Leadership Academy Burkina Faso In-Person Academy Mali In-Person Academy (subject to confirmation) Applicants are advised to apply early within the application window. ezstandalone.cmd.push(function () { ezstandalone.showAds(139); }); Why You Should Apply If you are an African youth committed to leadership, personal growth, and community impact, the Leadership Academy provides: Structured leadership development Real-world learning experiences Mentorship from experienced leaders Cross-border networking opportunities Exposure to African leadership ecosystems Practical skills applicable in careers, entrepreneurship, and public service This is more than a program it is a leadership transformation journey. ezstandalone.cmd.push(function () { ezstandalone.showAds(140); }); Application Timeline Summary Virtual Leadership Academy: February 1 28, 2026 Program runs April June 2026 In-Person Leadership Academy: February 1 April 12, 2026 Learn more about the Virtual Leadership Academy 2026 HERE . Submit your application HERE . Visit here for more global opportunities on OFY. The post Leadership Academy 2026 for African Youth: 10-Week Virtual In-Person Leadership Program Empowering the Next Generation of African Leaders appeared first on Opportunities for Youth .","tags":["education","Conferences","Africa"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T19:11:42Z","updated_at":"2026-02-23T19:11:42Z"}
{"id":"bd6a335dd5164eacdbe57d707b31c124eaf55a17","title":"Alstom Foundation 2026 Call for Projects: Funding for NGOs Advancing Sustainable Development, Energy, Mobility & Environmental Protection","url":"https://opportunitiesforyouth.org/2026/02/23/alstom-foundation-2026-call-for-projects-funding-for-ngos-advancing-sustainable-development-energy-mobility-environmental-protection/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T17:03:15Z","summary":"The Alstom Foundation has officially announced the opening of its 2026 project cycle, providing funding opportunities for impactful NGO-led initiatives across key development sectors. The online submission portal opens on February 16, 2026, with a final submission deadline of April 10, 2026 (11:59 PM CET). This annual funding opportunity supports projects that drive meaningful change in communities where Alstom operates. NGOs partnering with an Alstom employee as Project Promoter are invited to submit proposals aligned with the Foundation s strategic priorities. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Key Dates for the 2026 Cycle February 10 March 13, 2026: Project definition and preparation with partners March 13, 2026: Deadline to request assistance in identifying an Alstom Promoter February 16, 2026: Online submission portal opens April 10, 2026 (11:59 PM CET): Final deadline for project submission Mid-September 2026: Board selection of funded projects Implementation: Ongoing monitoring throughout the year Focus Areas of the Alstom Foundation The Alstom Foundation concentrates on four key axes of intervention: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); 1. Economic and Social Development Projects under this axis should promote sustainable livelihoods and inclusive growth. Priority is given to: Skills development and employability programs for disadvantaged youth and women Support initiatives for street children, orphans, and foster children ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); 2. Environmental Protection The Foundation funds projects that enhance environmental awareness, safeguard biodiversity, protect natural habitats, and strengthen community resilience to natural disasters. 3. Access to Mobility Proposals should facilitate safe and inclusive movement of people and goods, especially in remote or underserved communities, enabling better access to markets, healthcare, and education. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); 4. Access to Energy and Water Projects that improve access to electricity and safe drinking water are strongly encouraged. With millions globally lacking these essential services, the Foundation aims to raise living standards in vulnerable communities through sustainable solutions. Selection Criteria To be considered for funding, each project must: Align with at least one of the Foundation s key focus areas Serve the general interest Be located in a country where Alstom has a presence Demonstrate measurable outcomes and community impact Be realistic and feasible within budget and timeline Involve local stakeholders and local management Be implemented by a competent partner organization Comply with the Foundation s Ethics Charter Be submitted in the same country where the Alstom employee promoter is based Each NGO may submit only one project per cycle. The Role of the Alstom Promoter Every submission must be jointly prepared by an NGO and an Alstom employee serving as Project Promoter. The promoter must be based in the same country where the project will be implemented. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); The promoter collaborates in preparing and validating the project file and, if selected, assists in monitoring implementation. If an NGO does not know an Alstom employee, it may request support from the Foundation Secretariat to identify a potential promoter. However, requests must be submitted no later than March 13, 2026. The Secretariat does not guarantee that a promoter will be identified, as promoters participate on a voluntary basis. How to Submit The online submission tool opens on February 16, 2026. Applicants complete structured, preformatted forms designed to optimize proposal clarity. A help function is available within each form. Drafts can be saved and edited before final submission. Once submitted, the selection process begins automatically. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Applicants will receive a confirmation email upon successful submission. Interested NGOs should begin early preparation to ensure compliance with all guidelines and partnership requirements before the April 10, 2026 deadline. Deadline : April 10 ,2026 APPLY HERE For more information on this funding opportunity, click here . For more grant opportunities, click here . The post Alstom Foundation 2026 Call for Projects: Funding for NGOs Advancing Sustainable Development, Energy, Mobility Environmental Protection appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Europe","Grants","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T19:11:42Z","updated_at":"2026-02-23T19:11:42Z"}
{"id":"c216b79025744e4a6a549fdc1ade8842a44beb55","title":"Youth, Peace and Security Online Course 2026: UN-Certified Training to Implement the YPS Agenda","url":"https://opportunitiesforyouth.org/2026/02/23/youth-peace-and-security-online-course-2026-un-certified-training-to-implement-the-yps-agenda/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T16:00:30Z","summary":"Build Practical Skills to Advance Youth Participation in Peace and Security Young people are increasingly recognized as powerful agents of change in preventing conflict, sustaining peace, and shaping inclusive security policies. To translate global commitments into real-world impact, practitioners need the right skills, frameworks, and tools. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Realizing the Youth, Peace and Security Agenda is a comprehensive, practitioner-focused online course jointly developed by United Nations System Staff College and the Folke Bernadotte Academy . The programme equips professionals working in peace and security with the knowledge and applied competencies needed to effectively implement the Youth, Peace and Security (YPS) agenda while working with and for young people. Why This Course Matters The adoption of landmark UN Security Council resolutions 2250 (2015), 2419 (2018), and 2535 (2020) elevated youth participation in peace and security from aspiration to international obligation. Despite progress, implementation remains uneven across local, national, and global levels. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); This course responds directly to that gap by offering a structured, skills-based learning journey that strengthens institutional capacity and supports young women and men as contributors to peaceful and just societies. Course Overview Language: English Format: Fully online Duration: Approximately 2 months of active learning (spread across 2026) ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Weekly workload: 3 4 hours Course fee: USD 1,250 Enrollment Deadline: 10 April 2026 APPLY HERE. For more information about this apportunity, click here . The programme blends self-paced modules, live expert-led webinars, peer exchange, and written assignments. Participants enjoy flexible access via the UNSSC online learning platform, enabling learning from anywhere in the world. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Course Structure and Timeline Part I YPS Foundational Skills 13 April 22 May 2026 Module 1: Introduction to the Youth, Peace and Security Agenda Module 2: Enabling meaningful youth participation Module 3: Conducting youth-sensitive conflict analysis ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Includes one mandatory written assignment. Part II YPS Applied Skills (Elective Modules) 14 September 30 October 2026 Module 4: Serving as a YPS adviser or focal point Module 5: Youth-responsive and YPS-focused programming Module 6: In-country implementation of the YPS Agenda ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Includes at least one written assignment. Successful completion requires finishing all foundational modules and at least one elective module with assignments. Learning Methodology Participants engage in: Guided self-study modules Live interactive webinars (six in total) Peer learning and experience sharing Individual feedback and one-to-one facilitator support This approach ensures both conceptual understanding and practical application of YPS principles. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Who Should Apply The course is designed for practitioners and representatives from: The UN system International and regional security organizations Non-governmental organizations Civil society organizations working on youth, peace, and security Selection Process Selection is competitive and based on: Quality of motivation statement Relevant experience and knowledge Commitment and availability Diversity across gender, geography, and sector Willingness to actively contribute to peer learning UN applicants must also submit a supervisor s endorsement as part of the online application. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Discover more learning opportunities here . The post Youth, Peace and Security Online Course 2026: UN-Certified Training to Implement the YPS Agenda appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Continent","Europe","Latin America and the Caribbean","Middle East and North Africa","Short Courses","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T19:11:42Z","updated_at":"2026-02-23T19:11:42Z"}
{"id":"a44867099d1c549d219655defb25dc49808a3023","title":"Transform Your Institution with the FATE Foundation AI Upskilling Programme 2026 — Empower Students and Lecturers for the AI Revolution","url":"https://opportunitiesforyouth.org/2026/02/23/transform-your-institution-with-the-fate-foundation-ai-upskilling-programme-2026-empower-students-and-lecturers-for-the-ai-revolution/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T15:31:29Z","summary":"https://wp.me/p23f03-jtXAs Artificial Intelligence reshapes global industries, African universities must lead, not follow. The FATE Foundation AI Upskilling Programme is a high-impact, continent-wide initiative designed to equip accredited Higher Education Institutions (HEIs) with world-class AI teaching capacity, research frameworks, and student readiness skills all at no cost to your institution. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); What Is the FATE Foundation AI Upskilling Programme? The AI Upskilling Programme is a multi-country initiative led by the FATE Foundation in partnership with the African Institute for Mathematical Sciences (AIMS) and supported by Google.org with a strategic $4 million investment to build a sustainable AI education ecosystem across Africa. The programme empowers institutions in: Kenya Nigeria Ghana South Africa to integrate advanced AI competencies into teaching, research, and curriculum design enabling them to produce graduates ready for tomorrow s AI-powered economy . ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Who Should Apply? (Eligibility Criteria) To qualify for the 2026 intake, institutions must: 1. Be an accredited Higher Education Institution (HEI) 2. Offer STEM-related programmes (science, tech, engineering, math) 3. Demonstrate technical infrastructure readiness 4. Commit to integrating AI modules into curricula 5. Support participation from lecturers, teaching assistants, and senior STEM students 6. Participate in monitoring evaluation and capstone projects Note: Individual lecturers and students apply through their nominated institution there is no direct individual application. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Benefits for Institutions Participants 1.World-Class AI Training Participating institutions receive: Free AI training for at least four lecturers per institution. Certification for trained faculty. Localized curriculum resources for institutional use. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); 2.Curriculum Teaching Resources Curriculum modules are based on the Google DeepMind AI Research Foundation framework , covering: Small language model creation Neural network design and training Transformer architectures Model fine-tuning and alignment Real-world capstone projects This curriculum is adapted with local context to ensure relevance in African higher education systems. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 3.Student Empowerment Students benefit from: Advanced AI competencies aligned with global industry needs. Opportunities to build AI solutions for real-world problems. Mentorship and exposure to applied AI research. 4.Institutional Recognition Institutions gain: Visibility as innovators in AI education. Potential networking with African institutions and ecosystem partners. Contribution to Africa s developing AI ecosystem. Who Can Participate Internally? Lecturers Become certified AI Champions capable of leading instruction. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Teaching Assistants (TAs) Support AI learning and curriculum delivery. Penultimate Final-Year STEM Students Gain cutting-edge, industry-relevant AI skills. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); How to Apply Step by Step Apply here Complete the online registration form with accurate institutional and contact details. Submit before March 31 2026 (recommended). Await confirmation and further onboarding instructions. Prepare lecturers and materials for training and curriculum integration. Review eligibility guidelines and participation commitments. For questions or technical support, check the contact information on the official page or email the programme team as listed. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Key Deadlines Application Timeline Milestone Date / Status Applications Open Now Ongoing Suggested Submission Deadline 31st March 2026 (for priority review) Ongoing Review Selection Rolling basis Notifications to Selected Institutions Following review cycle Programme Implementation Window 2026 academic year Applications are reviewed periodically, and early submissions are highly recommended to secure institutional onboarding. AI skills are rapidly becoming critical in education, research, and industry. Programs like this enable African universities to lead technological innovation rather than be late adopters . This initiative is strategically positioned to: Build local expertise in AI research and teaching competencies. Strengthen technology ecosystems across multiple African nations. Advance employability and innovation capacity for students. For more information visit here For more global opportunities click here The post Transform Your Institution with the FATE Foundation AI Upskilling Programme 2026 — Empower Students and Lecturers for the AI Revolution appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","Short Courses"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T19:11:42Z","updated_at":"2026-02-23T19:11:42Z"}
{"id":"da61880c08d2093f7159ac99c70d95adcc488429","title":"WFPG Summer 2026 Internship in Washington, D.C.: Programming, Communications, and Operations Roles Now Open","url":"https://opportunitiesforyouth.org/2026/02/23/wfpg-summer-2026-internship-in-washington-d-c-programming-communications-and-operations-roles-now-open/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T15:15:27Z","summary":"Applications are now open for the WFPG Summer 2026 Internship Program, offering students and emerging professionals the opportunity to gain hands-on experience in programming, communications, and operations. Hosted fully in person in Washington, D.C., this competitive internship provides practical exposure within a leading organization focused on global policy and leadership. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The program is organized by the Women s Foreign Policy Group (WFPG), a respected nonprofit dedicated to advancing women s leadership in international affairs. About the WFPG Summer Internship Program The WFPG Summer 2026 Internship offers three distinct tracks: Programming Internship Communications Internship Operations Internship Applicants may apply for one or more internship tracks depending on their interests and qualifications. The program is designed to provide immersive, real-world experience in nonprofit operations and global policy engagement. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); All internships are conducted fully in person at WFPG s Washington, D.C. location, allowing interns to work closely with professionals in the field of foreign policy and international leadership. Internship Tracks Overview Programming Internship Interns support event planning, research, and coordination of high-level discussions, panels, and leadership initiatives. This track is ideal for candidates interested in international affairs, public policy, and event management. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Communications Internship Interns assist with content creation, social media management, writing, and digital outreach. This role is suitable for individuals interested in communications strategy, media engagement, and policy messaging. Operations Internship Interns contribute to administrative processes, organizational management, and internal coordination. This track is valuable for those looking to build experience in nonprofit management and operations. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Why Apply? The WFPG internship program offers: Hands-on experience in a respected foreign policy nonprofit Direct exposure to international affairs programming Networking opportunities in Washington, D.C. Practical skill development in communications, operations, and policy engagement A professional in-person work environment Interns gain valuable experience that strengthens graduate school applications, policy careers, nonprofit leadership pathways, and communications roles. Location and Format Location: Washington, D.C. Format: Fully in-person Term: Summer 2026 ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Candidates must be able to work on-site in Washington, D.C. for the duration of the internship. Application Deadline Applications will be reviewed on a rolling basis until March 6th at 11:59 PM ET, or until 100 applications are received, whichever comes first. Early applications are strongly encouraged due to the application cap. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Applicants should prepare their resume, cover letter, and any additional required materials before applying. How to Apply To learn more and submit your application, click here For more OFY Internship Opportunities, visit here The post WFPG Summer 2026 Internship in Washington, D.C.: Programming, Communications, and Operations Roles Now Open appeared first on Opportunities for Youth .","tags":["education","Continent","Internships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T19:11:42Z","updated_at":"2026-02-23T19:11:42Z"}
{"id":"07d1d57c9ee9066739d107261f48256018d6bc17","title":"WWF Innovation Project Coordinator & Team Support (Remote, March–December 2026)","url":"https://opportunitiesforyouth.org/2026/02/23/wwf-innovation-project-coordinator-team-support-remote-march-december-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T15:10:06Z","summary":"The World Wide Fund for Nature (WWF) is hiring an Innovation Project Coordinator Team Support professional to help drive global conservation impact through innovation. This is a remote, independent contractor mandate running from March 2026 to December 2026 , with flexible working hours (30 36 hours per week). ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); If you are a highly organized professional with at least five years of project coordination experience and a passion for sustainability, climate action, and biodiversity, this role places you at the heart of WWF s global innovation portfolio. Application Deadline: 1 March 2026 (End of Day). About WWF and the Innovation Team WWF is one of the world s leading conservation organizations, operating in over 100 countries with more than 8,000 staff globally. Its mission is to stop environmental degradation and build a future where humans live in harmony with nature. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The Innovation @ WWF team enables conservation breakthroughs by: Supporting teams across the global network Scaling impactful ideas Building strategic partnerships Applying innovation tools to conservation and operational challenges As Innovation Project Coordinator, you will ensure these moving parts align smoothly. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Role Overview: Innovation Project Coordinator Team Support This is a hands-on coordination role that keeps WWF s innovation engine running efficiently. You will work closely with: The Global Innovation Lead Scaling and Incubation Leads Internal and external partners ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); You won t need deep technical conservation expertise. Instead, your strength lies in structure, organization, and execution. Key Responsibilities 1. Strategic Workstream Coordination Coordinate WWF s global innovation programs Align schedules and timelines across multiple projects Maintain momentum across innovation initiatives 2. Agile Sprint Workshop Support Organize virtual agile sprints across multiple time zones Provide technical and logistical support Capture meeting minutes and track action points Ensure follow-up and accountability ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 3. Academic AI Partnership Coordination Support collaboration with the Technical University of Munich (TUM) on exploring AI for conservation project design: Schedule and coordinate meetings Manage internal communication Track next steps and deliverables 4. Stakeholder Network Management Maintain WWF s innovation network database (Airtable) Coordinate stakeholder engagement Ensure alignment with key conservation partners ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); 5. Operational Backbone Organize knowledge and documentation Oversee invoices and reporting Support overall team administration Required Qualifications To succeed in this role, you should have: At least 5 years of experience in project coordination Background in management, business, entrepreneurship, or related fields Strong organizational and multitasking abilities Experience with agile methodologies (Scrum Master experience is a plus) Excellent written and verbal English skills Proficiency with tools like Asana, Trello, Slack, Airtable, Microsoft Office ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Ability to work independently in a fast-paced, remote environment What You ll Gain Impactful Global Work Contribute directly to scaling WWF s conservation impact worldwide. Collaborative Environment Work within a human-centered, supportive innovation team. Professional Growth Develop advanced skills in agile coordination, innovation management, and global stakeholder engagement. Flexible Remote Structure Location-independent Must accommodate CET time zones Applications from Asia, Latin America, and Africa strongly encouraged ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Contract Details Title: WWF Innovation Project Coordinator Team Support Legal Form: Independent Contractor via WWF Switzerland Working Hours: 30 36 hours per week Contract Length: Until December 2026 (possible extension) Location: Remote (CET-compatible time zones preferred) Salary: 1900 2400 per month (adjusted for cost of living and experience) Start Date: As soon as possible Application Process Deadline: 1 March 2026 (EOD) Applicants must submit: CV or Resume A 2-minute phone video explaining: Why you re excited about the role How your experience fits ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Completed application form (where you upload CV and video) Shortlisted candidates will attend a group interview on 9 March 2026 (2 3 PM CET). Click here for more information discover more opportunities here The post WWF Innovation Project Coordinator Team Support (Remote, March–December 2026) appeared first on Opportunities for Youth .","tags":["education","Jobs"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T19:11:42Z","updated_at":"2026-02-23T19:11:42Z"}
{"id":"347b0a8a2cd38c95c83c3ef2baa89a8a30fbeba6","title":"Fully Funded PhD in Social & Cultural Anthropology (Health & Environment) – KU Leuven & Makerere University | 2026 Intake","url":"https://opportunitiesforyouth.org/2026/02/23/fully-funded-phd-in-social-cultural-anthropology-health-environment-ku-leuven-makerere-university-2026-intake/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T14:54:13Z","summary":"A prestigious opportunity is now open for aspiring anthropologists interested in youth mental health, gambling practices, and environmental crisis in East Africa. The Department of Social and Cultural Anthropology at KU Leuven, in collaboration with Makerere University, is offering one fully funded 3-year dual PhD fellowship under the EU-funded HEALENAE Doctoral Network supported by Marie Sk odowska-Curie Actions (MSCA-DN). ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This interdisciplinary doctoral project examines the intersection between youth mental health, gambling epidemics, and environmental insecurity in East Africa. Start Date: 1 September 2026 Location: Leuven, Belgium Kampala, Uganda (Dual Degree) About KU Leuven Founded in 1425, KU Leuven is one of Europe s leading research universities. The Department of Social and Cultural Anthropology hosts a vibrant research community of lecturers, postdoctoral researchers, and PhD candidates working across global themes of making, living, and moving. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The department emphasizes long-term ethnographic research to understand how individuals and communities navigate complex social, political, and environmental realities. About the HEALENAE Project HEALENAE (Health and Environment in Africa and Europe) is an EU Horizon Europe-funded doctoral network connecting universities across: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Aarhus (Denmark) Cape Town (South Africa) Edinburgh (UK) Leuven (Belgium) Nairobi (Kenya) Oslo (Norway) Makerere University (Uganda) The programme provides: Cross-continental anthropological training One full year of fieldwork in Africa and/or Europe Annual training schools and writing retreats A 6-month stay at the secondary university Attractive salary (living + mobility allowance + family allowance if applicable) Social security and pension benefits Funding for research, travel, conferences, books, and equipment ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Research Focus: Youth Mental Health Gambling in Times of Environmental Crisis This PhD project investigates how different forms of gambling (sports betting, crypto trading, online money games, lotteries, fortune-telling) intersect with environmental and socio-economic insecurity among youth in East Africa. Key Research Objectives Map offline and online gambling practices among youth Examine historical and cultural transformations of gambling and probability practices Study how environmental instability influences risk-taking behaviors Explore gambling as a perceived strategy for securing uncertain futures Analyze risk and uncertainty in post-colonial contexts Expected Impact The research will generate: In-depth gendered and locally grounded insights Better understanding of gambling s impact on youth mental health Knowledge for prevention of gambling addiction (ludomania) Policy-relevant insights into environmental crisis and youth vulnerability ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Planned Secondments One semester at Makerere University for supervision and academic exchange Potential engagement with NGOs such as Hope for Future Generations (or similar organizations in the field site) Eligibility Criteria Applicants must: Hold an internationally recognized Master s degree (120 ECTS) in anthropology or related disciplines Graduate no later than 31 August 2026 Have less than 4 years of research experience after Master s Not hold a PhD degree Demonstrate strong academic performance Meet KU Leuven English language requirements Not have resided in Belgium for more than 12 of the last 36 months before recruitment Applicants of all nationalities are encouraged to apply. African language skills and non-academic experience are considered an asset. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Dual Degree Structure The selected candidate will: Be enrolled at both KU Leuven (Primary Institution) and Makerere University (Secondary Institution) Receive a dual PhD degree Undergo evaluation according to both universities regulations Defend publicly at KU Leuven and complete a viva at Makerere University Required Application Documents Applicants must submit: Motivation letter (max 1 page, 2,400 characters) CV (education, positions, publications, activities) Research project proposal (max 12,000 characters excluding references timetable) including: Topic overview Research questions Literature discussion Methods and field sites Ethical considerations Bibliography Timetable Cover sheet Copies of academic diplomas and transcripts ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); All applications must be submitted in English. Deadline: 1 March 2026, 23:59 CET For more information click here Apply here discover scholarships opportunities here The post Fully Funded PhD in Social Cultural Anthropology (Health Environment) – KU Leuven Makerere University | 2026 Intake appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Continent","Europe","Latin America and the Caribbean","Middle East and North Africa","PhD","Scholarships","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T19:11:42Z","updated_at":"2026-02-23T19:11:42Z"}
{"id":"bd1003ebd09821bafff7ba9b866057d5e6fe0eeb","title":"Massive Global Funding Opportunity: Submit Your Expression of Interest for the GPE Education Out Loud Grant Agent","url":"https://opportunitiesforyouth.org/2026/02/22/massive-global-funding-opportunity-submit-your-expression-of-interest-for-the-gpe-education-out-loud-grant-agent/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T18:16:52Z","summary":"If your organization works to transform education systems through civil society engagement, transparency, and accountability, this is a career-defining global opportunity you can t afford to miss. The Request for Expression of Interest: GPE Education Out Loud Grant Agent is now officially open. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); What Is Education Out Loud (EOL)? Education Out Loud (EOL) is the largest global fund exclusively dedicated to supporting civil society engagement in education policy, public accountability, and transparency financed by the Global Partnership for Education (GPE) and implemented globally. EOL empowers civil society organizations to influence education planning, strengthen accountability mechanisms, and shape policies to improve learning outcomes for millions, especially the most marginalized. About GPE EOL The Global Partnership for Education (GPE) is the world s largest global fund dedicated to transforming education in low- and middle-income countries. GPE provides strategic finances, policy support, and advocacy leadership to help countries achieve equitable learning outcomes. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); As the manager of one of GPE s key advocacy instruments, Education Out Loud supports civil society organizations to: Increase transparency and monitoring of public education Influence national and regional policy reforms Build accountability mechanisms Strengthen data, research, and evidence-generating capacities ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Purpose of the Grant Agent Role GPE is seeking qualified organizations or consortia to serve as the next phase Grant Agent for Education Out Loud. The selected agent will: Oversee and manage the EOL fund portfolio across GPE partner countries. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Provide fiduciary and operational oversight of grants. Drive strategic support for civil society engagement in education advocacy . Strengthen learning, monitoring, evaluation, and communication across the portfolio. Work closely with GPE, civil society partners, and key stakeholders globally. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); This role influences how education advocacy and accountability are supported at scale across regions and political contexts. Who Can Apply? This call is open to: Not-for-profit organizations, international NGOs, multilaterals, civil society organizations Consortia / partnerships of organizations Entities with proven capacity to manage large, complex global grant portfolios Indirect cost recovery is capped (e.g. at 7% per some public posts shared about eligibility). In practice, eligible applicants will have: Strong financial management, transparency, and accountability systems Experience working across diverse regions and contexts Experience supporting civil society and advocacy networks Technical expertise in education policy, civic engagement, and civil sector development ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Capacity to manage complex, multi-stakeholder global grant portfolios (Exact eligibility criteria are detailed in the official EOI docs linked above) What to Submit Your Expression of Interest should demonstrate: Organizational capacity systems, staffing, and financial controls Experience in civil society and advocacy funding Global or multi-regional reach and language capabilities Potential to manage fiduciary compliance, learning, and accountability frameworks Proposed consortium arrangements (if applicable) ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Applications usually require: Cover letter / EOI statement Organizational profile and legal status Financial documents and audit reports Team CVs / resumes Proposed approach to managing EOL portfolio (Refer to the official call document for the exact template) Benefits of Becoming the Grant Agent Serving as the Education Out Loud Grant Agent provides: 1. Global leadership platform steward one of the world s largest civil society education funds 2. Influence on education advocacy policy processes worldwide 3. Strengthen institutional reputation in education systems transformation 4. Strategic partnerships with GPE, governments, NGOs, and civil society 5. Opportunity for organizational growth and learning in complex program management ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Start early deadlines are strict. Register for the webinar to clarify expectations. Prepare a comprehensive EOI narrative demonstrating impact, capacity, and accountability . Strengthen your consortium with partners that bring regional depth and technical expertise. Key Deadlines Timeline Milestone Date Call published January 2026 Information Webinar 23 February 2026 (07:00 ET) Register submit questions in advance by 16 February 2026 . EOI Submission Deadline 27 March 2026 Review / Selection Through June December 2026 Expected Start of Next Phase January 2027 Note: Webinar Q A and FAQ documents will be published after the webinar to support applicants. Apply here For more information visit here For more global opportunities click here The post Massive Global Funding Opportunity: Submit Your Expression of Interest for the GPE Education Out Loud Grant Agent appeared first on Opportunities for Youth .","tags":["education","Grants","Africa","America","Asia","Australia and Oceania","Continent","Europe","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"69ada12d1572f1a3dac56008f539658d2c2082bb","title":"PG&E Grants and Scholarships 2026 – STEM Funding, Financial Aid and How to Apply","url":"https://opportunitiesforyouth.org/2026/02/22/pge-grants-and-scholarships-2026-stem-funding-financial-aid-and-how-to-apply/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T18:15:08Z","summary":"If you re a student aiming for college funding, scholarships , or STEM support , this is the most complete guide you need packed with deadlines, requirements, links, qualifications, benefits, and expert tips to help you apply successfully. Based on the official PG E scholarship programs, here s everything you must know before time runs out. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); What Are PG E Scholarships? Pacific Gas and Electric Company (PG E) offers high-impact scholarships to help students across Northern and Central California pursue undergraduate degrees, especially in STEM (Science, Technology, Engineering Math) or community-focused initiatives. These awards ranging from $1,000 to $10,000 are designed to reduce the burden of college costs and reward academic excellence, leadership, financial need, and community impact. In 2025 alone, PG E awarded nearly 150 scholarships across these programs. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Who Should Apply: This program is ideal for students pursuing degrees in STEM fields particularly in engineering, computer science, environmental or biological sciences, physics, and math. Key Scholarship Programs Deadlines (2026) 1. PG E Better Together STEM Scholarships Application Opens: 12th January, 2026 Deadline: 12th March, 2026 Award Amounts: $2,500 $10,000 (varies by award) ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); 2. PG E ERG ENG Scholarships (Community Cause-Based) Application Opens: January 12, 2026 Deadline: February 28, 2026 Award Amounts: Typically $1,000 $6,000 (varies per scholarship) These scholarships are funded by PG E s Employee Resource Groups (ERGs) and Engineering Network Groups (ENGs) to support students connected to specific communities, causes, or industry goals. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Who Is Eligible? (Qualifications) For Both Scholarship Programs: Must be one of the following: High school senior or graduate Student with a GED Current college undergraduate Non-traditional student (e.g., adult learner, returning student, veteran) Must reside in PG E s service territory or be a dependent of someone who does. Must plan to enroll full-time in an accredited college or university in the fall semester. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); For STEM Scholarships: Must be pursuing your first undergraduate degree Must be enrolled or planning to enroll at: A 4-year college/university in California, OR A U.S. Historical Black College or University (HBCU) Scholarship Benefits What You Get 1. Financial Support Awards typically range from $1,000 to $10,000 Paid directly to your school in most cases ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); 2. Career Academic Recognition Scholarship awardees receive recognition for their accomplishments and may enhance resumes, internship and job applications. 3. Networking Community Support ERG and ENG participants connect with mentors, industry professionals, and student leaders expanding career opportunities. 4. No Discrimination on Race or Gender The community-driven scholarships are open to all students , with encouragement to apply to multiple awards for which you qualify. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); What You ll Need to Apply Most PG E scholarship applications require: Academic records (transcripts) Personal statement or essays Proof of residency in PG E service territory College enrollment plans or acceptance letter Letters of recommendation (for many ERG/ENG awards) Financial need and leadership examples (for merit-based STEM awards) Apply here Tips to Maximize Your Chances 1. Apply to multiple scholarships available under the ERG ENG umbrella your chances of winning improve significantly. 2. Start early: some supplemental essay requirements are unique to each scholarship. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); 3. Tailor essays to reflect community impact, leadership roles, career goals, and alignment with PG E s mission. 4. Recommend getting recommendations from teachers, mentors, or employers who can speak to your achievements. These PG E scholarships represent an exceptional opportunity to secure funding before most other scholarships open especially for students committed to STEM, leadership, community engagement, and academic success. With limited award slots and strong competition, preparedness and early action are key to your success. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); For more information visit here For more global opportunities click here The post PG E Grants and Scholarships 2026 – STEM Funding, Financial Aid and How to Apply appeared first on Opportunities for Youth .","tags":["education","Continent","America","Grants","Scholarships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"db4a291edb70dee87641f6b0a9a6a1c67051cf76","title":"CAMHRA Masters Scholarships 2026/2027 at SOAS: Full Tuition Funding for Mental Health Anthropology Studies","url":"https://opportunitiesforyouth.org/2026/02/22/camhra-masters-scholarships-2026-2027-at-soas-full-tuition-funding-for-mental-health-anthropology-studies/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T15:35:02Z","summary":"The Centre for Anthropology and Mental Health Research in Action (CAMHRA) is pleased to announce the CAMHRA Masters Scholarships 2026/2027 at SOAS University of London. These prestigious scholarships cover full tuition fees for eligible students pursuing postgraduate study in the anthropology of mental health. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); With funding available for both UK and overseas applicants, this opportunity supports outstanding candidates committed to advancing research and practice at the intersection of anthropology and mental health. Application Deadline: 30 April 2026 (11:59pm UK local time) About CAMHRA CAMHRA is a UKRI-funded research centre based in the SOAS Department of Anthropology and Sociology. It serves as a globally oriented, locally connected hub for innovative anthropological research, education, and public engagement on mental health. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Working with academic institutions, healthcare providers, policymakers, and service users, CAMHRA contributes anthropological perspectives to global conversations on mental distress, systems of care, and healing practices. Eligible Programmes Scholarships are available for the following programmes beginning in 2026/27: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); MA Medical Anthropology and Mental Health (Full-time: 1 year | Part-time: 2 years) MRes Social Anthropology (Full-time: 1 year | Part-time: 2 years) ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); The MA programme integrates social, cultural, medical, and psychological anthropology, while the MRes is research-focused and typically undertaken in preparation for PhD study. Scholarship Benefits Full tuition fee coverage for 2026/27 For part-time students, tuition fees covered for 2026/27 and 2027/28 ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Approximately three overseas fee places and four home fee places awarded annually One additional international scholarship with a living stipend for applicants from Afghanistan, Iran, or Iraq (subject to annual regional designation) ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Please note: Standard scholarships cover tuition fees only and do not include accommodation or living costs. Exceptional Circumstances Stipend For 2026/27, one additional scholarship including a living stipend (in line with UKRI studentships) is available for students who are resident in, or citizens of, Afghanistan, Iran, or Iraq. The stipend in 2025/26 was 22,780 for the academic year (inclusive of London weighting). Eligible applicants must indicate this in their scholarship application. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Eligibility Criteria Applicants must: For MA Medical Anthropology and Mental Health: Hold a minimum 2:1 bachelor s degree in social sciences or humanities; OR Hold a degree in health sciences such as medicine, psychology, nursing, or social work ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); For MRes Social Anthropology: Hold a minimum 2:1 bachelor s or master s degree Applicants without an anthropology background must hold a master s degree in another field All applicants must: Propose a strong research project using ethnographic methods related to mental health ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Submit a separate application to the relevant SOAS master s programme Demonstrate academic merit and research potential Application Process Step 1: Apply to your chosen programme (MA or MRes). ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Step 2: Submit your scholarship application via the SOAS admissions portal by 30 April 2026 (11:59pm UK time). Step 3: Shortlisted candidates will be invited for an online interview in June 2026. Final offers are expected by July 2026. In the previous cycle, approximately 150 applications were received, making this a highly competitive award. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Important Information for International Students Successful international applicants must apply for a UK Student visa and demonstrate sufficient funds to meet living requirements in London (minimum 13,761 as per UK government guidance). Why Apply? The CAMHRA Masters Scholarships are designed to support individuals who may otherwise be unable to pursue postgraduate study in anthropology due to financial, social, or time constraints. The programme particularly welcomes: Applicants working in mental health services Individuals with lived experience of mental health services Candidates from underrepresented groups in anthropology ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); This scholarship offers an exceptional opportunity to develop ethnographic research expertise, contribute to global mental health debates, and prepare for advanced doctoral study or professional leadership. How to Apply Applying for the CAMHRA Masters Scholarships 2026/27 is a two-step process: Step 1 Apply to your chosen programme: For the MA in Medical Anthropology and Mental Health , submit your application via the Taught Masters applications portal . ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); For the MRes in Social Anthropology , apply through the SOAS Doctoral School portal . Ensure you meet the programme-specific eligibility criteria before applying. Step 2 Apply for the CAMHRA Scholarship: Once your programme application is submitted, access the scholarship application through the SOAS admissions portal . ezstandalone.cmd.push(function () { ezstandalone.showAds(139); }); Complete the application by 30 April 2026, 11:59pm UK local time . You will be asked to outline your motivation, proposed research project, and how your studies will make a positive impact in the field of mental health. Shortlisted candidates will be invited to an online interview in June 2026. Final scholarship offers will be made by July 2026. ezstandalone.cmd.push(function () { ezstandalone.showAds(140); }); Important: You must submit a programme application to access the scholarship application, but you do not need to have received an offer of admission before the scholarship deadline. For queries, contact scholarships@soas.ac.uk . This process ensures that your scholarship application is considered alongside your programme application, so prepare both carefully to showcase your research potential and commitment to the anthropology of mental health. ezstandalone.cmd.push(function () { ezstandalone.showAds(141); }); For further information: Programme enquiries: mastersadmissions@soas.ac.uk Centre enquiries: camhra@soas.ac.uk For more scholarships: Click Here The post CAMHRA Masters Scholarships 2026/2027 at SOAS: Full Tuition Funding for Mental Health Anthropology Studies appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Latin America and the Caribbean","Master","Middle East and North Africa","Scholarships","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"34993e08068d8c0fa78519033d2ff09776dc2372","title":"Open Call for Knowledge Transfer: €25,000 Grants for Digital Training in Sustainable Food Systems","url":"https://opportunitiesforyouth.org/2026/02/22/open-call-for-knowledge-transfer-e25000-grants-for-digital-training-in-sustainable-food-systems/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T15:28:47Z","summary":"The STREAMING initiative has officially launched its Open Call for Knowledge Transfer , inviting organizations across Africa and Europe to design and implement innovative digital training programs that strengthen sustainable food trade systems. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); With 25,000 awarded per project and a total of 11 grants available , this call presents a significant opportunity for institutions committed to advancing food system innovation, women s empowerment, and cross-continental collaboration. At least 60% of the funding will support African Third Parties , with special encouragement for women-led organizations and female innovators. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); About the Open Call This Open Call supports the development of interactive, practice-oriented digital courses that bridge the gap between research and real-world application. The goal is to connect researchers with: Farmers Food producers Start-ups Public health actors Entrepreneurs and processors ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Projects must focus on equipping these groups with practical skills to enhance sustainability, innovation, and resilience in food systems. A central priority of the program is women s empowerment , ensuring that women farmers, entrepreneurs, processors, and innovators are actively targeted and supported. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Grant Details Funding Amount: 25,000 per project Total Projects Funded: 11 Geographic Focus: Africa and Europe Funding Allocation: Minimum 60% to African Third Parties Applicants may come from any country , not limited to STREAMING partner nations. Thematic Areas Proposed training programs should address innovations in one or more of the following areas: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Traceability in the food supply chain Life cycle assessment Nutritional requirements Reducing micronutrient deficiencies Food waste reduction Sustainable farming systems Food safety Scaling innovations in food supply chains Programs should be practical, interactive, and focused on real-world application. Who Can Apply Eligible Third Parties include: Research institutions and universities NGOs and industry partners Innovation hubs Business schools Vocational colleges Consortia across Africa and Europe ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Consortium applications are welcome, and women-led organizations are strongly encouraged to apply. Application Documents Applicants must carefully review and submit the required documentation included in the Open Call Kit: Official Open Call for Proposals publication notice Knowledge Transfer Call text Proposal template (to be submitted as a PDF) Declaration of Honour (mandatory) Consortium Agreement (mandatory for consortia) Declaration on double funding (signed at submission and project completion) ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Applicants are strongly advised to review all materials thoroughly before submission. Deadline Applicants should consult the official Open Call documentation for the final submission deadline and ensure timely submission of all required documents. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Contact Information For administrative questions related to the application process, applicants may contact: Email: STREAMING@bayfor.org Additional resources available: Click Here Appendices: Appendix 1 Open Call for Proposals Appendix 2 Knowledge Transfer Call Document Appendix 3 Proposal Template Appendix 4 Declaration of Honour Absence of Conflict of Interest Appendix 5 Consortium Agreement Appendix 6 Declaration on Double Funding for Recipients This Open Call represents a powerful opportunity to strengthen sustainable food systems, promote innovation, and empower women across Africa and Europe through digital knowledge transfer initiatives. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); For more Grant Opportunities: Click Here The post Open Call for Knowledge Transfer: €25,000 Grants for Digital Training in Sustainable Food Systems appeared first on Opportunities for Youth .","tags":["education","Grants","Africa","Europe"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"3061e5a338a167fbc52b3f6f15aa5564da81edb6","title":"UniPods AI Solutions for Africa Program 2026 – Fully Funded 12-Month AI Training & Innovation Journey","url":"https://opportunitiesforyouth.org/2026/02/22/unipods-ai-solutions-for-africa-program-2026-fully-funded-12-month-ai-training-innovation-journey/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T05:50:02Z","summary":"Africa Needs AI Built by Africans Applications Open for Phase 1 Applications are now open for the UniPods AI Solutions for Africa Program , a 12-month pan-African initiative designed to equip university students with practical artificial intelligence (AI) skills and support them in developing, prototyping, and launching impactful AI-powered solutions for Africa. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The program combines foundational training, advanced product development, incubation, and market launch support giving participants a full pathway from learning AI to building real-world solutions. What is the UniPods AI Solutions for Africa Program? The UniPods AI Solutions for Africa Program is a multi-stage learning and innovation journey that helps students transition from AI beginners to solution builders. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The program focuses on: Practical AI and data science skills Building solutions that address African challenges Product development and innovation Entrepreneurship and market readiness Participants progress through structured phases that move from training to implementation. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Program Structure 4 Phases Phase 1: Online Foundational AI Skilling Participants gain core AI skills through a certified online program delivered in collaboration with the University of Tokyo (GCI World course). This phase covers: Data science foundations Python programming Machine learning fundamentals Practical business applications of data ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); This phase serves as the entry point into the program. Phase 2: Advanced Hybrid Training Product Development Participants advance their technical skills while beginning to design and build real AI solutions with UniPod support. Key focus areas include: Applied AI development Problem-solving for African contexts Product prototyping Team collaboration ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Phase 3: In-Person Incubation Residency Selected participants join an intensive residency at the Addis Ababa AI UniPod , where they refine their solutions with mentorship and technical guidance. Phase 4: Market Take-Off Participants test, refine, and prepare their AI solutions for launch with continued UniPod support. This phase emphasizes: Market readiness Solution validation Scaling strategies Who Should Apply? The program is designed for: University students across Africa Beginners interested in AI and data science Students passionate about solving African challenges through technology Aspiring AI innovators and entrepreneurs ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); No advanced programming experience is required to start Phase 1. Why This Program Matters Africa s digital future depends on locally built solutions. This initiative aims to empower young African innovators to: Build AI solutions relevant to African realities Gain globally recognized technical skills Work on real-world innovation projects Move from learning to launching impactful products ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Phase 1 Foundational AI Training (University of Tokyo) The first phase is delivered online through the Global Consumer Intelligence (GCI World) course developed by the Matsuo-Iwasawa Lab at the University of Tokyo. Participants will learn: Introduction to data science Data cleaning and visualization Machine learning concepts SQL and feature engineering Time series analysis Real-world data applications The course includes weekly lectures, assignments, competitions, and final projects. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Program Benefits Participants will gain: Certified foundational AI training Practical hands-on experience Access to mentorship and incubation Opportunity to develop real AI products Potential pathway to launch solutions in African markets Important Deadline Phase 1 Application Deadline: March 2, 2026 Early application is strongly recommended. How to Apply Interested students can register for Phase 1 (Foundational AI Skilling) through the official application portal. Applicants will be guided through: Email registration Platform ID creation Verification of student status Enrollment in the GCI World course ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Final Thoughts The UniPods AI Solutions for Africa Program is more than an online course it is a complete innovation pathway designed to help African students move from learning AI to building real solutions that address local challenges. If you are a student passionate about technology, innovation, and Africa s future, this is a strong opportunity to begin your AI journey. Interested students can register for Phase 1 (Foundational AI Skilling) through the official application portal. The post UniPods AI Solutions for Africa Program 2026 – Fully Funded 12-Month AI Training Innovation Journey appeared first on Opportunities for Youth .","tags":["education","Africa","Short Courses"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"731dfe75d82becb05e4cd2544377a5d63c4dd2a5","title":"TaRL Africa Is Hiring: Country Regional Manager (Programs) – Kaduna, Nigeria | Apply by 3 March 2026","url":"https://opportunitiesforyouth.org/2026/02/21/tarl-africa-is-hiring-country-regional-manager-programs-kaduna-nigeria-apply-by-3-march-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-21T14:05:44Z","summary":"TaRL Africa is expanding its leadership team in Nigeria and is now hiring a Country Regional Manager (Programs) to drive regional scale, government partnership, and high-quality implementation of the Teaching at the Right Level (TaRL) approach. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); If you are an experienced program leader with a strong background in education systems reform, government engagement, and multi-state program management, this is an opportunity to lead transformative change at scale. Position: Country Regional Manager, Programs Location: Kaduna, Nigeria Reports to: Country Director, TaRL Africa Nigeria About TaRL Africa TaRL Africa is hosted by Empower Learning Africa, a not-for-profit organization headquartered in Nairobi, Kenya, with teams across C te d Ivoire, Nigeria, and Zambia. The initiative was launched in 2019 as a joint venture between Pratham and J- PAL. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); TaRL Africa partners with governments and organizations across more than 15 Sub-Saharan African countries to accelerate children s foundational skill acquisition using the evidence-based Teaching at the Right Level methodology. Together with partners, the initiative has reached over five million children. Our vision is for every child across Africa to have strong foundational skills that unlock lifelong opportunity. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); About the Role: Country Regional Manager (CRM) The Country Regional Manager (CRM) will lead and expand TaRL programming within a defined region in Nigeria. This role oversees implementation across multiple states, manages regional teams, strengthens partnerships with state governments, and ensures program delivery with fidelity, scale, and sustainability. As a key member of the Country Management Team, you will shape regional strategy, drive operational excellence, oversee budgets, and lead continuous program improvement. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); This position requires extensive travel within the region and occasional travel across Nigeria and Africa. Key Responsibilities 1. Program Leadership Partnership Management (40%) Strengthen technical implementation of the Teaching at the Right Level model. Ensure high-quality program delivery through data-informed decision-making. Provide oversight to state teams to maintain financial health and operational efficiency. Guide annual planning cycles and conduct periodic program reviews. Build strong, productive relationships with government stakeholders and community partners. Drive contextual program design aligned with regional needs. 2. Regional Strategy Scale (30%) Identify and execute strategic expansion opportunities across states. Promote government ownership and long-term sustainability. Translate regional priorities into coordinated work plans and budgets. Use needs assessments, stakeholder insights, and program data to refine strategy. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 3. Strengthening the TaRL Ecosystem (15%) Improve operational tools, systems, and accountability frameworks. Lead special innovation projects in collaboration with Programme Design, Pedagogy, and Monitoring, Learning Evaluation teams. Contribute to cross-state learning and organizational knowledge sharing. 4. Team Leadership Performance Management (15%) Build, mentor, and manage high-performing regional teams. Set clear performance goals and monitor progress. Foster accountability, ownership, and continuous professional development. Cultivate a collaborative and impact-driven team culture. Who We Are Looking For We are seeking a results-oriented leader with: Proven experience managing medium to large-scale education or development programs Strong stakeholder engagement experience with governments and donors Demonstrated ability to lead multi-state implementation Strategic planning and expansion expertise Budget oversight and financial management capability Strong analytical and data-driven decision-making skills Excellent written and verbal communication skills ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Minimum Qualifications Bachelor s degree in Public Policy, International Development, Education, or related field (Master s degree such as MPA or MPP preferred). At least six (6) years of experience managing medium to large-scale programs. Experience working with donors, policymakers, researchers, and government agencies. Strong proficiency in Excel, Word, PowerPoint, and Google Suite. Excellent communication skills. Why Join TaRL Africa? This is more than a job. It is a leadership opportunity to shape foundational learning outcomes for millions of children across Nigeria. You will: Influence education reform at scale Strengthen government systems for sustainable impact Lead high-performing teams across multiple states Contribute to a growing, mission-driven organization operating across Africa Play a key role in evidence-based education transformation ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); If you are ready to lead with purpose and deliver measurable impact, we encourage you to apply. Application Deadline: 3rd March 2026 APPLY HERE For more information on this job opportunity, click here . For more opportunities on jobs , click here . The post TaRL Africa Is Hiring: Country Regional Manager (Programs) – Kaduna, Nigeria | Apply by 3 March 2026 appeared first on Opportunities for Youth .","tags":["education","Africa","Jobs"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"5b98bb7fa3cde0551ea8c2e2f837b60d07d719ce","title":"Consilium Traineeships at the Council of the European Union 2026–2027: Paid EU Internship Opportunities in Brussels","url":"https://opportunitiesforyouth.org/2026/02/21/consilium-traineeships-at-the-council-of-the-european-union-2026-2027-paid-eu-internship-opportunities-in-brussels/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-21T10:23:38Z","summary":"Are you looking for a paid European Union traineeship that offers real experience inside EU institutions? The Consilium Traineeship Programme at the Council of the European Union provides young professionals with the opportunity to work directly with EU policy experts, gain institutional experience, and contribute to high-level decision-making processes. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Applications are now open for the upcoming traineeship cycle a highly competitive programme designed for ambitious graduates interested in European affairs, governance, law, policy, and international cooperation. What Are Consilium Traineeships? The Consilium traineeship programme offers first-hand exposure to how the Council of the European Union and its General Secretariat operate. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The name Consilium comes from the Latin word meaning counsel or deliberation , reflecting the Council s role in shaping EU decisions and supporting member states in policy coordination. As a trainee, you will: Gain practical experience within EU institutions Work alongside experienced advisors and policy professionals Contribute to the Council s daily activities Develop professional skills in an international environment Build networks across European institutions ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The programme is ideal for graduates interested in EU governance, policy-making, international relations, law, public administration, or related fields. Traineeships are paid and include allowances and other benefits. Around 110 traineeship positions are available each year. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Your traineeship: tasks, grants, allowances Paid Traineeship Benefits The Consilium traineeships are fully paid and include financial support designed to help trainees live and work in Brussels. Key benefits include: Paid monthly grant Additional allowances and benefits Professional training and mentoring Exposure to real EU policy work International multicultural working environment Approximately 110 traineeship positions are offered each year, making it one of the most attractive EU traineeship opportunities for early-career professionals. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Current Application Window (2026 Cycle) Applications are currently open for the next traineeship term. Important dates: Application deadline: 19 March 2026 (12:00 Brussels time) Traineeship period: 1 September 2026 31 January 2027 Location: Brussels, Belgium Applicants are encouraged to submit early to avoid last-minute technical issues. APPLY HERE Positive Action Programme for Trainees with Disabilities The Council reserves up to six traineeships per year for EU nationals with a recognised disability. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); This programme ensures inclusive participation by offering: Equal access to EU policy experience Special workplace arrangements when required Supportive and accessible working conditions Participants gain the same high-quality exposure to EU decision-making while benefiting from tailored accommodations. Apply for the positive action programme Positive action programme for trainees with a disability ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Who Can Apply? Consilium traineeships are open to EU citizens who meet specific eligibility criteria outlined by the Council. The programme targets: Young graduates and early-career professionals Candidates interested in EU affairs and policy Individuals seeking professional experience within EU institutions Applicants should review the official eligibility criteria before applying. Who can apply for a traineeship How to Apply for a Council Traineeship The application process is designed to be straightforward and fully online. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application steps: Check eligibility requirements Prepare required documents Complete the online application form Submit before the deadline The same procedure applies to both: Main traineeship programme Positive action programme for trainees with disabilities Applications are only open during specific periods each year, so timing is important. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); How to apply for a traineeship Online Information Session To help candidates better understand the programme, the Council is hosting an online information session. Details: Date: 9 March 2026 Time: 14:00 15:00 (Brussels time) Format: Online presentation + Q A Registration: No prior registration required This session is highly recommended for applicants who want insider guidance on the application process. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); No prior registration needed. Follow our info session about Consilium traineeships Consilium Traineeship Calendar The Council offers traineeships twice per year . February June Traineeship Applications: August September Selection interviews: October December Traineeship period: 1 February 30 June September January Traineeship Applications: February March Selection interviews: April June Traineeship period: 1 September 31 January Understanding the cycle helps candidates plan applications well in advance. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Traineeships for Students of National Administration Schools In addition to the general programme, the Council also offers specialised traineeships for students enrolled in national administration schools. Key features: Duration: 2 to 5 months Focus on EU processes and institutional policy Designed to strengthen administrative and governance expertise Frequently Asked Questions Candidates can consult the official FAQ section for detailed guidance on: ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Eligibility requirements Application documents Selection process Working conditions Financial support Reviewing the FAQ before applying can help strengthen your application. More questions? Check our FAQ to find the answers to most recurrent questions. ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); Traineeships: frequently asked questions Why Apply for a Consilium Traineeship? A traineeship at the Council of the European Union offers more than work experience it provides direct exposure to the heart of European policy-making. Key reasons to apply: Gain practical EU institutional experience Build an international professional network Strengthen your CV for careers in policy, diplomacy, or development Work in Brussels, one of Europe s key political hubs Learn how EU decisions are shaped in real time ezstandalone.cmd.push(function () { ezstandalone.showAds(139); }); For young professionals aiming to build a career in European or international affairs, this programme is a powerful stepping stone. Final Tip for Applicants Strong applications clearly demonstrate: Interest in EU affairs Relevant academic or professional background Motivation to contribute to European policy work Ability to work in multicultural environments Prepare your documents early and submit before the deadline to maximise your chances. ezstandalone.cmd.push(function () { ezstandalone.showAds(140); }); APPLY HERE Source : European Council The post Consilium Traineeships at the Council of the European Union 2026–2027: Paid EU Internship Opportunities in Brussels appeared first on Opportunities for Youth .","tags":["education","Internships","Europe","Jobs"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"8eee00c180a3e987ef57a9713fe706838258782e","title":"AFAS Master’s Scholarship Programme 2026–2028: Fully Funded Fellowship in Nature-Based Solutions, Climate Change Adaptation & Biodiversity Conservation in African Savannas","url":"https://opportunitiesforyouth.org/2026/02/21/afas-masters-programme-2026-2028-fully-funded-fellowship-in-nature-based-solutions-climate-change-adaptation-biodiversity-conservation-in-african-savannas/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-21T09:32:21Z","summary":"Applications are now open for the AFAS Master s Fellowships 2026 intake , offering fully funded opportunities for young African scholars to pursue advanced studies focused on Nature-based Solutions (NbS), climate change adaptation, and biodiversity conservation across African savanna landscapes. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This highly competitive programme is designed for motivated graduates who want to bridge science, policy, and practice and contribute to real-world environmental solutions across Africa. Application deadline: 31 st March 2026 Applicants may apply to either the University of Nairobi (UoN), Nairobi, Kenya, or Universit F lix Houphou t-Boigny (UFHB), Abidjan, C te d Ivoire , BUT NOT BOTH There is a simultaneous call for master fellowships at CABES , a project closely linked to AFAS . Applicants can only apply to either the CABES or AFAS master programme BUT NOT BOTH ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); About the AFAS Master s Programme The African Climate and Environment Centre Future African Savannas (AFAS) is a part of the Global Centers for Climate and Environment program of the German Academic Exchange Service (DAAD). AFAS is a partnership of four universities: the University of Nairobi (UoN), Universit F lix Houphou t-Boigny (UFHB), the University of Cologne, and the University of Bonn. The program is based at the University of Nairobi through its Institute for Climate Change and Adaptation (ICCA) in Nairobi, Kenya, and at the Universit F lix Houphou t-Boigny through its African Centre of Excellence on Climate Change, Biodiversity and Sustainable Agriculture (CEA-CCBAD) in Abidjan, C te d Ivoire. The African Climate and Environment Centre Future African Savannas (AFAS) is part of the DAAD Global Centers for Climate and Environment Programme . AFAS brings together a consortium of leading institutions: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); University of Nairobi (Kenya) Universit F lix Houphou t-Boigny (C te d Ivoire) University of Cologne (Germany) University of Bonn (Germany) The programme is hosted at: Institute for Climate Change and Adaptation (ICCA) University of Nairobi ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); African Centre of Excellence on Climate Change, Biodiversity and Sustainable Agriculture (CEA-CCBAD) UFHB AFAS trains graduates to connect research with policy and practice while engaging directly with stakeholders, communities, NGOs, and decision-makers. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Programme Focus Areas AFAS Phase 2 (2026 2030) builds on earlier success and emphasizes implementation, stakeholder engagement, and real-world impact. The programme focuses on: Nature-based Solutions (NbS) Science Policy Practice Interface (SPPI) Climate change adaptation Ecosystem conservation in African savannas For their Master s thesis, fellows will select one primary thematic area : ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Water Agriculture Energy One Health Biodiversity Applicants must explain their thematic preference in their motivation and reflection statement. Fellowship Overview (2026 Intake) AFAS will award 18 fully funded Master s fellowships across its two host universities. Selected fellows will: Enroll in an AFAS-aligned Master s programme Participate in joint courses and hybrid modules Receive soft-skills training Conduct demand-oriented research on Nature-based Solutions Engage with policy actors and practitioners Complete a Master s thesis linked to real-world challenges ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Language of instruction: English What the Fellowship Covers The AFAS fellowship provides comprehensive support, including: Full tuition fees Monthly stipend (local currency equivalent) Health insurance Laptop computer Individual research budget (after proposal approval) Participation in summer schools, workshops, and exchange activities Funding continuation depends on satisfactory academic progress and engagement. Who Should Apply This is not a conventional academic scholarship. AFAS seeks applicants who demonstrate: Critical and independent thinking Strong motivation and reflection Ability to connect environmental challenges with practical solutions Clear personal insight and contextual understanding ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Applications that rely on generic or scripted responses may be disadvantaged. Selection Process Selection is competitive and conducted in multiple stages: Eligibility screening Qualitative review of motivation statements Shortlisted interviews assessing reasoning and alignment with AFAS Final selection (subject to admission at host university) Host University Options Applicants may apply to ONE host institution only. 1. University of Nairobi (UoN), Kenya Candidates willing to apply must have: Concluded a Bachelor s or equivalent degree in environmental and/or agricultural sciences or biology, ecology and climate sciences, economics, sociology, or any other relevant discipline. Must have a minimum second-upper honors degree or equivalent approved by Kenya s Commission for University Education ( CUE ) Must not be older than 26 years on the 2 nd of October 2026 . Must be willing to be a single/individual resident in the student s residence recommended by the University of Nairobi for the duration of the program. This is a fulltime assignment which requires physical presence and outside work is not permitted for the duration of the fellowship. Applicants from universities which do not use English as a language of instruction should provide evidence of English proficiency in the form of a certificate of IELTS or TOEFL or equivalent demonstrating a satisfactory level of competence. University Certified Diplomas/Bachelors/Masters certificates (if not in English , please provide official English translation from/or certified by the university). Note: In certain cases, further verification may be required from Kenya s Commission for University Education (see below). Before applying for the scholarship, applicants are expected to visit the University of Nairobi website https://www.uonbi.ac.ke and the Department of Earth and Climate Sciences website http://earthclimatesciences.uonbi.ac.ke to confirm their eligibility for admission and get more details on the program, respectively. At UoN, selected candidates will immediately be required to seek admission to the University of Nairobi master s program in Climate Change Adaptation through the University website https://application.uonbi.ac.ke/ . An application fee (approximately USD 50) will be charged which is non-refundable . A passport is required for non-Kenyan citizens. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); 2. Universit F lix Houphou t-Boigny (UFHB), C te d Ivoire Eligibility Highlights: Concluded a Bachelor s or equivalent degree in environmental and/or agricultural sciences or biology, ecology and climate sciences, economics, sociology, or any other relevant discipline. The required university degrees must have been awarded by a university or a higher education institution officially recognized by the African and Malagasy Council for Higher Education ( CAMES ). Must not be older than age 26 years on the 2 nd of October 2026 . Be willing to be a single/individual resident on the campus of P le Scientifique et d Innovation de l UFHB for the full duration of the program. This is a full-time assignment which requires physical presence and outside work is not permitted for the duration of the fellowship. UFHB applicants from Central and Western Africa are encouraged to apply. University Certified Diplomas/Bachelors/Masters certificates. All certified documents not issued in French must be accompanied by an official French translation. Applicants from French-language academic backgrounds are asked to provide official evidence of English language proficiency, in the form of an IELTS or TOEFL certificate or equivalent demonstrating a satisfactory level of competence. A passport is required for non-citizens of the Economic Community of West African States (ECOWAS). Required Application Documents (Single PDF Submission) Motivation Reflection Statement (max. 1000 words, 1.5 space, 11 Calibri) Applicants must respond explicitly to the following prompts: Which ONE of the five thematic areas would you like to do research on: water, agriculture, energy, One Health and biodiversity? Motivate your choice with a short research idea in max. 250 words? Which other ONE of the five thematic areas could also be of interest to you (one sentence; no motivation needed)? What concrete environmental or development challenge motivates you personally? How do you understand Nature based Solutions in your own context? Describe one real example (project, policy, community practice, or observation) that shaped your interest. How do you see yourself engaging with policy or practice actors, not only actors from academia? What skills or perspectives do you hope to develop during AFAS Phase 2? ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Curriculum Vitae (max. 2 pages) University Certified Diplomas/Bachelors/Masters certificates (see details above). University Certified Transcripts of academic records (see details above). Two duly signed letters of recommendation , including the full contact details of the referees (at least one of the letters must be issued by a member of staff of the institution that awarded the most recent degree). Proof of English proficiency (if applicable) Birth certificate A recent passport photo Motivation Reflection Statement Prompts Applicants must address: Preferred thematic research area and short research idea (max. 250 words) ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Secondary thematic interest Personal environmental or development motivation Understanding of Nature-based Solutions in context Real-life example influencing interest Engagement with policy or practice actors Skills and perspectives to develop during AFAS Phase 2 Important Application Notes Applicants may apply to either AFAS or CABES , not both. Applicants may apply to either UoN or UFHB , not both. ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Only shortlisted candidates will be contacted for interviews. For technical questions, contact: info@afas.africa Why This Opportunity Matters The AFAS Master s Fellowship is ideal for young professionals and graduates interested in: Climate change adaptation in Africa Biodiversity conservation Nature-based Solutions research Environmental policy and practice Sustainable development careers ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); By combining academic excellence with practical engagement, AFAS prepares future leaders to address complex environmental challenges across African savannas. How to Apply Applications are open now for the 2026 2028 intake . APPLY HERE FOR MORE INFORMATION PLEASE CLICK HERE Deadline: 31 March 2026 Interested applicants should prepare their documents early and submit a strong, reflective application demonstrating real-world understanding and motivation. The post AFAS Master’s Scholarship Programme 2026–2028: Fully Funded Fellowship in Nature-Based Solutions, Climate Change Adaptation Biodiversity Conservation in African Savannas appeared first on Opportunities for Youth .","tags":["education","Master","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"f89f9a3fb2a062cd3f736795d7af1d787fa15b4f","title":"Inter-American Development Bank (IDB) Internship Program 2026: Paid Global Internships for Students & Recent Graduates | Complete Guide","url":"https://opportunitiesforyouth.org/2026/02/21/2025-summer-internship-opportunities-at-inter-american-development-bank-idb-undergraduate-and-graduate/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-21T01:34:59Z","summary":"The Inter-American Development Bank (IDB) Internship Program offers a unique opportunity for students and recent graduates to gain hands-on experience in international development, finance, research, policy, and innovation. Through paid internships at IDB, IDB Invest, and IDB Lab , participants work alongside global experts and contribute to projects that improve lives across Latin America, the Caribbean, Asia, and Europe. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); If you are looking to launch your international career with a respected multilateral organization, this guide explains everything you need to know from eligibility requirements to application tips. Why Choose the IDB Internship Program? The IDB internship program is designed to help students and young professionals: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Gain practical experience in international development Work on real projects with global impact Build professional networks across regions Learn about development finance and policy Experience the organizational culture of the IDB Group Interns work directly with teams at IDB Headquarters in Washington, D.C., or in country offices worldwide, with occasional teleworking flexibility depending on the role. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Types of Internship Opportunities 1. Internships at IDB Headquarters (Washington, D.C.) Interns at headquarters support teams delivering operational and corporate solutions to public and private sector clients. Program Structure Duration: 2 months Work schedule: Full-time (40 hours per week) Format: On-site with some flexibility ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Internship Cycles Winter Internship: January 16 March 15 Summer Internship: June 16 August 15 Applications typically open 3 4 months in advance . Important Note: Applicants may apply for a maximum of three internship positions . 2. Internships at Country Offices (COFs) The IDB has offices across Latin America and the Caribbean, as well as Asia and Europe. These internships are designed to strengthen local development capacity while helping interns build careers in their own regions. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Key Features Duration: 2 to 6 months (based on business needs) No fixed cohort timeline Continuous recruitment throughout the year Eligibility Requirement You must be: A citizen or legal resident of the country where the office is located, or Hold a valid work permit and reside in that country. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Fields of Study in Demand The IDB welcomes students from diverse academic backgrounds, including: Business and Finance Communications and Marketing Data and Technology Economics and Research Environmental Studies Humanities and Social Sciences Law and Policy Linguistic Services Basic Eligibility Requirements To qualify for the IDB Internship Program, applicants must meet the following criteria: ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Citizenship Washington, D.C. internships: Must be a citizen of one of IDB s 48 member countries Country Office internships: Must be a citizen or legal resident of the country where applying IDB Invest roles: No citizenship restrictions ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Academic Status Active undergraduate student (minimum second year), or Graduate student with at least 50% of coursework completed Availability Must be available to work full-time (40 hours per week) ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Additional Requirements Must not have relatives working at IDB, IDB Invest, or IDB Lab Internship must be your first job within the IDB Group ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Required Documents Applicants must prepare the following documents: Updated Resume (CV) University Enrollment Letter (issued within the last 3 months) Academic Transcripts (official or unofficial; issued within the last 3 months) Note: If you advance in the recruitment process, official transcripts may be required. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); How to Apply for IDB Internships Step 1: Online Application Complete the application form and upload your CV in English or Spanish. A cover letter is only required if specified in the job posting. Pro Tips Read the job description carefully Tailor your CV to match the role Keep your resume concise and results-focused Step 2: Assessment Interview If shortlisted, you may be invited to: Complete a technical assessment Attend a formal panel interview with IDB staff ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Pro Tips Follow instructions carefully during assessments Practice interview responses beforehand Be clear, authentic, and concise in your answers Step 3: Final Decision Recruitment timelines may vary. The IDB provides estimated timelines and applicants can follow up with HR for updates. If you are not selected, you are encouraged to apply again as new positions open regularly. ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); Visa Information for International Applicants For internships at headquarters in Washington, D.C., the IDB supports eligible candidates with G4 Visa processing . Key points: Available to non-U.S. citizens and non-permanent residents Eligible dependents may also receive G4 visas Dependents may apply for U.S. work authorization Employees must live within 50 miles of headquarters Visa approval remains at the discretion of the U.S. Department of State. ezstandalone.cmd.push(function () { ezstandalone.showAds(139); }); What It s Like to Be an IDB Intern Interns often highlight: Exposure to international development projects Networking with global teams Opportunities to contribute to regional impact Professional growth and career clarity Many interns describe the program as a stepping stone into careers in international organizations, development finance, and policy. Frequently Asked Questions (FAQs) How long does the application process take? The process may take several weeks or months depending on the role. ezstandalone.cmd.push(function () { ezstandalone.showAds(140); }); Do I need a cover letter? Only if requested in the specific job posting. Does the IDB hire globally? Yes. The IDB recruits for headquarters and country offices worldwide. Are there eligibility restrictions? Yes. Citizenship requirements apply for most positions, except some roles at IDB Invest. ezstandalone.cmd.push(function () { ezstandalone.showAds(141); }); The IDB Internship Program is a strong opportunity for students and recent graduates who want to build careers in international development, economics, finance, and public policy. With paid placements, global exposure, and meaningful project work, the program provides a solid foundation for future leadership in development. If you are serious about building a global career, prepare your documents early, tailor your CV carefully, and apply strategically. Apply Learn More For full program details and available internship opportunities, visit the official IDB careers platform and explore open positions regularly. ezstandalone.cmd.push(function () { ezstandalone.showAds(142); }); For a detailed list of available positions and Application, click HERE . Apply Now Don t miss this opportunity to gain hands-on experience in international development. Visit our official website to submit your application before the deadline. For further inquiries or accommodations, contact us at diversity@iadb.org . The post Inter-American Development Bank (IDB) Internship Program 2026: Paid Global Internships for Students Recent Graduates | Complete Guide appeared first on Opportunities for Youth .","tags":["education","America","Europe","Internships","Jobs","Latin America and the Caribbean","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"3d10b2733aaf602a25964eae467a4b361dfd1cb2","title":"2026 MILEAD Fellows Program for Young African Women Leaders (Applications Open)","url":"https://opportunitiesforyouth.org/2026/02/20/2026-milead-fellows-program-for-young-african-women-leaders-applications-open/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-20T20:52:55Z","summary":"Application Deadline: Friday, March 20, 2026 Applications are now open for the 2026 MILEAD Fellows Program , a leadership development initiative designed to support and empower young African women leaders committed to driving positive change across the continent. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); For over a decade, the MILEAD Fellows Program has equipped emerging leaders with the knowledge, skills, and networks needed to challenge inequality, advance women s leadership, and implement community-driven solutions. About the MILEAD Fellows Program The MILEAD (Moremi Initiative Leadership and Empowerment Development) Fellows Program is a long-term leadership development initiative focused on identifying and nurturing promising young African women leaders. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The program aims to: Build leadership capacity among young African women Strengthen knowledge, skills, and values for 21st-century leadership Create a supportive ecosystem for women s leadership across Africa Connect emerging leaders with influential African mentors and changemakers Each year, 25 outstanding young women are selected based on their leadership potential and commitment to making a difference in their communities or professional fields. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Program Structure and Key Features The program combines leadership training, mentoring, experiential learning, and community engagement. Key components include: A three-week residential Summer Institute in Ghana Intensive leadership and personal development training Mentorship from established African leaders Access to the MILEAD leadership network Ongoing support and lifelong peer solidarity ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); A distinguishing feature of the program is the MiCHANGE Community Project , where each fellow designs and leads a community-based initiative addressing issues affecting women and girls. Eligibility Criteria Applicants should meet the following requirements: Be a young African woman aged 19 25 Demonstrate leadership potential or experience Show commitment to addressing issues affecting women and girls in Africa Be interested in developing transformational leadership skills Be available to participate in the three-week residential Summer Institute in Ghana ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Selected candidates may be full-time students or professionals during the program, except during the residential institute period. Application Requirements Applicants must submit: Completed application form Updated CV Two recommendation letters ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); All application materials must be submitted via email. Email: Fellows@moremiinitiative.org Applicants are strongly encouraged to carefully review the program and application guidelines before submitting. Application Resources Download the full 2026 Application Package ( Application Pack | Recommendation-Form ), and share this opportunity with other inspiring emerging African women leaders in your network. Stay updated: follow us @MoremiAfrica #MILEADFellows #MILEAD2026 EMAIL: Fellows@moremiinitiative.org | TEL: +233 530 429 644 Why Apply? The MILEAD Fellows Program is designed to build a pipeline of African women leaders equipped to drive systemic change. Fellows benefit from: ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); High-quality leadership training Practical experience through community projects Exposure to experienced African leaders and mentors A lifelong network of women leaders across Africa The program emphasizes long-term impact by integrating leadership development with real-world community engagement. Contact and Updates For more information: Website: www.moremiinitiative.org Facebook: /MoremiAfrica Twitter/X: @MoremiAfrica Email: Fellows@moremiinitiative.org Tel: +233 530 429 644 ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); The 2026 MILEAD Fellows Program offers an important opportunity for young African women who are ready to strengthen their leadership skills and contribute meaningfully to social change across the continent. Interested candidates should submit their applications before March 20, 2026 . Find out more https://moremiinitiative.org/2026-milead-fellows-program-announcement/ The post 2026 MILEAD Fellows Program for Young African Women Leaders (Applications Open) appeared first on Opportunities for Youth .","tags":["education","Africa","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"7c5608d4a453c43ef9e6cab6401d81aceb2febf8","title":"FAO EYPA Mentorship Journey Launches Phase II to Empower Young Women Farmers Across Africa","url":"https://opportunitiesforyouth.org/2026/02/20/fao-eypa-mentorship-journey-launches-phase-ii-to-empower-young-women-farmers-across-africa/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-20T20:28:20Z","summary":"The Empowerment of Young Women Farmers in Africa through Inclusive Mentorship Programme (EYPA) is officially launching Phase II , marking a major step forward in supporting young women in agriculture across Africa. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Building on the success of its pilot phase, the programme is being implemented through a renewed partnership between the Food and Agriculture Organization (FAO) and the Pan-African Farmers Organization (PAFO) . This new phase places a strong focus on young women farmers , aiming to strengthen leadership, entrepreneurship, and economic opportunities within Africa s agrifood systems. What is EYPA Phase II? The first phase of the EYPA Programme s Mentorship Programme is designed to provide inclusive mentorship, capacity building, and professional networking opportunities for young women working in agriculture. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Phase II will scale up the successful mentorship model developed during the pilot stage by addressing gender-specific challenges that often limit women s participation and leadership in agrifood systems. Through this initiative, participants will gain: Tailored mentorship from experienced professionals Capacity-building activities and training sessions Networking opportunities across regions Skills development for agribusiness growth Increased confidence and leadership capacity ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The programme also supports the goals of the International Year of the Woman Farmer (IYWF 2026) by promoting women s economic empowerment and closing gender gaps in agriculture. Call for Expression of Interest Now Open A Call for Expression of Interest has been launched to recruit both mentors and mentees for the programme. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Application Deadline: Friday, 6 March 2026 Find the call for mentees here Find the call for mentors here Up to 50 young women farmers from different regions across Africa will be selected to participate in this phase. What Participants Will Gain EYPA Phase II aims to unlock the potential of young women leaders and innovators by equipping them with practical and business-focused skills, including: Financial literacy and business planning Organizational and leadership skills Market access and value chain understanding Agribusiness development strategies Professional mentorship and peer learning ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); By strengthening these competencies, the programme contributes to the broader transformation of Africa s agrifood systems and supports sustainable economic growth. Regional Pitching Sessions and Final Competition Following the structure of the pilot phase, the mentorship journey will culminate in regional pitching sessions where mentees will present their agribusiness ideas and business models. Participants will showcase: Business and financial models Innovation and sustainability approaches Social and economic impact of their ventures ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Finalists demonstrating strong pitching skills will advance to a final pitching competition hosted at the PAFO Headquarters in Kigali, Rwanda . During the final event, selected mentees will: Present their agribusiness progress Showcase outcomes from the mentorship journey Compete for two cash prizes Strengthening Youth and Women Leadership in Agriculture The EYPA Mentorship Programme reflects the shared commitment of FAO and PAFO to building youth leadership and empowering women in agriculture. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Implemented under a broader Memorandum of Understanding (MoU) collaboration, Phase II represents a strategic effort to equip young women farmers with the tools, knowledge, and opportunities needed to thrive in modern agrifood systems. By investing in mentorship and capacity development, EYPA aims to nurture the next generation of agricultural leaders driving innovation and sustainability across Africa. The launch of EYPA Phase II signals a powerful opportunity for young women farmers to strengthen their skills, grow their agribusinesses, and expand their professional networks. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); For aspiring women leaders in agriculture, this programme offers a unique platform to learn, connect, and showcase innovation on a continental stage. The post FAO EYPA Mentorship Journey Launches Phase II to Empower Young Women Farmers Across Africa appeared first on Opportunities for Youth .","tags":["education","Africa","Volunteering"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-21T22:36:34Z","updated_at":"2026-02-21T22:36:34Z"}
{"id":"26c17fb641a958b23333c934a1c5779197e4f36a","title":"European Forum Alpbach Scholarship Programme 2026 (EFA26) | Fully Funded Opportunity for Global Youth","url":"https://opportunitiesforyouth.org/2026/02/20/european-forum-alpbach-scholarship-programme-2026-efa26-fully-funded-opportunity-for-global-youth/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-20T19:26:32Z","summary":"The European Forum Alpbach Scholarship Programme 2026 is now open for applications, offering a fully funded opportunity for students, young professionals, and emerging leaders from around the world to participate in one of Europe s most prestigious interdisciplinary forums. Held annually in the Austrian Alps, the European Forum Alpbach (EFA) brings together future changemakers, policymakers, researchers, and innovators to exchange ideas, build leadership skills, and shape solutions for Europe and the world. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This scholarship programme is designed for first-time participants who want to gain international exposure, expand their networks, and engage in high-level dialogue across sectors. About the European Forum Alpbach Scholarship Programme Every year, hundreds of young talents travel to Alpbach to take part in a unique two-week experience that combines academic learning, policy dialogue, and cross-cultural exchange. Scholarship holders are at the heart of the Forum and are the only participants who remain for the full duration of the event. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The programme includes: Scientific, competence-based, and artistic seminars and studios High-level conferences with global decision-makers and experts Leadership and skills development sessions Interdisciplinary discussions and networking opportunities Social and cultural activities designed to foster collaboration Approximately 350 scholarships are awarded annually by the European Forum Alpbach and the Forum Alpbach Network (FAN). ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Application Dates for EFA Scholarship 2026 Applicants should take note of the official application period: Applications open: 2 March 2026 Application deadline: 22 March 2026 (11:59 PM CET) Due to the competitive nature of the programme, early preparation is strongly recommended. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Why Apply for the European Forum Alpbach Scholarship? The EFA Scholarship Programme offers more than financial support. It provides an immersive leadership experience that helps participants grow professionally and personally while engaging with some of the most pressing issues facing Europe and the world. Key benefits include: Full participation in the European Forum Alpbach event Access to influential policymakers, academics, and industry leaders International networking with peers from diverse backgrounds Opportunities for leadership development and interdisciplinary learning Long-term connection to a global alumni community EFA as a Lifelong Community Participation in the European Forum Alpbach does not end after the event. Scholarship holders become part of the Forum Alpbach Network (FAN), a strong international alumni community dedicated to promoting dialogue and cooperation across borders. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); The network includes: 34 alumni initiatives Representation across 20 countries Year-round events and collaboration opportunities A growing community committed to shaping a better Europe How to Apply for the EFA Scholarship Programme Applicants can submit their applications through two pathways depending on their regional affiliation. Applications will be open from 2-22 March 2026 (2 pm 11:59 pm CET) Application via the Forum Alpbach Network (FAN) Applicants with nationality or residency ties to specific FAN clubs must apply through their respective alumni club. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); FAN clubs with separate scholarship selection processes include: These are the FAN clubs who offer EFA-scholarships and have a separate selection process: CA Burgenland , CA Liechtenstein , CA Nieder sterreich , CA Poland, CA Upper Austria , CA Salzburg , CA Senza Confini (Carinthia, Northern Italy and Slovenia), CA Steiermark , CA S dtirol Alto Adige , CA Tirol , CA Vorarlberg , IG Wien . Applicants should consult the relevant FAN club website for detailed requirements and deadlines. Application via the European Forum Alpbach (EFA) If there is no FAN club in your country, or your local club does not have its own selection process, you may apply directly via the EFA online application platform. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Important application rules: The scholarship is open to international applicants worldwide, with a special focus on Europe outside Austria Applications must be submitted through the official online portal Incomplete applications will not be accepted Applications submitted by email will not be considered Missing documents submitted after the deadline will not be reviewed ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Special note: Nationals or permanent residents of ROC Taiwan must apply via the Lung Yingtai Cultural Foundation. Documents Required for the Application Applicants should prepare all required documents before beginning the application process. Ensuring completeness and accuracy is essential, as incomplete applications may be automatically rejected. Disqualification Policy and Use of AI The organisers clearly state that applications may be disqualified if: ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Minimum eligibility criteria are not met The letter of motivation is generated using artificial intelligence Applicants are encouraged to submit authentic and original application materials. Q A Webinars for Applicants To support prospective applicants, the organisers are hosting official Q A webinars where participants can speak directly with the scholarship team. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Webinar schedule: Do you still have questions? Sign up for one of our Q A webinars on the EFA26 scholarship programme and talk directly to the organisers. Webinar #1 Thursday, 26 February 2026 5:30 pm 6:30 pm (CET). Register here. Webinar #2 Wednesday, 4 March 2026 5:30 pm 6:30 pm (CET). Register here. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Webinar #3 Tuesday, 17 March 2026 9:30 am 10:30 am (CET). Register here. Contact Information For additional questions about the scholarship programme: Email: scholarships@alpbach.org Contact person: Melissa N met, Unit Communities, Stakeholder Manager, Scholarship Programme ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Who Should Apply? The European Forum Alpbach Scholarship Programme is ideal for: Students and recent graduates Young professionals and early-career leaders Researchers and policy enthusiasts Social impact practitioners and civic leaders Youth changemakers interested in global dialogue and European affairs Applications will be open from 2-22 March 2026 (2 pm 11:59 pm CET) The European Forum Alpbach Scholarship Programme 2026 is a highly competitive, fully funded opportunity for young leaders seeking international exposure, meaningful dialogue, and long-term professional growth. With access to influential networks, interdisciplinary learning, and a vibrant alumni community, the programme offers a powerful platform for those ready to contribute to shaping the future of Europe and beyond. The post European Forum Alpbach Scholarship Programme 2026 (EFA26) | Fully Funded Opportunity for Global Youth appeared first on Opportunities for Youth .","tags":["education","Europe","Conferences"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-21T22:36:34Z","updated_at":"2026-02-21T22:36:34Z"}
{"id":"5cc5d3efd8bd3c82a1a8a6bb5940b6a1457c1d42","title":"LinkedIn Future of Work Fund 2026: Global AI Workforce Grant Supporting Nonprofits Preparing Young Adults for the AI Economy","url":"https://opportunitiesforyouth.org/2026/02/20/linkedin-future-of-work-fund-2026-global-ai-workforce-grant-supporting-nonprofits-preparing-young-adults-for-the-ai-economy/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-20T17:10:30Z","summary":"The LinkedIn Future of Work Fund 2026 is a global philanthropic grant initiative designed to help nonprofit organizations prepare young people for a rapidly changing labor market shaped by artificial intelligence. As automation and AI technologies continue transforming industries, LinkedIn is expanding its commitment to economic inclusion by funding organizations that help young adults successfully transition into an AI-powered workforce. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The 2026 edition builds on LinkedIn s first year of funding nonprofit innovators worldwide and introduces an expanded funding round combining financial grants and in-kind support resources. The program focuses specifically on young adults facing structural barriers to employment and aims to ensure that technological transformation does not widen inequality. Why the Future of Work Fund Matters Artificial intelligence is not just creating new jobs; it is reshaping nearly every existing one. According to LinkedIn projections, approximately 70% of the skills required for jobs will change by 2030. This means traditional career preparation models are becoming outdated. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The challenge is not simply training people to use technology. Instead, the workforce now requires a combination of: AI fluency and digital capability Critical thinking and adaptability Communication and collaboration Problem-solving in uncertain environments ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Many young adults particularly those from underserved backgrounds lack access to training and opportunities that help them adapt to this shift. The Future of Work Fund exists to support organizations solving exactly this problem. What the Fund Supports The fund provides both financial grants and in-kind support to nonprofit organizations delivering programs that expand economic opportunity in an AI-driven labor market. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Key Focus Areas Organizations applying must demonstrate a clear and practical approach to at least one of the following: 1. Preparing Young Adults for AI-Driven Careers Programs that teach AI literacy, digital skills, and workforce readiness for modern job markets. 2. Improving Job Access Initiatives helping career starters connect with employment opportunities using technology and AI-enabled pathways. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 3. Supporting Workforce Success Training that helps young workers thrive after employment through adaptability, communication, and lifelong learning skills. 4. System-Level Workforce Innovation Projects influencing how education systems, training institutions, or employers integrate AI workforce preparation. What LinkedIn Means by AI Innovation LinkedIn is not only interested in teaching technical coding skills. Instead, the fund prioritizes organizations that combine technological learning with human capabilities. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Supported initiatives typically include: AI-fluency training programs Career navigation tools powered by AI Skills-matching platforms Job readiness pathways Human-skill development (communication, collaboration, adaptability) Alternative credential programs Who the Fund Aims to Help The program focuses on young adults entering the workforce who face employment barriers. These may include: Individuals from low-income communities First-generation professionals Learners outside traditional university pathways Underemployed youth Career starters without professional networks ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Typical target age range: 18 24 (varies by country) Eligibility Requirements for Organizations To qualify, applicants must meet all of the following conditions. Organizational Status Must be a legally registered nonprofit, charity, or equivalent not-for-profit organization U.S. organizations must hold 501(c)(3) status Must be able to directly receive grant funding ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Program Focus Organizations must demonstrate: Workforce development programming Clear use of AI innovation OR preparation for AI workforce transition Support for young adults facing economic opportunity barriers Organizations not meeting these requirements are encouraged to use LinkedIn s free nonprofit resources instead. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Funding and Support Structure Selected organizations receive a combination of monetary and strategic assistance. Financial Support Cash grant funding for program implementation and expansion. In-Kind Support Access to LinkedIn expertise Workforce insights and data Platform resources Strategic guidance This hybrid model helps organizations scale impact beyond traditional grants. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Evaluation Criteria Applications are reviewed based on: Demonstrated impact potential Clarity of AI integration Capacity to support underserved young adults Scalability of program model Alignment with economic inclusion goals Application Deadline March 15, 2026 at 12 PM PT Submit your application HERE . Visit the LinkedIn Social Impact website HERE for more details. Click HERE to discover more grant opportunities. The post LinkedIn Future of Work Fund 2026: Global AI Workforce Grant Supporting Nonprofits Preparing Young Adults for the AI Economy appeared first on Opportunities for Youth .","tags":["education","Grants","Africa","America","Asia","Australia and Oceania","Continent","Europe","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-21T22:36:34Z","updated_at":"2026-02-21T22:36:34Z"}
{"id":"d84b8ba73ecfcd4a1ee39cee5cf1c259c5b89781","title":"Apply for SCEG Caribbean Economic Growth Grants 2026 – Mercy Corps Funding Opportunity","url":"https://opportunitiesforyouth.org/2026/02/20/apply-for-sceg-caribbean-economic-growth-grants-2026-mercy-corps-funding-opportunity-2/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-20T15:56:14Z","summary":"The Mercy Corps Strengthening Caribbean Economic Growth (SCEG) Program has launched a Small Grants Challenge aimed at supporting organizations driving sustainable economic development across the Caribbean. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Through this funding opportunity, up to 12 organization s will receive grants of up to $50,000 USD each to implement impactful, locally driven projects that strengthen livelihoods, businesses, and economic systems in the region. About the SCEG Small Grants Challenge The SCEG initiative is designed to accelerate inclusive economic growth by empowering organisations working to: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Expand employment opportunities across key sectors Strengthen micro, small, and medium enterprises (MSMEs) Improve access to market-driven inputs, services, and business support systems ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); This program prioritizes practical, scalable solutions that can create measurable economic impact within a 12-month project period . Why Apply? This grant offers a powerful opportunity to: Access funding to scale your economic impact Strengthen local business ecosystems and employment Partner with an internationally recognized development organization Deliver measurable results that support long-term economic resilience ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Who Can Apply? This opportunity is open to registered organisations that are based in or operating within the following Caribbean countries: Barbados The Bahamas Grenada Jamaica Saint Kitts and Nevis Organisations may include NGOs, social enterprises, private sector actors, and development-focused institutions that align with the program s goals. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Grant Value and Duration Grant amount: Up to $50,000 USD per organisation Number of awards: Up to 12 grantees Project duration: Maximum of 12 months Key Dates Application Open: February 9, 2026 Application Deadline: February 23, 2026 (11:59 PM AST) How to Apply Interested organisations can submit their applications HERE Opportunity Summary Category Details Program Name Strengthening Caribbean Economic Growth (SCEG) Small Grants Challenge Host Organization Mercy Corps Location Caribbean (Barbados, Bahamas, Grenada, Jamaica, Saint Kitts Nevis) Funding Amount Up to $50,000 USD Deadline February 23, 2026 Project Duration Up to 12 months If your organisation is working to create jobs, support MSMEs, or strengthen economic systems in the Caribbean , this is a strong opportunity to secure funding and scale your impact. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Apply before the deadline and position your organization at the forefront of economic transformation in the Caribbean. The post Apply for SCEG Caribbean Economic Growth Grants 2026 – Mercy Corps Funding Opportunity appeared first on Opportunities for Youth .","tags":["education","Grants","Continent","Latin America and the Caribbean"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-21T22:36:34Z","updated_at":"2026-02-21T22:36:34Z"}
{"id":"0e1dde3212734fd0c17a8d836049207e348c48c4","title":"Apply Now: International Law Fellows Network 2026 on the Future of the Rule of Law","url":"https://opportunitiesforyouth.org/2026/02/20/apply-now-international-law-fellows-network-2026-on-the-future-of-the-rule-of-law/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-20T15:53:27Z","summary":"The global rule of law is under unprecedented strain. Long-standing models of legal cooperation and governance once shaped by post Cold War optimism are now being challenged by political polarisation, populism, and competing global visions of governance. In response, leading institutions are convening the next generation of legal professionals to rethink how the rule of law can be defended and strengthened in the 21st century. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The International Law Fellows Network 2026: The Future of the Rule of Law in a Fractured World offers a unique opportunity for early- to mid-career lawyers to engage in this urgent conversation and develop practical strategies for safeguarding justice, accountability, and legal integrity worldwide. Why the Rule of Law Matters Now The United States and Europe have historically promoted rule-of-law frameworks through foreign aid, technical assistance, and policy conditionality. However, those approaches are now facing mounting pressure: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); In the United States , political attacks on courts and constitutional structures reveal internal vulnerabilities. Across Europe, democratic institutions are being tested by populism, executive overreach, and disinformation. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Globally, rival governance models from Russia and China emphasize sovereignty and centralized control over accountability and individual rights. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); As these trends reshape global governance, rising legal professionals must grapple with how to uphold core principles fairness, equality, transparency, and justice in an increasingly complex world. About the Programme This high-level programme is convened by Salzburg Global Seminar , the International Bar Association (IBA) , and the 21st Century Trust . It brings together early- to mid-career lawyers working in: Major law firms International organizations Public institutions Human rights and advocacy spaces ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Participants will explore how their work in cross-border transactions, compliance, dispute resolution, and human rights law can help defend and adapt the rule of law in a fractured geopolitical landscape. Programme Details Programme Dates: June 11 14, 2026 Location: Schloss Leopoldskron , Salzburg, Austria Application Deadline: April 5, 2026 Fees Funding Fully Funded: Participants selected through IBA member firms or the Salzburg Global Cutler Fellowship community will receive full coverage of programme fees, accommodation, and meals. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); IBA-supported participants may also receive travel funding. General Applicants: Programme cost: $4,250 Employer sponsorship is encouraged. Who Should Apply? Ideal Participants Early- to mid-career lawyers with an interest in international law and global governance ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Professionals engaged in cross-border legal practice or policy work Advocates committed to upholding democratic institutions and human rights Programme Goals The International Law Fellows Network aims to: Strengthen leadership among rising international lawyers Equip participants to defend and adapt rule-of-law frameworks Foster transatlantic collaboration on global legal challenges Promote legal systems grounded in accountability, fairness, and rights Key Questions the Programme Will Explore How can lawyers safeguard the rule of law amid geopolitical fragmentation? ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); What role do legal professionals play in defending democratic institutions? How can global legal frameworks respond to competing governance models? What practical strategies can strengthen transparency, accountability, and justice worldwide? ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); How to Apply Click HERE , To apply. Deadline: April 5, 2026 In a time when legal norms and democratic institutions are increasingly challenged, the need for principled and forward-thinking legal professionals has never been greater. The International Law Fellows Network 2026 offers a powerful platform for rising lawyers to shape the future of global justice and ensure the rule of law remains a cornerstone of free, fair, and stable societies. If you are ready to contribute to this mission, apply today and become part of a global network committed to defending the rule of law. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); For more Fellowship opportunities, click HERE . The post Apply Now: International Law Fellows Network 2026 on the Future of the Rule of Law appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Fellowship","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-21T22:36:34Z","updated_at":"2026-02-21T22:36:34Z"}
