{"id":"7d508aa572f78a863edf35d8da35bb542c7182c1","title":"Communications Design Lead at YLabs: A Senior Role Shaping Global Youth-Focused Impact","url":"https://opportunitiesforyouth.org/2026/02/23/communications-design-lead-at-ylabs-a-senior-role-shaping-global-youth-focused-impact/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T01:08:39Z","summary":"YLabs, a global design and research organization dedicated to improving health and economic opportunities for young people, is seeking a Communications Design Lead . This senior consulting role is ideal for design professionals who excel at transforming complexity into clarity, and who are eager to contribute to projects impacting young people across Africa, Asia, and Latin America. With a strong foundation in human-centered design and experience working in diverse global contexts, the successful candidate will help shape high-quality communication and design outputs that support strategic decision-making, research translation, and global development initiatives. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); YLabs works with young people aged 10 24 to co-create solutions in areas such as sexual and reproductive health, HIV/AIDS, mental health, climate resilience, and financial inclusion. The organization maintains teams across the United States and Rwanda, operating in hybrid and remote formats within the GMT+0 to GMT+4 time zones. About the Role at YLabs The Communications Design Lead will play a central role in converting research insights, system maps, stakeholder feedback, and program strategies into compelling, high-fidelity visual frameworks. This is a full-time consultancy position at 40 hours per week, with an expected start date of March 1, 2026 . The contract runs for three months with the possibility of extension depending on performance and project needs. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Candidates ideally based in East Africa or elsewhere within GMT+0 to GMT+4 are encouraged to apply. YLabs is looking for someone who combines visual design mastery with strong systems thinking, UI/UX fluency, and interdisciplinary communication skills. Core Responsibilities The Communications Design Lead will collaborate closely with multidisciplinary teams, partners, and funders to produce contextualized, relevant, and actionable design outputs. Responsibilities include: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Designing high-fidelity frameworks, toolkits, and visual assets that support alignment across teams. Translating complex research and abstract concepts into intuitive visual communication. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Applying strong design fundamentals, including accessibility, hierarchy, layout, and typography. Conducting sensemaking from user insights and incorporating them into design decisions. Maintaining and extending YLabs existing visual identity through coherent, thoughtful design. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Creating front-end UI/UX concepts and digital visual experiences aligned with project needs. This role requires the ability to communicate clearly across diverse audiences from local community members to C-suite leaders. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Expected Deliverables Depending on ongoing project needs, deliverables may include: Comprehensive toolkits and reusable templates Visual syntheses of research findings and insights Service design blueprints and journey maps Advanced systems maps Data visualizations and infographics Any additional outputs formally delegated by project leadership These materials will support strategic learning, program design, partner alignment, and broader communication goals. Who Should Apply YLabs is seeking candidates who bring: Strong professional experience in communication design and systems visualization A portfolio demonstrating high-fidelity frameworks and strategic design outputs Proficiency in Adobe Creative Suite, Figma, Mural, and other collaborative design tools ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Experience working with global development, innovation labs, or social impact organizations Demonstrated understanding of design for diverse and low-resource contexts, particularly within African communities Knowledge of accessibility and inclusive design principles Confidence collaborating with multidisciplinary teams ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Compensation YLabs follows Project Fair s pay equity standards to ensure fair and competitive compensation. The pay range for this senior-level consultancy is: 161,538 RWF 186,538 RWF per day (equivalent to USD 111 127 per day), tax inclusive , commensurate with experience. Application Deadline Applications are reviewed on a rolling basis until the position is filled. However, YLabs expects the successful candidate to begin on March 1, 2026 . Early applications are strongly encouraged to ensure timely review by the Hiring Committee. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Final Notes All applicant information is handled confidentially, and hiring is contingent on background checks and clearances. Only shortlisted candidates will be contacted due to the volume of applications. If you are a design professional passionate about youth empowerment, global impact, and translating complex ideas into compelling visual communication, this role offers a unique opportunity to contribute your skills at a global scale. Application can be accessed from here . To know more about such opportunities, click here . The post Communications Design Lead at YLabs: A Senior Role Shaping Global Youth-Focused Impact appeared first on Opportunities for Youth .","tags":["education","Africa","America","East Africa Consultancy Opportunities","Global Design Jobs","Human-Centered Design Africa","Social Impact Design Roles","Visual Communication Jobs","YLabs Communications Design Lead","Youth Development Careers"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"294931f42317a4c599935fb4884a6a73be5337f5","title":"Presidency Youth Climate Champion (PYCC) – COP31: A National Call for Young Climate Leaders","url":"https://opportunitiesforyouth.org/2026/02/23/presidency-youth-climate-champion-pycc-cop31-a-national-call-for-young-climate-leaders/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T01:00:53Z","summary":"The Australian Government is calling for Expressions of Interest (EOIs) from young Australians ready to shape global climate action. The Presidency Youth Climate Champion (PYCC) for COP31 will play a central role in ensuring that children and young people are not only represented, but meaningfully included, in climate decision-making at the world s most significant climate summit. This prestigious role offers a rare opportunity to influence international climate governance at the highest level. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Application Deadline: 1 March 2026, 11:30 pm AEDT About the Presidency Youth Climate Champion Role The PYCC is a non-statutory, full-time appointment for up to 20 months, created under UNFCCC Decision 16/CP.28. The position is embedded within the COP31 Presidency, enabling the selected candidate to bring youth perspectives into the heart of climate negotiations. With COP31 hosted by T rkiye and Australia serving as President of Negotiations, the PYCC will contribute to a process that directly influences climate policies shaping the futures of young people for decades to come. The role is designed to create space, voice, and influence for youth without placing responsibility for negotiating outcomes on young people themselves. The PYCC will be supported by the COP31 Presidency team and collaborate with national, regional, and international partners. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Key Responsibilities 1. Meaningful Youth Participation The PYCC will use their position to ensure children and youth can participate fully and safely across COP31-related processes. This includes supporting opportunities at events such as COY, Pre-COP, COP, and Subsidiary Body meetings. The aim is to create structured pathways for youth to contribute policy ideas and generate tangible outcomes. 2. Amplifying Youth Voices A major function of the role is to elevate the priorities of diverse youth communities including First Nations and Pacific youth within the Presidency and broader UNFCCC discussions. This may include presenting youth-led statements, sharing stocktake insights, and convening dialogues with global decision-makers. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); 3. Systems, Access, and Support The PYCC will advocate for proper safeguarding, accessibility, logistics, and resourcing to enable inclusive participation. This includes supporting COP work programs relevant to children and youth and ensuring youth-focused spaces are appropriately structured and resourced. 4. Capacity-Building The PYCC will help expand access to climate education, negotiation skills, and UNFCCC learning tools. This includes coordinating capacity-building efforts across domestic, regional, and international networks to strengthen long-term youth engagement in climate governance. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Eligibility Requirements Applicants must: Be aged 18 35 throughout the full duration of the appointment (until December 2027) Be an Australian citizen Demonstrate strong English writing and communication skills Have experience in youth engagement and climate-related work Be available for full-time commitment , including domestic and international travel, for the entire COP31 Presidency period ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Cultural capability, policy fluency, and trust-based leadership especially regarding First Nations and Pacific youth perspectives are key qualities sought in the ideal candidate. About the Opportunity This is a high-profile leadership position that requires deep collaboration with the COP31 Presidency, the UNFCCC Secretariat, YOUNGO, civil society partners, and youth networks globally. The role demands professionalism, diplomacy, and the ability to navigate complex international spaces with clarity and credibility. The PYCC will travel domestically and internationally, attend key climate meetings, and engage youth communities across Australia and beyond. Remuneration will be negotiated based on skills, experience, and institutional approvals. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Why This Role Matters The decisions made at COP31 will directly shape climate policies impacting the lives of young people. By appointing a PYCC, Australia ensures that the voices of youth are not peripheral but integrated into the climate processes that determine global pathways for adaptation, mitigation, and resilience. For young Australians seeking to contribute to global climate solutions, the PYCC role represents a landmark opportunity to drive action, amplify voices, and influence the future. Application can be accessed from here . To know about more such opportunities, click here . The post Presidency Youth Climate Champion (PYCC) – COP31: A National Call for Young Climate Leaders appeared first on Opportunities for Youth .","tags":["education","unknown","Australian Government Opportunities","Climate Governance","Climate Leadership Programs","COP31 Australia","UNFCCC Opportunities","Youth Climate Champion","youth engagement climate action"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"e94715ba4f9e650f9df12e885cf2b0cfd3fb2c26","title":"Paul D. Coverdell Fellows Program: Graduate Funding for Returned Peace Corps Volunteers","url":"https://opportunitiesforyouth.org/2026/02/23/paul-d-coverdell-fellows-program-graduate-funding-for-returned-peace-corps-volunteers/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T00:34:47Z","summary":"The Paul D. Coverdell Fellows Program offers Returned Peace Corps Volunteers (RPCVs) a unique pathway to continue their service while pursuing graduate degrees, professional certificates, and advanced training across the United States. Designed to recognise the global experience, adaptability, and community-driven skills that Volunteers gain abroad, the program provides financial assistance and hands-on professional opportunities that strengthen careers and support underserved communities. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the Paul D. Coverdell Fellows Program The Coverdell Fellows Program is an educational fellowship that supports RPCVs seeking to deepen their impact through further study. Fellows receive a combination of tuition reductions, scholarships, stipends, assistantships, or other forms of financial aid. Beyond academic support, the program keeps RPCVs connected to the Peace Corps mission by placing them in internships in the United States that address locally identified needs. This blend of education, service, and professional advancement makes the program one of the most valuable benefits available to Volunteers after returning home. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Why Become a Coverdell Fellow? Financial Support Partner universities offer fellows a range of benefits, from partial tuition reductions to full scholarships and paid assistantships. This makes advanced education more affordable and accessible for RPCVs across different fields. Hands-On Service Each Fellow completes an internship with a U.S.-based organisation, strengthening their applied skills while serving local communities. These internships align with Peace Corps values, ensuring that participants continue to support community priorities. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Professional Development Fellows build leadership skills, gain practical workplace experience, and expand their networks. Many institutions integrate internships with coursework, offering meaningful opportunities to connect learning with real-world problem-solving. Extending the Peace Corps Mission By sharing their international experiences in classrooms and local communities, Fellows help fulfil the Peace Corps third goal: to promote a better understanding of other peoples among Americans. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Choice and Flexibility With more than 150 partner universities across the United States, RPCVs can pursue degrees in social work, public health, education, international affairs, environmental studies, and many more disciplines. Federal Hiring Advantage RPCVs may qualify for extended noncompetitive eligibility for federal jobs up to three years after service, depending on agency discretion if they enrol soon after returning. Eligibility Criteria RPCVs maintain lifetime eligibility for the Coverdell Fellows Program if they meet one of the following: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Completed a full Peace Corps tour or received completion of service status. Were medically separated. Received interrupted service due to circumstances beyond their control. Completed at least 12 months of Peace Corps Response or Advancing Health Professionals service within a 24-month period. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Volunteers who resigned or were administratively separated are not eligible unless they previously earned eligibility through earlier service. Questions about eligibility can be directed to the Peace Corps Office of University Programs. How to Apply Applications to the Coverdell Fellows Program are handled directly by partner universities. The Peace Corps does not manage or decide individual admissions. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Prospective applicants should: Contact coordinators at participating universities. Request detailed program and application information. Follow each school s deadlines, requirements, and instructions carefully. Prepare necessary materials such as transcripts, test scores (if required), and a signed Description of Service (DOS). Many universities allow RPCVs to apply online, even while still abroad. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application Deadline Because each partner institution manages its own application cycle, deadlines vary by program . RPCVs should check the specific due dates for every university they plan to apply to. Why This Program Matters For RPCVs, the Coverdell Fellows Program is more than an academic opportunity it is a chance to build on global service, strengthen local communities, and gain meaningful professional experience. Whether through public health work, educational initiatives, or community development, Fellows continue to advance the core principles of the Peace Corps while preparing for impactful careers. Application can be accessed from here . To know more about such opportunities, click here . The post Paul D. Coverdell Fellows Program: Graduate Funding for Returned Peace Corps Volunteers appeared first on Opportunities for Youth .","tags":["education","America","Fellowship","Community Service Internships","Coverdell Fellows Program","Graduate Fellowships USA","Peace Corps Benefits","Returned Peace Corps Volunteers","RPCV Education Funding","University Partnerships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"b715494676bbc30cd132cc56aab89d34fa9efdf2","title":"RiseUp with ServiceNow x The Diana Award: A Free 10-Week Tech Career Accelerator for Young People in Africa","url":"https://opportunitiesforyouth.org/2026/02/23/riseup-with-servicenow-x-the-diana-award-a-free-10-week-tech-career-accelerator-for-young-people-in-africa/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T00:18:34Z","summary":"The Diana Award, in partnership with ServiceNow, has opened applications for RiseUp: Advanced Foundations a fully funded, 10-week programme designed to help young people launch careers in the fast-growing ServiceNow technology ecosystem. Through hands-on training, mentoring, and a globally recognised certification pathway, the programme equips participants with the practical and professional skills needed to succeed in tech. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the RiseUp: Advanced Foundations RiseUp: Advanced Foundations is a full-time, intensive learning experience aimed at democratising access to technology careers. Delivered entirely online, the programme runs from 13 April to 19 June 2026 , Monday to Friday, 9:00 17:00 SAST. It is open to young people aged 18 30 based in Kenya, Nigeria, and South Africa , and offers free training to ensure that financial barriers do not limit potential. The initiative forms part of The Diana Award s mission to create meaningful opportunities for young people, while ServiceNow contributes its expertise to open pathways into one of the world s most in-demand digital platforms. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Who Can Apply? The programme is ideal for individuals who are motivated to begin a career in tech, regardless of whether they have prior experience or formal qualifications. Applications are open to: Young people aged 18 30 Residents of Kenya, Nigeria, or South Africa Individuals not currently employed by ServiceNow, a ServiceNow customer, or a ServiceNow partner ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The programme especially encourages participation from groups underrepresented in the tech industry. The ideal learner is: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Proficient in English Curious and eager to learn Able to think through problems logically Comfortable collaborating with others and explaining ideas Ready to commit full-time for the entire 10-week duration Programme Benefits Participants will gain comprehensive training in the ServiceNow ecosystem, building both technical knowledge and professional confidence. The programme offers: Technical Skills Learners will develop hands-on experience in: Application design, development, and management Using Flow Designer, Service Catalog, and JavaScript User interface design and process automation Analytical and communication skills relevant to IT environments Foundations of artificial intelligence and responsible AI usage ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); By the end of the programme, participants will be equipped to support digital workflows, automate tasks, and contribute effectively in tech roles. Employability and Career Skills The programme includes: Personalised one-to-one mentoring Group networking opportunities with professionals Industry-recognised certification (after examination) Ongoing job placement and career support These elements together provide a strong foundation for employment and long-term career growth. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Career Pathways After Completion Graduates of RiseUp: Advanced Foundations can pursue a wide range of entry-level tech roles across companies that use ServiceNow. Potential career paths include: Platform Developer or Application Specialist Junior Technical Consultant Software Developer Analyst or Operations Specialist The programme prepares participants with the skills, confidence, and credentials needed to enter the tech workforce immediately. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Additional Programme Features Mentorship Participants may opt for one-on-one guidance from experienced mentors who provide personalised advice, help navigate challenges, and support learners in identifying their strengths. Mental Fitness Workshops Led by The Diana Award, these sessions focus on wellbeing, confidence, and resilience key elements for navigating the professional world. Networking Opportunities Throughout the programme, participants will connect with peers, alumni, industry experts, and employer partners, building community and expanding professional networks. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application Process The application journey includes: Submitting an Expression of Interest form Attending an introductory webinar Completing ServiceNow onboarding Receiving a conditional offer Completing pre-work on the ServiceNow platform Starting the programme Application can be accessed from here . To know more about such opportunities, click here . The post RiseUp with ServiceNow x The Diana Award: A Free 10-Week Tech Career Accelerator for Young People in Africa appeared first on Opportunities for Youth .","tags":["education","Short Courses","Africa","Free Tech Programme","Kenya Nigeria South Africa Opportunities","RiseUp with ServiceNow","ServiceNow Certification","Tech Training Africa","The Diana Award","Youth Career Development"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"bd1003ebd09821bafff7ba9b866057d5e6fe0eeb","title":"Massive Global Funding Opportunity: Submit Your Expression of Interest for the GPE Education Out Loud Grant Agent","url":"https://opportunitiesforyouth.org/2026/02/22/massive-global-funding-opportunity-submit-your-expression-of-interest-for-the-gpe-education-out-loud-grant-agent/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T18:16:52Z","summary":"If your organization works to transform education systems through civil society engagement, transparency, and accountability, this is a career-defining global opportunity you can t afford to miss. The Request for Expression of Interest: GPE Education Out Loud Grant Agent is now officially open. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); What Is Education Out Loud (EOL)? Education Out Loud (EOL) is the largest global fund exclusively dedicated to supporting civil society engagement in education policy, public accountability, and transparency financed by the Global Partnership for Education (GPE) and implemented globally. EOL empowers civil society organizations to influence education planning, strengthen accountability mechanisms, and shape policies to improve learning outcomes for millions, especially the most marginalized. About GPE EOL The Global Partnership for Education (GPE) is the world s largest global fund dedicated to transforming education in low- and middle-income countries. GPE provides strategic finances, policy support, and advocacy leadership to help countries achieve equitable learning outcomes. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); As the manager of one of GPE s key advocacy instruments, Education Out Loud supports civil society organizations to: Increase transparency and monitoring of public education Influence national and regional policy reforms Build accountability mechanisms Strengthen data, research, and evidence-generating capacities ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Purpose of the Grant Agent Role GPE is seeking qualified organizations or consortia to serve as the next phase Grant Agent for Education Out Loud. The selected agent will: Oversee and manage the EOL fund portfolio across GPE partner countries. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Provide fiduciary and operational oversight of grants. Drive strategic support for civil society engagement in education advocacy . Strengthen learning, monitoring, evaluation, and communication across the portfolio. Work closely with GPE, civil society partners, and key stakeholders globally. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); This role influences how education advocacy and accountability are supported at scale across regions and political contexts. Who Can Apply? This call is open to: Not-for-profit organizations, international NGOs, multilaterals, civil society organizations Consortia / partnerships of organizations Entities with proven capacity to manage large, complex global grant portfolios Indirect cost recovery is capped (e.g. at 7% per some public posts shared about eligibility). In practice, eligible applicants will have: Strong financial management, transparency, and accountability systems Experience working across diverse regions and contexts Experience supporting civil society and advocacy networks Technical expertise in education policy, civic engagement, and civil sector development ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Capacity to manage complex, multi-stakeholder global grant portfolios (Exact eligibility criteria are detailed in the official EOI docs linked above) What to Submit Your Expression of Interest should demonstrate: Organizational capacity systems, staffing, and financial controls Experience in civil society and advocacy funding Global or multi-regional reach and language capabilities Potential to manage fiduciary compliance, learning, and accountability frameworks Proposed consortium arrangements (if applicable) ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Applications usually require: Cover letter / EOI statement Organizational profile and legal status Financial documents and audit reports Team CVs / resumes Proposed approach to managing EOL portfolio (Refer to the official call document for the exact template) Benefits of Becoming the Grant Agent Serving as the Education Out Loud Grant Agent provides: 1. Global leadership platform steward one of the world s largest civil society education funds 2. Influence on education advocacy policy processes worldwide 3. Strengthen institutional reputation in education systems transformation 4. Strategic partnerships with GPE, governments, NGOs, and civil society 5. Opportunity for organizational growth and learning in complex program management ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Start early deadlines are strict. Register for the webinar to clarify expectations. Prepare a comprehensive EOI narrative demonstrating impact, capacity, and accountability . Strengthen your consortium with partners that bring regional depth and technical expertise. Key Deadlines Timeline Milestone Date Call published January 2026 Information Webinar 23 February 2026 (07:00 ET) Register submit questions in advance by 16 February 2026 . EOI Submission Deadline 27 March 2026 Review / Selection Through June December 2026 Expected Start of Next Phase January 2027 Note: Webinar Q A and FAQ documents will be published after the webinar to support applicants. Apply here For more information visit here For more global opportunities click here The post Massive Global Funding Opportunity: Submit Your Expression of Interest for the GPE Education Out Loud Grant Agent appeared first on Opportunities for Youth .","tags":["education","Grants","Africa","America","Asia","Australia and Oceania","Continent","Europe","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"69ada12d1572f1a3dac56008f539658d2c2082bb","title":"PG&E Grants and Scholarships 2026 – STEM Funding, Financial Aid and How to Apply","url":"https://opportunitiesforyouth.org/2026/02/22/pge-grants-and-scholarships-2026-stem-funding-financial-aid-and-how-to-apply/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T18:15:08Z","summary":"If you re a student aiming for college funding, scholarships , or STEM support , this is the most complete guide you need packed with deadlines, requirements, links, qualifications, benefits, and expert tips to help you apply successfully. Based on the official PG E scholarship programs, here s everything you must know before time runs out. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); What Are PG E Scholarships? Pacific Gas and Electric Company (PG E) offers high-impact scholarships to help students across Northern and Central California pursue undergraduate degrees, especially in STEM (Science, Technology, Engineering Math) or community-focused initiatives. These awards ranging from $1,000 to $10,000 are designed to reduce the burden of college costs and reward academic excellence, leadership, financial need, and community impact. In 2025 alone, PG E awarded nearly 150 scholarships across these programs. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Who Should Apply: This program is ideal for students pursuing degrees in STEM fields particularly in engineering, computer science, environmental or biological sciences, physics, and math. Key Scholarship Programs Deadlines (2026) 1. PG E Better Together STEM Scholarships Application Opens: 12th January, 2026 Deadline: 12th March, 2026 Award Amounts: $2,500 $10,000 (varies by award) ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); 2. PG E ERG ENG Scholarships (Community Cause-Based) Application Opens: January 12, 2026 Deadline: February 28, 2026 Award Amounts: Typically $1,000 $6,000 (varies per scholarship) These scholarships are funded by PG E s Employee Resource Groups (ERGs) and Engineering Network Groups (ENGs) to support students connected to specific communities, causes, or industry goals. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Who Is Eligible? (Qualifications) For Both Scholarship Programs: Must be one of the following: High school senior or graduate Student with a GED Current college undergraduate Non-traditional student (e.g., adult learner, returning student, veteran) Must reside in PG E s service territory or be a dependent of someone who does. Must plan to enroll full-time in an accredited college or university in the fall semester. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); For STEM Scholarships: Must be pursuing your first undergraduate degree Must be enrolled or planning to enroll at: A 4-year college/university in California, OR A U.S. Historical Black College or University (HBCU) Scholarship Benefits What You Get 1. Financial Support Awards typically range from $1,000 to $10,000 Paid directly to your school in most cases ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); 2. Career Academic Recognition Scholarship awardees receive recognition for their accomplishments and may enhance resumes, internship and job applications. 3. Networking Community Support ERG and ENG participants connect with mentors, industry professionals, and student leaders expanding career opportunities. 4. No Discrimination on Race or Gender The community-driven scholarships are open to all students , with encouragement to apply to multiple awards for which you qualify. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); What You ll Need to Apply Most PG E scholarship applications require: Academic records (transcripts) Personal statement or essays Proof of residency in PG E service territory College enrollment plans or acceptance letter Letters of recommendation (for many ERG/ENG awards) Financial need and leadership examples (for merit-based STEM awards) Apply here Tips to Maximize Your Chances 1. Apply to multiple scholarships available under the ERG ENG umbrella your chances of winning improve significantly. 2. Start early: some supplemental essay requirements are unique to each scholarship. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); 3. Tailor essays to reflect community impact, leadership roles, career goals, and alignment with PG E s mission. 4. Recommend getting recommendations from teachers, mentors, or employers who can speak to your achievements. These PG E scholarships represent an exceptional opportunity to secure funding before most other scholarships open especially for students committed to STEM, leadership, community engagement, and academic success. With limited award slots and strong competition, preparedness and early action are key to your success. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); For more information visit here For more global opportunities click here The post PG E Grants and Scholarships 2026 – STEM Funding, Financial Aid and How to Apply appeared first on Opportunities for Youth .","tags":["education","Continent","America","Grants","Scholarships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"db4a291edb70dee87641f6b0a9a6a1c67051cf76","title":"CAMHRA Masters Scholarships 2026/2027 at SOAS: Full Tuition Funding for Mental Health Anthropology Studies","url":"https://opportunitiesforyouth.org/2026/02/22/camhra-masters-scholarships-2026-2027-at-soas-full-tuition-funding-for-mental-health-anthropology-studies/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T15:35:02Z","summary":"The Centre for Anthropology and Mental Health Research in Action (CAMHRA) is pleased to announce the CAMHRA Masters Scholarships 2026/2027 at SOAS University of London. These prestigious scholarships cover full tuition fees for eligible students pursuing postgraduate study in the anthropology of mental health. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); With funding available for both UK and overseas applicants, this opportunity supports outstanding candidates committed to advancing research and practice at the intersection of anthropology and mental health. Application Deadline: 30 April 2026 (11:59pm UK local time) About CAMHRA CAMHRA is a UKRI-funded research centre based in the SOAS Department of Anthropology and Sociology. It serves as a globally oriented, locally connected hub for innovative anthropological research, education, and public engagement on mental health. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Working with academic institutions, healthcare providers, policymakers, and service users, CAMHRA contributes anthropological perspectives to global conversations on mental distress, systems of care, and healing practices. Eligible Programmes Scholarships are available for the following programmes beginning in 2026/27: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); MA Medical Anthropology and Mental Health (Full-time: 1 year | Part-time: 2 years) MRes Social Anthropology (Full-time: 1 year | Part-time: 2 years) ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); The MA programme integrates social, cultural, medical, and psychological anthropology, while the MRes is research-focused and typically undertaken in preparation for PhD study. Scholarship Benefits Full tuition fee coverage for 2026/27 For part-time students, tuition fees covered for 2026/27 and 2027/28 ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Approximately three overseas fee places and four home fee places awarded annually One additional international scholarship with a living stipend for applicants from Afghanistan, Iran, or Iraq (subject to annual regional designation) ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Please note: Standard scholarships cover tuition fees only and do not include accommodation or living costs. Exceptional Circumstances Stipend For 2026/27, one additional scholarship including a living stipend (in line with UKRI studentships) is available for students who are resident in, or citizens of, Afghanistan, Iran, or Iraq. The stipend in 2025/26 was 22,780 for the academic year (inclusive of London weighting). Eligible applicants must indicate this in their scholarship application. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Eligibility Criteria Applicants must: For MA Medical Anthropology and Mental Health: Hold a minimum 2:1 bachelor s degree in social sciences or humanities; OR Hold a degree in health sciences such as medicine, psychology, nursing, or social work ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); For MRes Social Anthropology: Hold a minimum 2:1 bachelor s or master s degree Applicants without an anthropology background must hold a master s degree in another field All applicants must: Propose a strong research project using ethnographic methods related to mental health ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Submit a separate application to the relevant SOAS master s programme Demonstrate academic merit and research potential Application Process Step 1: Apply to your chosen programme (MA or MRes). ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Step 2: Submit your scholarship application via the SOAS admissions portal by 30 April 2026 (11:59pm UK time). Step 3: Shortlisted candidates will be invited for an online interview in June 2026. Final offers are expected by July 2026. In the previous cycle, approximately 150 applications were received, making this a highly competitive award. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Important Information for International Students Successful international applicants must apply for a UK Student visa and demonstrate sufficient funds to meet living requirements in London (minimum 13,761 as per UK government guidance). Why Apply? The CAMHRA Masters Scholarships are designed to support individuals who may otherwise be unable to pursue postgraduate study in anthropology due to financial, social, or time constraints. The programme particularly welcomes: Applicants working in mental health services Individuals with lived experience of mental health services Candidates from underrepresented groups in anthropology ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); This scholarship offers an exceptional opportunity to develop ethnographic research expertise, contribute to global mental health debates, and prepare for advanced doctoral study or professional leadership. How to Apply Applying for the CAMHRA Masters Scholarships 2026/27 is a two-step process: Step 1 Apply to your chosen programme: For the MA in Medical Anthropology and Mental Health , submit your application via the Taught Masters applications portal . ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); For the MRes in Social Anthropology , apply through the SOAS Doctoral School portal . Ensure you meet the programme-specific eligibility criteria before applying. Step 2 Apply for the CAMHRA Scholarship: Once your programme application is submitted, access the scholarship application through the SOAS admissions portal . ezstandalone.cmd.push(function () { ezstandalone.showAds(139); }); Complete the application by 30 April 2026, 11:59pm UK local time . You will be asked to outline your motivation, proposed research project, and how your studies will make a positive impact in the field of mental health. Shortlisted candidates will be invited to an online interview in June 2026. Final scholarship offers will be made by July 2026. ezstandalone.cmd.push(function () { ezstandalone.showAds(140); }); Important: You must submit a programme application to access the scholarship application, but you do not need to have received an offer of admission before the scholarship deadline. For queries, contact scholarships@soas.ac.uk . This process ensures that your scholarship application is considered alongside your programme application, so prepare both carefully to showcase your research potential and commitment to the anthropology of mental health. ezstandalone.cmd.push(function () { ezstandalone.showAds(141); }); For further information: Programme enquiries: mastersadmissions@soas.ac.uk Centre enquiries: camhra@soas.ac.uk For more scholarships: Click Here The post CAMHRA Masters Scholarships 2026/2027 at SOAS: Full Tuition Funding for Mental Health Anthropology Studies appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Latin America and the Caribbean","Master","Middle East and North Africa","Scholarships","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"34993e08068d8c0fa78519033d2ff09776dc2372","title":"Open Call for Knowledge Transfer: €25,000 Grants for Digital Training in Sustainable Food Systems","url":"https://opportunitiesforyouth.org/2026/02/22/open-call-for-knowledge-transfer-e25000-grants-for-digital-training-in-sustainable-food-systems/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T15:28:47Z","summary":"The STREAMING initiative has officially launched its Open Call for Knowledge Transfer , inviting organizations across Africa and Europe to design and implement innovative digital training programs that strengthen sustainable food trade systems. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); With 25,000 awarded per project and a total of 11 grants available , this call presents a significant opportunity for institutions committed to advancing food system innovation, women s empowerment, and cross-continental collaboration. At least 60% of the funding will support African Third Parties , with special encouragement for women-led organizations and female innovators. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); About the Open Call This Open Call supports the development of interactive, practice-oriented digital courses that bridge the gap between research and real-world application. The goal is to connect researchers with: Farmers Food producers Start-ups Public health actors Entrepreneurs and processors ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Projects must focus on equipping these groups with practical skills to enhance sustainability, innovation, and resilience in food systems. A central priority of the program is women s empowerment , ensuring that women farmers, entrepreneurs, processors, and innovators are actively targeted and supported. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Grant Details Funding Amount: 25,000 per project Total Projects Funded: 11 Geographic Focus: Africa and Europe Funding Allocation: Minimum 60% to African Third Parties Applicants may come from any country , not limited to STREAMING partner nations. Thematic Areas Proposed training programs should address innovations in one or more of the following areas: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Traceability in the food supply chain Life cycle assessment Nutritional requirements Reducing micronutrient deficiencies Food waste reduction Sustainable farming systems Food safety Scaling innovations in food supply chains Programs should be practical, interactive, and focused on real-world application. Who Can Apply Eligible Third Parties include: Research institutions and universities NGOs and industry partners Innovation hubs Business schools Vocational colleges Consortia across Africa and Europe ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Consortium applications are welcome, and women-led organizations are strongly encouraged to apply. Application Documents Applicants must carefully review and submit the required documentation included in the Open Call Kit: Official Open Call for Proposals publication notice Knowledge Transfer Call text Proposal template (to be submitted as a PDF) Declaration of Honour (mandatory) Consortium Agreement (mandatory for consortia) Declaration on double funding (signed at submission and project completion) ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Applicants are strongly advised to review all materials thoroughly before submission. Deadline Applicants should consult the official Open Call documentation for the final submission deadline and ensure timely submission of all required documents. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Contact Information For administrative questions related to the application process, applicants may contact: Email: STREAMING@bayfor.org Additional resources available: Click Here Appendices: Appendix 1 Open Call for Proposals Appendix 2 Knowledge Transfer Call Document Appendix 3 Proposal Template Appendix 4 Declaration of Honour Absence of Conflict of Interest Appendix 5 Consortium Agreement Appendix 6 Declaration on Double Funding for Recipients This Open Call represents a powerful opportunity to strengthen sustainable food systems, promote innovation, and empower women across Africa and Europe through digital knowledge transfer initiatives. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); For more Grant Opportunities: Click Here The post Open Call for Knowledge Transfer: €25,000 Grants for Digital Training in Sustainable Food Systems appeared first on Opportunities for Youth .","tags":["education","Grants","Africa","Europe"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"3061e5a338a167fbc52b3f6f15aa5564da81edb6","title":"UniPods AI Solutions for Africa Program 2026 – Fully Funded 12-Month AI Training & Innovation Journey","url":"https://opportunitiesforyouth.org/2026/02/22/unipods-ai-solutions-for-africa-program-2026-fully-funded-12-month-ai-training-innovation-journey/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T05:50:02Z","summary":"Africa Needs AI Built by Africans Applications Open for Phase 1 Applications are now open for the UniPods AI Solutions for Africa Program , a 12-month pan-African initiative designed to equip university students with practical artificial intelligence (AI) skills and support them in developing, prototyping, and launching impactful AI-powered solutions for Africa. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The program combines foundational training, advanced product development, incubation, and market launch support giving participants a full pathway from learning AI to building real-world solutions. What is the UniPods AI Solutions for Africa Program? The UniPods AI Solutions for Africa Program is a multi-stage learning and innovation journey that helps students transition from AI beginners to solution builders. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The program focuses on: Practical AI and data science skills Building solutions that address African challenges Product development and innovation Entrepreneurship and market readiness Participants progress through structured phases that move from training to implementation. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Program Structure 4 Phases Phase 1: Online Foundational AI Skilling Participants gain core AI skills through a certified online program delivered in collaboration with the University of Tokyo (GCI World course). This phase covers: Data science foundations Python programming Machine learning fundamentals Practical business applications of data ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); This phase serves as the entry point into the program. Phase 2: Advanced Hybrid Training Product Development Participants advance their technical skills while beginning to design and build real AI solutions with UniPod support. Key focus areas include: Applied AI development Problem-solving for African contexts Product prototyping Team collaboration ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Phase 3: In-Person Incubation Residency Selected participants join an intensive residency at the Addis Ababa AI UniPod , where they refine their solutions with mentorship and technical guidance. Phase 4: Market Take-Off Participants test, refine, and prepare their AI solutions for launch with continued UniPod support. This phase emphasizes: Market readiness Solution validation Scaling strategies Who Should Apply? The program is designed for: University students across Africa Beginners interested in AI and data science Students passionate about solving African challenges through technology Aspiring AI innovators and entrepreneurs ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); No advanced programming experience is required to start Phase 1. Why This Program Matters Africa s digital future depends on locally built solutions. This initiative aims to empower young African innovators to: Build AI solutions relevant to African realities Gain globally recognized technical skills Work on real-world innovation projects Move from learning to launching impactful products ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Phase 1 Foundational AI Training (University of Tokyo) The first phase is delivered online through the Global Consumer Intelligence (GCI World) course developed by the Matsuo-Iwasawa Lab at the University of Tokyo. Participants will learn: Introduction to data science Data cleaning and visualization Machine learning concepts SQL and feature engineering Time series analysis Real-world data applications The course includes weekly lectures, assignments, competitions, and final projects. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Program Benefits Participants will gain: Certified foundational AI training Practical hands-on experience Access to mentorship and incubation Opportunity to develop real AI products Potential pathway to launch solutions in African markets Important Deadline Phase 1 Application Deadline: March 2, 2026 Early application is strongly recommended. How to Apply Interested students can register for Phase 1 (Foundational AI Skilling) through the official application portal. Applicants will be guided through: Email registration Platform ID creation Verification of student status Enrollment in the GCI World course ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Final Thoughts The UniPods AI Solutions for Africa Program is more than an online course it is a complete innovation pathway designed to help African students move from learning AI to building real solutions that address local challenges. If you are a student passionate about technology, innovation, and Africa s future, this is a strong opportunity to begin your AI journey. Interested students can register for Phase 1 (Foundational AI Skilling) through the official application portal. The post UniPods AI Solutions for Africa Program 2026 – Fully Funded 12-Month AI Training Innovation Journey appeared first on Opportunities for Youth .","tags":["education","Africa","Short Courses"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"731dfe75d82becb05e4cd2544377a5d63c4dd2a5","title":"TaRL Africa Is Hiring: Country Regional Manager (Programs) – Kaduna, Nigeria | Apply by 3 March 2026","url":"https://opportunitiesforyouth.org/2026/02/21/tarl-africa-is-hiring-country-regional-manager-programs-kaduna-nigeria-apply-by-3-march-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-21T14:05:44Z","summary":"TaRL Africa is expanding its leadership team in Nigeria and is now hiring a Country Regional Manager (Programs) to drive regional scale, government partnership, and high-quality implementation of the Teaching at the Right Level (TaRL) approach. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); If you are an experienced program leader with a strong background in education systems reform, government engagement, and multi-state program management, this is an opportunity to lead transformative change at scale. Position: Country Regional Manager, Programs Location: Kaduna, Nigeria Reports to: Country Director, TaRL Africa Nigeria About TaRL Africa TaRL Africa is hosted by Empower Learning Africa, a not-for-profit organization headquartered in Nairobi, Kenya, with teams across C te d Ivoire, Nigeria, and Zambia. The initiative was launched in 2019 as a joint venture between Pratham and J- PAL. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); TaRL Africa partners with governments and organizations across more than 15 Sub-Saharan African countries to accelerate children s foundational skill acquisition using the evidence-based Teaching at the Right Level methodology. Together with partners, the initiative has reached over five million children. Our vision is for every child across Africa to have strong foundational skills that unlock lifelong opportunity. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); About the Role: Country Regional Manager (CRM) The Country Regional Manager (CRM) will lead and expand TaRL programming within a defined region in Nigeria. This role oversees implementation across multiple states, manages regional teams, strengthens partnerships with state governments, and ensures program delivery with fidelity, scale, and sustainability. As a key member of the Country Management Team, you will shape regional strategy, drive operational excellence, oversee budgets, and lead continuous program improvement. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); This position requires extensive travel within the region and occasional travel across Nigeria and Africa. Key Responsibilities 1. Program Leadership Partnership Management (40%) Strengthen technical implementation of the Teaching at the Right Level model. Ensure high-quality program delivery through data-informed decision-making. Provide oversight to state teams to maintain financial health and operational efficiency. Guide annual planning cycles and conduct periodic program reviews. Build strong, productive relationships with government stakeholders and community partners. Drive contextual program design aligned with regional needs. 2. Regional Strategy Scale (30%) Identify and execute strategic expansion opportunities across states. Promote government ownership and long-term sustainability. Translate regional priorities into coordinated work plans and budgets. Use needs assessments, stakeholder insights, and program data to refine strategy. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 3. Strengthening the TaRL Ecosystem (15%) Improve operational tools, systems, and accountability frameworks. Lead special innovation projects in collaboration with Programme Design, Pedagogy, and Monitoring, Learning Evaluation teams. Contribute to cross-state learning and organizational knowledge sharing. 4. Team Leadership Performance Management (15%) Build, mentor, and manage high-performing regional teams. Set clear performance goals and monitor progress. Foster accountability, ownership, and continuous professional development. Cultivate a collaborative and impact-driven team culture. Who We Are Looking For We are seeking a results-oriented leader with: Proven experience managing medium to large-scale education or development programs Strong stakeholder engagement experience with governments and donors Demonstrated ability to lead multi-state implementation Strategic planning and expansion expertise Budget oversight and financial management capability Strong analytical and data-driven decision-making skills Excellent written and verbal communication skills ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Minimum Qualifications Bachelor s degree in Public Policy, International Development, Education, or related field (Master s degree such as MPA or MPP preferred). At least six (6) years of experience managing medium to large-scale programs. Experience working with donors, policymakers, researchers, and government agencies. Strong proficiency in Excel, Word, PowerPoint, and Google Suite. Excellent communication skills. Why Join TaRL Africa? This is more than a job. It is a leadership opportunity to shape foundational learning outcomes for millions of children across Nigeria. You will: Influence education reform at scale Strengthen government systems for sustainable impact Lead high-performing teams across multiple states Contribute to a growing, mission-driven organization operating across Africa Play a key role in evidence-based education transformation ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); If you are ready to lead with purpose and deliver measurable impact, we encourage you to apply. Application Deadline: 3rd March 2026 APPLY HERE For more information on this job opportunity, click here . For more opportunities on jobs , click here . The post TaRL Africa Is Hiring: Country Regional Manager (Programs) – Kaduna, Nigeria | Apply by 3 March 2026 appeared first on Opportunities for Youth .","tags":["education","Africa","Jobs"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"5b98bb7fa3cde0551ea8c2e2f837b60d07d719ce","title":"Consilium Traineeships at the Council of the European Union 2026–2027: Paid EU Internship Opportunities in Brussels","url":"https://opportunitiesforyouth.org/2026/02/21/consilium-traineeships-at-the-council-of-the-european-union-2026-2027-paid-eu-internship-opportunities-in-brussels/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-21T10:23:38Z","summary":"Are you looking for a paid European Union traineeship that offers real experience inside EU institutions? The Consilium Traineeship Programme at the Council of the European Union provides young professionals with the opportunity to work directly with EU policy experts, gain institutional experience, and contribute to high-level decision-making processes. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Applications are now open for the upcoming traineeship cycle a highly competitive programme designed for ambitious graduates interested in European affairs, governance, law, policy, and international cooperation. What Are Consilium Traineeships? The Consilium traineeship programme offers first-hand exposure to how the Council of the European Union and its General Secretariat operate. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The name Consilium comes from the Latin word meaning counsel or deliberation , reflecting the Council s role in shaping EU decisions and supporting member states in policy coordination. As a trainee, you will: Gain practical experience within EU institutions Work alongside experienced advisors and policy professionals Contribute to the Council s daily activities Develop professional skills in an international environment Build networks across European institutions ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The programme is ideal for graduates interested in EU governance, policy-making, international relations, law, public administration, or related fields. Traineeships are paid and include allowances and other benefits. Around 110 traineeship positions are available each year. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Your traineeship: tasks, grants, allowances Paid Traineeship Benefits The Consilium traineeships are fully paid and include financial support designed to help trainees live and work in Brussels. Key benefits include: Paid monthly grant Additional allowances and benefits Professional training and mentoring Exposure to real EU policy work International multicultural working environment Approximately 110 traineeship positions are offered each year, making it one of the most attractive EU traineeship opportunities for early-career professionals. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Current Application Window (2026 Cycle) Applications are currently open for the next traineeship term. Important dates: Application deadline: 19 March 2026 (12:00 Brussels time) Traineeship period: 1 September 2026 31 January 2027 Location: Brussels, Belgium Applicants are encouraged to submit early to avoid last-minute technical issues. APPLY HERE Positive Action Programme for Trainees with Disabilities The Council reserves up to six traineeships per year for EU nationals with a recognised disability. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); This programme ensures inclusive participation by offering: Equal access to EU policy experience Special workplace arrangements when required Supportive and accessible working conditions Participants gain the same high-quality exposure to EU decision-making while benefiting from tailored accommodations. Apply for the positive action programme Positive action programme for trainees with a disability ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Who Can Apply? Consilium traineeships are open to EU citizens who meet specific eligibility criteria outlined by the Council. The programme targets: Young graduates and early-career professionals Candidates interested in EU affairs and policy Individuals seeking professional experience within EU institutions Applicants should review the official eligibility criteria before applying. Who can apply for a traineeship How to Apply for a Council Traineeship The application process is designed to be straightforward and fully online. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application steps: Check eligibility requirements Prepare required documents Complete the online application form Submit before the deadline The same procedure applies to both: Main traineeship programme Positive action programme for trainees with disabilities Applications are only open during specific periods each year, so timing is important. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); How to apply for a traineeship Online Information Session To help candidates better understand the programme, the Council is hosting an online information session. Details: Date: 9 March 2026 Time: 14:00 15:00 (Brussels time) Format: Online presentation + Q A Registration: No prior registration required This session is highly recommended for applicants who want insider guidance on the application process. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); No prior registration needed. Follow our info session about Consilium traineeships Consilium Traineeship Calendar The Council offers traineeships twice per year . February June Traineeship Applications: August September Selection interviews: October December Traineeship period: 1 February 30 June September January Traineeship Applications: February March Selection interviews: April June Traineeship period: 1 September 31 January Understanding the cycle helps candidates plan applications well in advance. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Traineeships for Students of National Administration Schools In addition to the general programme, the Council also offers specialised traineeships for students enrolled in national administration schools. Key features: Duration: 2 to 5 months Focus on EU processes and institutional policy Designed to strengthen administrative and governance expertise Frequently Asked Questions Candidates can consult the official FAQ section for detailed guidance on: ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Eligibility requirements Application documents Selection process Working conditions Financial support Reviewing the FAQ before applying can help strengthen your application. More questions? Check our FAQ to find the answers to most recurrent questions. ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); Traineeships: frequently asked questions Why Apply for a Consilium Traineeship? A traineeship at the Council of the European Union offers more than work experience it provides direct exposure to the heart of European policy-making. Key reasons to apply: Gain practical EU institutional experience Build an international professional network Strengthen your CV for careers in policy, diplomacy, or development Work in Brussels, one of Europe s key political hubs Learn how EU decisions are shaped in real time ezstandalone.cmd.push(function () { ezstandalone.showAds(139); }); For young professionals aiming to build a career in European or international affairs, this programme is a powerful stepping stone. Final Tip for Applicants Strong applications clearly demonstrate: Interest in EU affairs Relevant academic or professional background Motivation to contribute to European policy work Ability to work in multicultural environments Prepare your documents early and submit before the deadline to maximise your chances. ezstandalone.cmd.push(function () { ezstandalone.showAds(140); }); APPLY HERE Source : European Council The post Consilium Traineeships at the Council of the European Union 2026–2027: Paid EU Internship Opportunities in Brussels appeared first on Opportunities for Youth .","tags":["education","Internships","Europe","Jobs"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"8eee00c180a3e987ef57a9713fe706838258782e","title":"AFAS Master’s Scholarship Programme 2026–2028: Fully Funded Fellowship in Nature-Based Solutions, Climate Change Adaptation & Biodiversity Conservation in African Savannas","url":"https://opportunitiesforyouth.org/2026/02/21/afas-masters-programme-2026-2028-fully-funded-fellowship-in-nature-based-solutions-climate-change-adaptation-biodiversity-conservation-in-african-savannas/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-21T09:32:21Z","summary":"Applications are now open for the AFAS Master s Fellowships 2026 intake , offering fully funded opportunities for young African scholars to pursue advanced studies focused on Nature-based Solutions (NbS), climate change adaptation, and biodiversity conservation across African savanna landscapes. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This highly competitive programme is designed for motivated graduates who want to bridge science, policy, and practice and contribute to real-world environmental solutions across Africa. Application deadline: 31 st March 2026 Applicants may apply to either the University of Nairobi (UoN), Nairobi, Kenya, or Universit F lix Houphou t-Boigny (UFHB), Abidjan, C te d Ivoire , BUT NOT BOTH There is a simultaneous call for master fellowships at CABES , a project closely linked to AFAS . Applicants can only apply to either the CABES or AFAS master programme BUT NOT BOTH ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); About the AFAS Master s Programme The African Climate and Environment Centre Future African Savannas (AFAS) is a part of the Global Centers for Climate and Environment program of the German Academic Exchange Service (DAAD). AFAS is a partnership of four universities: the University of Nairobi (UoN), Universit F lix Houphou t-Boigny (UFHB), the University of Cologne, and the University of Bonn. The program is based at the University of Nairobi through its Institute for Climate Change and Adaptation (ICCA) in Nairobi, Kenya, and at the Universit F lix Houphou t-Boigny through its African Centre of Excellence on Climate Change, Biodiversity and Sustainable Agriculture (CEA-CCBAD) in Abidjan, C te d Ivoire. The African Climate and Environment Centre Future African Savannas (AFAS) is part of the DAAD Global Centers for Climate and Environment Programme . AFAS brings together a consortium of leading institutions: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); University of Nairobi (Kenya) Universit F lix Houphou t-Boigny (C te d Ivoire) University of Cologne (Germany) University of Bonn (Germany) The programme is hosted at: Institute for Climate Change and Adaptation (ICCA) University of Nairobi ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); African Centre of Excellence on Climate Change, Biodiversity and Sustainable Agriculture (CEA-CCBAD) UFHB AFAS trains graduates to connect research with policy and practice while engaging directly with stakeholders, communities, NGOs, and decision-makers. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Programme Focus Areas AFAS Phase 2 (2026 2030) builds on earlier success and emphasizes implementation, stakeholder engagement, and real-world impact. The programme focuses on: Nature-based Solutions (NbS) Science Policy Practice Interface (SPPI) Climate change adaptation Ecosystem conservation in African savannas For their Master s thesis, fellows will select one primary thematic area : ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Water Agriculture Energy One Health Biodiversity Applicants must explain their thematic preference in their motivation and reflection statement. Fellowship Overview (2026 Intake) AFAS will award 18 fully funded Master s fellowships across its two host universities. Selected fellows will: Enroll in an AFAS-aligned Master s programme Participate in joint courses and hybrid modules Receive soft-skills training Conduct demand-oriented research on Nature-based Solutions Engage with policy actors and practitioners Complete a Master s thesis linked to real-world challenges ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Language of instruction: English What the Fellowship Covers The AFAS fellowship provides comprehensive support, including: Full tuition fees Monthly stipend (local currency equivalent) Health insurance Laptop computer Individual research budget (after proposal approval) Participation in summer schools, workshops, and exchange activities Funding continuation depends on satisfactory academic progress and engagement. Who Should Apply This is not a conventional academic scholarship. AFAS seeks applicants who demonstrate: Critical and independent thinking Strong motivation and reflection Ability to connect environmental challenges with practical solutions Clear personal insight and contextual understanding ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Applications that rely on generic or scripted responses may be disadvantaged. Selection Process Selection is competitive and conducted in multiple stages: Eligibility screening Qualitative review of motivation statements Shortlisted interviews assessing reasoning and alignment with AFAS Final selection (subject to admission at host university) Host University Options Applicants may apply to ONE host institution only. 1. University of Nairobi (UoN), Kenya Candidates willing to apply must have: Concluded a Bachelor s or equivalent degree in environmental and/or agricultural sciences or biology, ecology and climate sciences, economics, sociology, or any other relevant discipline. Must have a minimum second-upper honors degree or equivalent approved by Kenya s Commission for University Education ( CUE ) Must not be older than 26 years on the 2 nd of October 2026 . Must be willing to be a single/individual resident in the student s residence recommended by the University of Nairobi for the duration of the program. This is a fulltime assignment which requires physical presence and outside work is not permitted for the duration of the fellowship. Applicants from universities which do not use English as a language of instruction should provide evidence of English proficiency in the form of a certificate of IELTS or TOEFL or equivalent demonstrating a satisfactory level of competence. University Certified Diplomas/Bachelors/Masters certificates (if not in English , please provide official English translation from/or certified by the university). Note: In certain cases, further verification may be required from Kenya s Commission for University Education (see below). Before applying for the scholarship, applicants are expected to visit the University of Nairobi website https://www.uonbi.ac.ke and the Department of Earth and Climate Sciences website http://earthclimatesciences.uonbi.ac.ke to confirm their eligibility for admission and get more details on the program, respectively. At UoN, selected candidates will immediately be required to seek admission to the University of Nairobi master s program in Climate Change Adaptation through the University website https://application.uonbi.ac.ke/ . An application fee (approximately USD 50) will be charged which is non-refundable . A passport is required for non-Kenyan citizens. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); 2. Universit F lix Houphou t-Boigny (UFHB), C te d Ivoire Eligibility Highlights: Concluded a Bachelor s or equivalent degree in environmental and/or agricultural sciences or biology, ecology and climate sciences, economics, sociology, or any other relevant discipline. The required university degrees must have been awarded by a university or a higher education institution officially recognized by the African and Malagasy Council for Higher Education ( CAMES ). Must not be older than age 26 years on the 2 nd of October 2026 . Be willing to be a single/individual resident on the campus of P le Scientifique et d Innovation de l UFHB for the full duration of the program. This is a full-time assignment which requires physical presence and outside work is not permitted for the duration of the fellowship. UFHB applicants from Central and Western Africa are encouraged to apply. University Certified Diplomas/Bachelors/Masters certificates. All certified documents not issued in French must be accompanied by an official French translation. Applicants from French-language academic backgrounds are asked to provide official evidence of English language proficiency, in the form of an IELTS or TOEFL certificate or equivalent demonstrating a satisfactory level of competence. A passport is required for non-citizens of the Economic Community of West African States (ECOWAS). Required Application Documents (Single PDF Submission) Motivation Reflection Statement (max. 1000 words, 1.5 space, 11 Calibri) Applicants must respond explicitly to the following prompts: Which ONE of the five thematic areas would you like to do research on: water, agriculture, energy, One Health and biodiversity? Motivate your choice with a short research idea in max. 250 words? Which other ONE of the five thematic areas could also be of interest to you (one sentence; no motivation needed)? What concrete environmental or development challenge motivates you personally? How do you understand Nature based Solutions in your own context? Describe one real example (project, policy, community practice, or observation) that shaped your interest. How do you see yourself engaging with policy or practice actors, not only actors from academia? What skills or perspectives do you hope to develop during AFAS Phase 2? ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Curriculum Vitae (max. 2 pages) University Certified Diplomas/Bachelors/Masters certificates (see details above). University Certified Transcripts of academic records (see details above). Two duly signed letters of recommendation , including the full contact details of the referees (at least one of the letters must be issued by a member of staff of the institution that awarded the most recent degree). Proof of English proficiency (if applicable) Birth certificate A recent passport photo Motivation Reflection Statement Prompts Applicants must address: Preferred thematic research area and short research idea (max. 250 words) ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Secondary thematic interest Personal environmental or development motivation Understanding of Nature-based Solutions in context Real-life example influencing interest Engagement with policy or practice actors Skills and perspectives to develop during AFAS Phase 2 Important Application Notes Applicants may apply to either AFAS or CABES , not both. Applicants may apply to either UoN or UFHB , not both. ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Only shortlisted candidates will be contacted for interviews. For technical questions, contact: info@afas.africa Why This Opportunity Matters The AFAS Master s Fellowship is ideal for young professionals and graduates interested in: Climate change adaptation in Africa Biodiversity conservation Nature-based Solutions research Environmental policy and practice Sustainable development careers ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); By combining academic excellence with practical engagement, AFAS prepares future leaders to address complex environmental challenges across African savannas. How to Apply Applications are open now for the 2026 2028 intake . APPLY HERE FOR MORE INFORMATION PLEASE CLICK HERE Deadline: 31 March 2026 Interested applicants should prepare their documents early and submit a strong, reflective application demonstrating real-world understanding and motivation. The post AFAS Master’s Scholarship Programme 2026–2028: Fully Funded Fellowship in Nature-Based Solutions, Climate Change Adaptation Biodiversity Conservation in African Savannas appeared first on Opportunities for Youth .","tags":["education","Master","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"f89f9a3fb2a062cd3f736795d7af1d787fa15b4f","title":"Inter-American Development Bank (IDB) Internship Program 2026: Paid Global Internships for Students & Recent Graduates | Complete Guide","url":"https://opportunitiesforyouth.org/2026/02/21/2025-summer-internship-opportunities-at-inter-american-development-bank-idb-undergraduate-and-graduate/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-21T01:34:59Z","summary":"The Inter-American Development Bank (IDB) Internship Program offers a unique opportunity for students and recent graduates to gain hands-on experience in international development, finance, research, policy, and innovation. Through paid internships at IDB, IDB Invest, and IDB Lab , participants work alongside global experts and contribute to projects that improve lives across Latin America, the Caribbean, Asia, and Europe. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); If you are looking to launch your international career with a respected multilateral organization, this guide explains everything you need to know from eligibility requirements to application tips. Why Choose the IDB Internship Program? The IDB internship program is designed to help students and young professionals: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Gain practical experience in international development Work on real projects with global impact Build professional networks across regions Learn about development finance and policy Experience the organizational culture of the IDB Group Interns work directly with teams at IDB Headquarters in Washington, D.C., or in country offices worldwide, with occasional teleworking flexibility depending on the role. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Types of Internship Opportunities 1. Internships at IDB Headquarters (Washington, D.C.) Interns at headquarters support teams delivering operational and corporate solutions to public and private sector clients. Program Structure Duration: 2 months Work schedule: Full-time (40 hours per week) Format: On-site with some flexibility ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Internship Cycles Winter Internship: January 16 March 15 Summer Internship: June 16 August 15 Applications typically open 3 4 months in advance . Important Note: Applicants may apply for a maximum of three internship positions . 2. Internships at Country Offices (COFs) The IDB has offices across Latin America and the Caribbean, as well as Asia and Europe. These internships are designed to strengthen local development capacity while helping interns build careers in their own regions. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Key Features Duration: 2 to 6 months (based on business needs) No fixed cohort timeline Continuous recruitment throughout the year Eligibility Requirement You must be: A citizen or legal resident of the country where the office is located, or Hold a valid work permit and reside in that country. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Fields of Study in Demand The IDB welcomes students from diverse academic backgrounds, including: Business and Finance Communications and Marketing Data and Technology Economics and Research Environmental Studies Humanities and Social Sciences Law and Policy Linguistic Services Basic Eligibility Requirements To qualify for the IDB Internship Program, applicants must meet the following criteria: ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Citizenship Washington, D.C. internships: Must be a citizen of one of IDB s 48 member countries Country Office internships: Must be a citizen or legal resident of the country where applying IDB Invest roles: No citizenship restrictions ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Academic Status Active undergraduate student (minimum second year), or Graduate student with at least 50% of coursework completed Availability Must be available to work full-time (40 hours per week) ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Additional Requirements Must not have relatives working at IDB, IDB Invest, or IDB Lab Internship must be your first job within the IDB Group ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Required Documents Applicants must prepare the following documents: Updated Resume (CV) University Enrollment Letter (issued within the last 3 months) Academic Transcripts (official or unofficial; issued within the last 3 months) Note: If you advance in the recruitment process, official transcripts may be required. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); How to Apply for IDB Internships Step 1: Online Application Complete the application form and upload your CV in English or Spanish. A cover letter is only required if specified in the job posting. Pro Tips Read the job description carefully Tailor your CV to match the role Keep your resume concise and results-focused Step 2: Assessment Interview If shortlisted, you may be invited to: Complete a technical assessment Attend a formal panel interview with IDB staff ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Pro Tips Follow instructions carefully during assessments Practice interview responses beforehand Be clear, authentic, and concise in your answers Step 3: Final Decision Recruitment timelines may vary. The IDB provides estimated timelines and applicants can follow up with HR for updates. If you are not selected, you are encouraged to apply again as new positions open regularly. ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); Visa Information for International Applicants For internships at headquarters in Washington, D.C., the IDB supports eligible candidates with G4 Visa processing . Key points: Available to non-U.S. citizens and non-permanent residents Eligible dependents may also receive G4 visas Dependents may apply for U.S. work authorization Employees must live within 50 miles of headquarters Visa approval remains at the discretion of the U.S. Department of State. ezstandalone.cmd.push(function () { ezstandalone.showAds(139); }); What It s Like to Be an IDB Intern Interns often highlight: Exposure to international development projects Networking with global teams Opportunities to contribute to regional impact Professional growth and career clarity Many interns describe the program as a stepping stone into careers in international organizations, development finance, and policy. Frequently Asked Questions (FAQs) How long does the application process take? The process may take several weeks or months depending on the role. ezstandalone.cmd.push(function () { ezstandalone.showAds(140); }); Do I need a cover letter? Only if requested in the specific job posting. Does the IDB hire globally? Yes. The IDB recruits for headquarters and country offices worldwide. Are there eligibility restrictions? Yes. Citizenship requirements apply for most positions, except some roles at IDB Invest. ezstandalone.cmd.push(function () { ezstandalone.showAds(141); }); The IDB Internship Program is a strong opportunity for students and recent graduates who want to build careers in international development, economics, finance, and public policy. With paid placements, global exposure, and meaningful project work, the program provides a solid foundation for future leadership in development. If you are serious about building a global career, prepare your documents early, tailor your CV carefully, and apply strategically. Apply Learn More For full program details and available internship opportunities, visit the official IDB careers platform and explore open positions regularly. ezstandalone.cmd.push(function () { ezstandalone.showAds(142); }); For a detailed list of available positions and Application, click HERE . Apply Now Don t miss this opportunity to gain hands-on experience in international development. Visit our official website to submit your application before the deadline. For further inquiries or accommodations, contact us at diversity@iadb.org . The post Inter-American Development Bank (IDB) Internship Program 2026: Paid Global Internships for Students Recent Graduates | Complete Guide appeared first on Opportunities for Youth .","tags":["education","America","Europe","Internships","Jobs","Latin America and the Caribbean","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"3d10b2733aaf602a25964eae467a4b361dfd1cb2","title":"2026 MILEAD Fellows Program for Young African Women Leaders (Applications Open)","url":"https://opportunitiesforyouth.org/2026/02/20/2026-milead-fellows-program-for-young-african-women-leaders-applications-open/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-20T20:52:55Z","summary":"Application Deadline: Friday, March 20, 2026 Applications are now open for the 2026 MILEAD Fellows Program , a leadership development initiative designed to support and empower young African women leaders committed to driving positive change across the continent. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); For over a decade, the MILEAD Fellows Program has equipped emerging leaders with the knowledge, skills, and networks needed to challenge inequality, advance women s leadership, and implement community-driven solutions. About the MILEAD Fellows Program The MILEAD (Moremi Initiative Leadership and Empowerment Development) Fellows Program is a long-term leadership development initiative focused on identifying and nurturing promising young African women leaders. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The program aims to: Build leadership capacity among young African women Strengthen knowledge, skills, and values for 21st-century leadership Create a supportive ecosystem for women s leadership across Africa Connect emerging leaders with influential African mentors and changemakers Each year, 25 outstanding young women are selected based on their leadership potential and commitment to making a difference in their communities or professional fields. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Program Structure and Key Features The program combines leadership training, mentoring, experiential learning, and community engagement. Key components include: A three-week residential Summer Institute in Ghana Intensive leadership and personal development training Mentorship from established African leaders Access to the MILEAD leadership network Ongoing support and lifelong peer solidarity ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); A distinguishing feature of the program is the MiCHANGE Community Project , where each fellow designs and leads a community-based initiative addressing issues affecting women and girls. Eligibility Criteria Applicants should meet the following requirements: Be a young African woman aged 19 25 Demonstrate leadership potential or experience Show commitment to addressing issues affecting women and girls in Africa Be interested in developing transformational leadership skills Be available to participate in the three-week residential Summer Institute in Ghana ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Selected candidates may be full-time students or professionals during the program, except during the residential institute period. Application Requirements Applicants must submit: Completed application form Updated CV Two recommendation letters ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); All application materials must be submitted via email. Email: Fellows@moremiinitiative.org Applicants are strongly encouraged to carefully review the program and application guidelines before submitting. Application Resources Download the full 2026 Application Package ( Application Pack | Recommendation-Form ), and share this opportunity with other inspiring emerging African women leaders in your network. Stay updated: follow us @MoremiAfrica #MILEADFellows #MILEAD2026 EMAIL: Fellows@moremiinitiative.org | TEL: +233 530 429 644 Why Apply? The MILEAD Fellows Program is designed to build a pipeline of African women leaders equipped to drive systemic change. Fellows benefit from: ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); High-quality leadership training Practical experience through community projects Exposure to experienced African leaders and mentors A lifelong network of women leaders across Africa The program emphasizes long-term impact by integrating leadership development with real-world community engagement. Contact and Updates For more information: Website: www.moremiinitiative.org Facebook: /MoremiAfrica Twitter/X: @MoremiAfrica Email: Fellows@moremiinitiative.org Tel: +233 530 429 644 ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); The 2026 MILEAD Fellows Program offers an important opportunity for young African women who are ready to strengthen their leadership skills and contribute meaningfully to social change across the continent. Interested candidates should submit their applications before March 20, 2026 . Find out more https://moremiinitiative.org/2026-milead-fellows-program-announcement/ The post 2026 MILEAD Fellows Program for Young African Women Leaders (Applications Open) appeared first on Opportunities for Youth .","tags":["education","Africa","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-22T18:42:20Z","updated_at":"2026-02-22T18:42:20Z"}
{"id":"7c5608d4a453c43ef9e6cab6401d81aceb2febf8","title":"FAO EYPA Mentorship Journey Launches Phase II to Empower Young Women Farmers Across Africa","url":"https://opportunitiesforyouth.org/2026/02/20/fao-eypa-mentorship-journey-launches-phase-ii-to-empower-young-women-farmers-across-africa/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-20T20:28:20Z","summary":"The Empowerment of Young Women Farmers in Africa through Inclusive Mentorship Programme (EYPA) is officially launching Phase II , marking a major step forward in supporting young women in agriculture across Africa. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Building on the success of its pilot phase, the programme is being implemented through a renewed partnership between the Food and Agriculture Organization (FAO) and the Pan-African Farmers Organization (PAFO) . This new phase places a strong focus on young women farmers , aiming to strengthen leadership, entrepreneurship, and economic opportunities within Africa s agrifood systems. What is EYPA Phase II? The first phase of the EYPA Programme s Mentorship Programme is designed to provide inclusive mentorship, capacity building, and professional networking opportunities for young women working in agriculture. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Phase II will scale up the successful mentorship model developed during the pilot stage by addressing gender-specific challenges that often limit women s participation and leadership in agrifood systems. Through this initiative, participants will gain: Tailored mentorship from experienced professionals Capacity-building activities and training sessions Networking opportunities across regions Skills development for agribusiness growth Increased confidence and leadership capacity ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The programme also supports the goals of the International Year of the Woman Farmer (IYWF 2026) by promoting women s economic empowerment and closing gender gaps in agriculture. Call for Expression of Interest Now Open A Call for Expression of Interest has been launched to recruit both mentors and mentees for the programme. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Application Deadline: Friday, 6 March 2026 Find the call for mentees here Find the call for mentors here Up to 50 young women farmers from different regions across Africa will be selected to participate in this phase. What Participants Will Gain EYPA Phase II aims to unlock the potential of young women leaders and innovators by equipping them with practical and business-focused skills, including: Financial literacy and business planning Organizational and leadership skills Market access and value chain understanding Agribusiness development strategies Professional mentorship and peer learning ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); By strengthening these competencies, the programme contributes to the broader transformation of Africa s agrifood systems and supports sustainable economic growth. Regional Pitching Sessions and Final Competition Following the structure of the pilot phase, the mentorship journey will culminate in regional pitching sessions where mentees will present their agribusiness ideas and business models. Participants will showcase: Business and financial models Innovation and sustainability approaches Social and economic impact of their ventures ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Finalists demonstrating strong pitching skills will advance to a final pitching competition hosted at the PAFO Headquarters in Kigali, Rwanda . During the final event, selected mentees will: Present their agribusiness progress Showcase outcomes from the mentorship journey Compete for two cash prizes Strengthening Youth and Women Leadership in Agriculture The EYPA Mentorship Programme reflects the shared commitment of FAO and PAFO to building youth leadership and empowering women in agriculture. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Implemented under a broader Memorandum of Understanding (MoU) collaboration, Phase II represents a strategic effort to equip young women farmers with the tools, knowledge, and opportunities needed to thrive in modern agrifood systems. By investing in mentorship and capacity development, EYPA aims to nurture the next generation of agricultural leaders driving innovation and sustainability across Africa. The launch of EYPA Phase II signals a powerful opportunity for young women farmers to strengthen their skills, grow their agribusinesses, and expand their professional networks. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); For aspiring women leaders in agriculture, this programme offers a unique platform to learn, connect, and showcase innovation on a continental stage. The post FAO EYPA Mentorship Journey Launches Phase II to Empower Young Women Farmers Across Africa appeared first on Opportunities for Youth .","tags":["education","Africa","Volunteering"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-21T22:36:34Z","updated_at":"2026-02-21T22:36:34Z"}
{"id":"26c17fb641a958b23333c934a1c5779197e4f36a","title":"European Forum Alpbach Scholarship Programme 2026 (EFA26) | Fully Funded Opportunity for Global Youth","url":"https://opportunitiesforyouth.org/2026/02/20/european-forum-alpbach-scholarship-programme-2026-efa26-fully-funded-opportunity-for-global-youth/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-20T19:26:32Z","summary":"The European Forum Alpbach Scholarship Programme 2026 is now open for applications, offering a fully funded opportunity for students, young professionals, and emerging leaders from around the world to participate in one of Europe s most prestigious interdisciplinary forums. Held annually in the Austrian Alps, the European Forum Alpbach (EFA) brings together future changemakers, policymakers, researchers, and innovators to exchange ideas, build leadership skills, and shape solutions for Europe and the world. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This scholarship programme is designed for first-time participants who want to gain international exposure, expand their networks, and engage in high-level dialogue across sectors. About the European Forum Alpbach Scholarship Programme Every year, hundreds of young talents travel to Alpbach to take part in a unique two-week experience that combines academic learning, policy dialogue, and cross-cultural exchange. Scholarship holders are at the heart of the Forum and are the only participants who remain for the full duration of the event. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The programme includes: Scientific, competence-based, and artistic seminars and studios High-level conferences with global decision-makers and experts Leadership and skills development sessions Interdisciplinary discussions and networking opportunities Social and cultural activities designed to foster collaboration Approximately 350 scholarships are awarded annually by the European Forum Alpbach and the Forum Alpbach Network (FAN). ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Application Dates for EFA Scholarship 2026 Applicants should take note of the official application period: Applications open: 2 March 2026 Application deadline: 22 March 2026 (11:59 PM CET) Due to the competitive nature of the programme, early preparation is strongly recommended. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Why Apply for the European Forum Alpbach Scholarship? The EFA Scholarship Programme offers more than financial support. It provides an immersive leadership experience that helps participants grow professionally and personally while engaging with some of the most pressing issues facing Europe and the world. Key benefits include: Full participation in the European Forum Alpbach event Access to influential policymakers, academics, and industry leaders International networking with peers from diverse backgrounds Opportunities for leadership development and interdisciplinary learning Long-term connection to a global alumni community EFA as a Lifelong Community Participation in the European Forum Alpbach does not end after the event. Scholarship holders become part of the Forum Alpbach Network (FAN), a strong international alumni community dedicated to promoting dialogue and cooperation across borders. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); The network includes: 34 alumni initiatives Representation across 20 countries Year-round events and collaboration opportunities A growing community committed to shaping a better Europe How to Apply for the EFA Scholarship Programme Applicants can submit their applications through two pathways depending on their regional affiliation. Applications will be open from 2-22 March 2026 (2 pm 11:59 pm CET) Application via the Forum Alpbach Network (FAN) Applicants with nationality or residency ties to specific FAN clubs must apply through their respective alumni club. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); FAN clubs with separate scholarship selection processes include: These are the FAN clubs who offer EFA-scholarships and have a separate selection process: CA Burgenland , CA Liechtenstein , CA Nieder sterreich , CA Poland, CA Upper Austria , CA Salzburg , CA Senza Confini (Carinthia, Northern Italy and Slovenia), CA Steiermark , CA S dtirol Alto Adige , CA Tirol , CA Vorarlberg , IG Wien . Applicants should consult the relevant FAN club website for detailed requirements and deadlines. Application via the European Forum Alpbach (EFA) If there is no FAN club in your country, or your local club does not have its own selection process, you may apply directly via the EFA online application platform. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Important application rules: The scholarship is open to international applicants worldwide, with a special focus on Europe outside Austria Applications must be submitted through the official online portal Incomplete applications will not be accepted Applications submitted by email will not be considered Missing documents submitted after the deadline will not be reviewed ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Special note: Nationals or permanent residents of ROC Taiwan must apply via the Lung Yingtai Cultural Foundation. Documents Required for the Application Applicants should prepare all required documents before beginning the application process. Ensuring completeness and accuracy is essential, as incomplete applications may be automatically rejected. Disqualification Policy and Use of AI The organisers clearly state that applications may be disqualified if: ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Minimum eligibility criteria are not met The letter of motivation is generated using artificial intelligence Applicants are encouraged to submit authentic and original application materials. Q A Webinars for Applicants To support prospective applicants, the organisers are hosting official Q A webinars where participants can speak directly with the scholarship team. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Webinar schedule: Do you still have questions? Sign up for one of our Q A webinars on the EFA26 scholarship programme and talk directly to the organisers. Webinar #1 Thursday, 26 February 2026 5:30 pm 6:30 pm (CET). Register here. Webinar #2 Wednesday, 4 March 2026 5:30 pm 6:30 pm (CET). Register here. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Webinar #3 Tuesday, 17 March 2026 9:30 am 10:30 am (CET). Register here. Contact Information For additional questions about the scholarship programme: Email: scholarships@alpbach.org Contact person: Melissa N met, Unit Communities, Stakeholder Manager, Scholarship Programme ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Who Should Apply? The European Forum Alpbach Scholarship Programme is ideal for: Students and recent graduates Young professionals and early-career leaders Researchers and policy enthusiasts Social impact practitioners and civic leaders Youth changemakers interested in global dialogue and European affairs Applications will be open from 2-22 March 2026 (2 pm 11:59 pm CET) The European Forum Alpbach Scholarship Programme 2026 is a highly competitive, fully funded opportunity for young leaders seeking international exposure, meaningful dialogue, and long-term professional growth. With access to influential networks, interdisciplinary learning, and a vibrant alumni community, the programme offers a powerful platform for those ready to contribute to shaping the future of Europe and beyond. The post European Forum Alpbach Scholarship Programme 2026 (EFA26) | Fully Funded Opportunity for Global Youth appeared first on Opportunities for Youth .","tags":["education","Europe","Conferences"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-21T22:36:34Z","updated_at":"2026-02-21T22:36:34Z"}
{"id":"5cc5d3efd8bd3c82a1a8a6bb5940b6a1457c1d42","title":"LinkedIn Future of Work Fund 2026: Global AI Workforce Grant Supporting Nonprofits Preparing Young Adults for the AI Economy","url":"https://opportunitiesforyouth.org/2026/02/20/linkedin-future-of-work-fund-2026-global-ai-workforce-grant-supporting-nonprofits-preparing-young-adults-for-the-ai-economy/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-20T17:10:30Z","summary":"The LinkedIn Future of Work Fund 2026 is a global philanthropic grant initiative designed to help nonprofit organizations prepare young people for a rapidly changing labor market shaped by artificial intelligence. As automation and AI technologies continue transforming industries, LinkedIn is expanding its commitment to economic inclusion by funding organizations that help young adults successfully transition into an AI-powered workforce. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The 2026 edition builds on LinkedIn s first year of funding nonprofit innovators worldwide and introduces an expanded funding round combining financial grants and in-kind support resources. The program focuses specifically on young adults facing structural barriers to employment and aims to ensure that technological transformation does not widen inequality. Why the Future of Work Fund Matters Artificial intelligence is not just creating new jobs; it is reshaping nearly every existing one. According to LinkedIn projections, approximately 70% of the skills required for jobs will change by 2030. This means traditional career preparation models are becoming outdated. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The challenge is not simply training people to use technology. Instead, the workforce now requires a combination of: AI fluency and digital capability Critical thinking and adaptability Communication and collaboration Problem-solving in uncertain environments ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Many young adults particularly those from underserved backgrounds lack access to training and opportunities that help them adapt to this shift. The Future of Work Fund exists to support organizations solving exactly this problem. What the Fund Supports The fund provides both financial grants and in-kind support to nonprofit organizations delivering programs that expand economic opportunity in an AI-driven labor market. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Key Focus Areas Organizations applying must demonstrate a clear and practical approach to at least one of the following: 1. Preparing Young Adults for AI-Driven Careers Programs that teach AI literacy, digital skills, and workforce readiness for modern job markets. 2. Improving Job Access Initiatives helping career starters connect with employment opportunities using technology and AI-enabled pathways. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 3. Supporting Workforce Success Training that helps young workers thrive after employment through adaptability, communication, and lifelong learning skills. 4. System-Level Workforce Innovation Projects influencing how education systems, training institutions, or employers integrate AI workforce preparation. What LinkedIn Means by AI Innovation LinkedIn is not only interested in teaching technical coding skills. Instead, the fund prioritizes organizations that combine technological learning with human capabilities. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Supported initiatives typically include: AI-fluency training programs Career navigation tools powered by AI Skills-matching platforms Job readiness pathways Human-skill development (communication, collaboration, adaptability) Alternative credential programs Who the Fund Aims to Help The program focuses on young adults entering the workforce who face employment barriers. These may include: Individuals from low-income communities First-generation professionals Learners outside traditional university pathways Underemployed youth Career starters without professional networks ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Typical target age range: 18 24 (varies by country) Eligibility Requirements for Organizations To qualify, applicants must meet all of the following conditions. Organizational Status Must be a legally registered nonprofit, charity, or equivalent not-for-profit organization U.S. organizations must hold 501(c)(3) status Must be able to directly receive grant funding ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Program Focus Organizations must demonstrate: Workforce development programming Clear use of AI innovation OR preparation for AI workforce transition Support for young adults facing economic opportunity barriers Organizations not meeting these requirements are encouraged to use LinkedIn s free nonprofit resources instead. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Funding and Support Structure Selected organizations receive a combination of monetary and strategic assistance. Financial Support Cash grant funding for program implementation and expansion. In-Kind Support Access to LinkedIn expertise Workforce insights and data Platform resources Strategic guidance This hybrid model helps organizations scale impact beyond traditional grants. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Evaluation Criteria Applications are reviewed based on: Demonstrated impact potential Clarity of AI integration Capacity to support underserved young adults Scalability of program model Alignment with economic inclusion goals Application Deadline March 15, 2026 at 12 PM PT Submit your application HERE . Visit the LinkedIn Social Impact website HERE for more details. Click HERE to discover more grant opportunities. The post LinkedIn Future of Work Fund 2026: Global AI Workforce Grant Supporting Nonprofits Preparing Young Adults for the AI Economy appeared first on Opportunities for Youth .","tags":["education","Grants","Africa","America","Asia","Australia and Oceania","Continent","Europe","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-21T22:36:34Z","updated_at":"2026-02-21T22:36:34Z"}
{"id":"d84b8ba73ecfcd4a1ee39cee5cf1c259c5b89781","title":"Apply for SCEG Caribbean Economic Growth Grants 2026 – Mercy Corps Funding Opportunity","url":"https://opportunitiesforyouth.org/2026/02/20/apply-for-sceg-caribbean-economic-growth-grants-2026-mercy-corps-funding-opportunity-2/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-20T15:56:14Z","summary":"The Mercy Corps Strengthening Caribbean Economic Growth (SCEG) Program has launched a Small Grants Challenge aimed at supporting organizations driving sustainable economic development across the Caribbean. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Through this funding opportunity, up to 12 organization s will receive grants of up to $50,000 USD each to implement impactful, locally driven projects that strengthen livelihoods, businesses, and economic systems in the region. About the SCEG Small Grants Challenge The SCEG initiative is designed to accelerate inclusive economic growth by empowering organisations working to: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Expand employment opportunities across key sectors Strengthen micro, small, and medium enterprises (MSMEs) Improve access to market-driven inputs, services, and business support systems ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); This program prioritizes practical, scalable solutions that can create measurable economic impact within a 12-month project period . Why Apply? This grant offers a powerful opportunity to: Access funding to scale your economic impact Strengthen local business ecosystems and employment Partner with an internationally recognized development organization Deliver measurable results that support long-term economic resilience ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Who Can Apply? This opportunity is open to registered organisations that are based in or operating within the following Caribbean countries: Barbados The Bahamas Grenada Jamaica Saint Kitts and Nevis Organisations may include NGOs, social enterprises, private sector actors, and development-focused institutions that align with the program s goals. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Grant Value and Duration Grant amount: Up to $50,000 USD per organisation Number of awards: Up to 12 grantees Project duration: Maximum of 12 months Key Dates Application Open: February 9, 2026 Application Deadline: February 23, 2026 (11:59 PM AST) How to Apply Interested organisations can submit their applications HERE Opportunity Summary Category Details Program Name Strengthening Caribbean Economic Growth (SCEG) Small Grants Challenge Host Organization Mercy Corps Location Caribbean (Barbados, Bahamas, Grenada, Jamaica, Saint Kitts Nevis) Funding Amount Up to $50,000 USD Deadline February 23, 2026 Project Duration Up to 12 months If your organisation is working to create jobs, support MSMEs, or strengthen economic systems in the Caribbean , this is a strong opportunity to secure funding and scale your impact. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Apply before the deadline and position your organization at the forefront of economic transformation in the Caribbean. The post Apply for SCEG Caribbean Economic Growth Grants 2026 – Mercy Corps Funding Opportunity appeared first on Opportunities for Youth .","tags":["education","Grants","Continent","Latin America and the Caribbean"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-21T22:36:34Z","updated_at":"2026-02-21T22:36:34Z"}
{"id":"0e1dde3212734fd0c17a8d836049207e348c48c4","title":"Apply Now: International Law Fellows Network 2026 on the Future of the Rule of Law","url":"https://opportunitiesforyouth.org/2026/02/20/apply-now-international-law-fellows-network-2026-on-the-future-of-the-rule-of-law/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-20T15:53:27Z","summary":"The global rule of law is under unprecedented strain. Long-standing models of legal cooperation and governance once shaped by post Cold War optimism are now being challenged by political polarisation, populism, and competing global visions of governance. In response, leading institutions are convening the next generation of legal professionals to rethink how the rule of law can be defended and strengthened in the 21st century. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The International Law Fellows Network 2026: The Future of the Rule of Law in a Fractured World offers a unique opportunity for early- to mid-career lawyers to engage in this urgent conversation and develop practical strategies for safeguarding justice, accountability, and legal integrity worldwide. Why the Rule of Law Matters Now The United States and Europe have historically promoted rule-of-law frameworks through foreign aid, technical assistance, and policy conditionality. However, those approaches are now facing mounting pressure: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); In the United States , political attacks on courts and constitutional structures reveal internal vulnerabilities. Across Europe, democratic institutions are being tested by populism, executive overreach, and disinformation. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Globally, rival governance models from Russia and China emphasize sovereignty and centralized control over accountability and individual rights. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); As these trends reshape global governance, rising legal professionals must grapple with how to uphold core principles fairness, equality, transparency, and justice in an increasingly complex world. About the Programme This high-level programme is convened by Salzburg Global Seminar , the International Bar Association (IBA) , and the 21st Century Trust . It brings together early- to mid-career lawyers working in: Major law firms International organizations Public institutions Human rights and advocacy spaces ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Participants will explore how their work in cross-border transactions, compliance, dispute resolution, and human rights law can help defend and adapt the rule of law in a fractured geopolitical landscape. Programme Details Programme Dates: June 11 14, 2026 Location: Schloss Leopoldskron , Salzburg, Austria Application Deadline: April 5, 2026 Fees Funding Fully Funded: Participants selected through IBA member firms or the Salzburg Global Cutler Fellowship community will receive full coverage of programme fees, accommodation, and meals. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); IBA-supported participants may also receive travel funding. General Applicants: Programme cost: $4,250 Employer sponsorship is encouraged. Who Should Apply? Ideal Participants Early- to mid-career lawyers with an interest in international law and global governance ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Professionals engaged in cross-border legal practice or policy work Advocates committed to upholding democratic institutions and human rights Programme Goals The International Law Fellows Network aims to: Strengthen leadership among rising international lawyers Equip participants to defend and adapt rule-of-law frameworks Foster transatlantic collaboration on global legal challenges Promote legal systems grounded in accountability, fairness, and rights Key Questions the Programme Will Explore How can lawyers safeguard the rule of law amid geopolitical fragmentation? ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); What role do legal professionals play in defending democratic institutions? How can global legal frameworks respond to competing governance models? What practical strategies can strengthen transparency, accountability, and justice worldwide? ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); How to Apply Click HERE , To apply. Deadline: April 5, 2026 In a time when legal norms and democratic institutions are increasingly challenged, the need for principled and forward-thinking legal professionals has never been greater. The International Law Fellows Network 2026 offers a powerful platform for rising lawyers to shape the future of global justice and ensure the rule of law remains a cornerstone of free, fair, and stable societies. If you are ready to contribute to this mission, apply today and become part of a global network committed to defending the rule of law. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); For more Fellowship opportunities, click HERE . The post Apply Now: International Law Fellows Network 2026 on the Future of the Rule of Law appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Fellowship","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-21T22:36:34Z","updated_at":"2026-02-21T22:36:34Z"}
