{"id":"48060eadba6557010966a7b7568660f81e06cf5e","title":"Population Council’s GIRL Center Invites Post-doctoral Fellow: Advancing Global Research on Adolescence","url":"https://opportunitiesforyouth.org/2026/02/23/population-councils-girl-center-invites-post-doctoral-fellow-advancing-global-research-on-adolescence/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T07:06:38Z","summary":"The Population Council s GIRL Center is inviting applications for its Post-doctoral Fellow position, a unique opportunity for emerging scholars dedicated to advancing research on adolescents worldwide. Operating at the intersection of demography, public health, economics, and social sciences, the Population Council is launching a bold new social science research institute designed to tackle urgent global questions shaped by demographic change. This fellowship provides an exceptional pathway for early-career researchers to contribute to high-impact studies and influence evidence-based policy and practice. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The application deadline is March 15, 2026 . About the Population Council s GIRL Center The Girl Innovation, Research, and Learning (GIRL) Center serves as a global hub for cutting-edge research on adolescence. Its mission focuses on generating, synthesizing, and translating evidence to support better decision-making for young people. The Center envisions a gender-equitable world in which girls and boys experience safe, healthy, and empowered transitions to adulthood. Over the years, the GIRL Center has made major contributions to the field, producing influential research on topics such as child marriage, education and health linkages, and the lived experiences of child domestic workers. It has launched widely used resources, including the Adolescent Data Hub and the Adolescent Atlas for Action, and regularly convenes researchers, donors, and policymakers to drive conversations on what works for young people globally. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Position Summary The Post-doctoral Fellow will join a dynamic team of global researchers and contribute to one or more of the Center s thematic focus areas: adolescent economic empowerment, adolescents in digital spaces, adolescent mental health, or adolescents affected by humanitarian contexts. The position may be based in New York, London, or Nairobi , with a one-year appointment and potential renewal based on performance and funding. Working under the guidance of the Director and senior researchers, the Fellow will receive close mentorship, contribute to rigorous research initiatives, and participate in knowledge dissemination efforts. This role is ideal for a recent PhD graduate eager to deepen their research expertise and strengthen their contributions to global adolescent wellbeing. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Key Responsibilities Fellows will collaborate on cross-country research projects aligned with GIRL Center priorities. Core responsibilities include: Defining and managing research on high-priority adolescent-focused topics Identifying research gaps and conducting systematic reviews, meta-analyses, and secondary data analyses Partnering with internal and external researchers to design and implement research Developing technical collaborations with research institutions and stakeholders Producing academic papers, policy briefs, and other publications Representing the Center at meetings, workshops, and conferences Supporting project development and related tasks ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Qualifications and Experience The GIRL Center encourages applications from emerging scholars with passion for adolescent wellbeing and strong research foundations. Applicants should have: A recently completed PhD in economics, demography, public health, sociology, or related fields 3 5 years of pre-doctoral research experience A track record of scientific writing or contributions to publications and grants Experience working with under-resourced or marginalized adolescent populations Strong quantitative research skills, including data management and analysis using tools such as STATA Experience engaging policymakers, practitioners, donors, and research partners Excellent written and oral communication skills Candidates should demonstrate strong organizational abilities, independent work ethic, attention to detail, and the capacity to manage multiple priorities. Fluency in English is required; French is an added advantage. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Terms and Application Details The fellowship includes a monthly stipend and individual health insurance coverage. Applicants based in the US or UK must already have the legal right to work; visa support will be available for Nairobi-based fellows. To apply, candidates must submit: A cover letter outlining qualifications, research interests, and career goals A current CV Application Deadline All applications must be submitted by March 15, 2026. Application can be accessed from here . To know more about such opportunities, click here . The post Population Council’s GIRL Center Invites Post-doctoral Fellow: Advancing Global Research on Adolescence appeared first on Opportunities for Youth .","tags":["education","Fellowship","Adolescent research","GIRL Center","Global health research","Population Council","Post-doctoral fellowship","Research opportunities","Social Science Careers"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T07:11:56Z","updated_at":"2026-02-23T07:11:56Z"}
{"id":"d08ba50f87e84725be22b6fb73304342b436f75b","title":"Smithsonian Science Education Center Internship Program: A Pathway Into STEM Education Leadership","url":"https://opportunitiesforyouth.org/2026/02/23/smithsonian-science-education-center-internship-program-a-pathway-into-stem-education-leadership/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T06:51:15Z","summary":"The Smithsonian Science Education Center (SSEC) is offering an exciting internship program for students and emerging professionals interested in transforming K 12 science education. With its mission of Transforming K 12 Education Through Science , the SSEC collaborates with communities around the world to develop cutting-edge STEM curriculum, support teacher development, and strengthen leadership in science education. Unlike many Smithsonian units, the SSEC does not conduct laboratory research or museum education placements. Instead, it provides a unique opportunity to gain experience in curriculum development, program evaluation, and leadership in STEM education. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The application deadline is March 13, 2026 . About the Internship Program by Smithsonian Science Education Center Internships at SSEC vary in focus but share a common goal: preparing interns to engage in the world of STEM learning and educational design. Opportunities span research, curriculum development, educational leadership, and strategic planning. Internship eligibility requirements differ by position, and students at different academic levels undergraduate, graduate, and international students are welcome to apply if they meet the criteria for their chosen role. Applications are submitted through the Smithsonian s central application portal, SOLAA, where candidates select up to three program areas that align with their interests. After review, selected candidates will be invited for a phone interview. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); 2026 Internship Opportunities The SSEC is offering several structured internship pathways in 2026. Each provides hands-on experience, mentorship, and exposure to STEM education at a national level. Research Assistant Intern This intern will join the Professional Services team to support evaluation of SSEC leadership programs. Responsibilities include: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Assisting in survey development and revision Collecting and organizing data from program participants Conducting quantitative and qualitative analysis, including descriptive statistics, t-tests, thematic coding, and case studies Supporting the creation of evaluation reports Ideal candidates demonstrate strong analytical skills, interest in science or education research, and experience with data analysis tools such as SPSS. Graduate students or those who have completed research methodology coursework are preferred. This virtual, full-time internship lasts ten weeks between June and August 2026. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); STEAM Schools of Distinction Intern This role supports the planning and delivery of the 2026 STEAM Schools of Distinction Strategic Planning Institute , a major initiative aimed at helping schools transform STEM education. Tasks include: Learning the LASER model for education transformation Conducting research on science and sustainability education Supporting program development, partnership building, and event coordination Assisting the creation of materials for virtual and in-person programming This internship runs for ten weeks starting in June 2026, with hybrid or in-person options. Undergraduate and graduate students may apply, though additional hours are required leading up to the Strategic Planning Institute. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Smithsonian Science for the Classroom Intern This internship focuses on curriculum development for middle school science instruction. Interns will: Collaborate with curriculum developers to design nonfiction stories for NGSS-aligned science units Conduct research and expert interviews across Earth, life, physical science, and engineering fields Draft, revise, and prepare student-facing texts Identify images, illustrations, and manage permissions for published materials Candidates must demonstrate strong writing, research skills, and the ability to translate complex science into engaging, age-appropriate narratives. This hybrid internship runs for eight weeks between May 11 and August 14, 2026. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Frequently Asked Questions SSEC offers flexible scheduling, modest stipends, and opportunities to earn academic credit depending on university requirements. International students may participate if they have proper authorization such as CPT approval. Applicants must submit a r sum , learning goals essay, references, and where applicable writing or design samples. Work hours typically run between 8:30 am and 5:30 pm (ET), but virtual internships offer flexible arrangements for students balancing coursework or time-zone differences. Application Deadline All applications must be submitted through SOLAA by March 13, 2026. Applicants are encouraged to submit early due to limited internship slots. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Application can be accessed from here . To access such opportunities, click here . The post Smithsonian Science Education Center Internship Program: A Pathway Into STEM Education Leadership appeared first on Opportunities for Youth .","tags":["education","America","Internships","K–12 STEM Opportunities","Research Assistant Internship","Science Curriculum Development","Smithsonian Internships 2026","Smithsonian Science Education Center","STEAM Schools of Distinction","STEM Education Internships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T07:11:56Z","updated_at":"2026-02-23T07:11:56Z"}
{"id":"839dfc67984aa9119643614551c5eb28268a36cf","title":"Racial Justice Fellowship 2026 at New Economy Project (Paid Opportunity for Students)","url":"https://opportunitiesforyouth.org/2026/02/23/justice-fellowship/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T06:21:00Z","summary":"The Racial Justice Fellowship 2026 at New Economy Project is now accepting applications for students interested in economic justice, community organizing, and policy advocacy. This paid summer fellowship offers undergraduate and graduate students the opportunity to gain hands-on experience working on campaigns that promote racial justice and neighborhood equity. Applications are open until March 9, 2026, making this a valuable opportunity for students seeking meaningful summer experience in social justice advocacy. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The Racial Justice Fellowship provides participants with exposure to real-world initiatives focused on community wealth building, policy research, and coalition organizing. Fellows will collaborate with New Economy Project staff and partner organizations to advance economic justice through innovative solutions such as community land trusts, worker cooperatives, public banking initiatives, and other models that empower communities. About the Racial Justice Fellowship The Racial Justice Fellowship is organized by New Economy Project, a nonprofit organization dedicated to building a more just and democratic economy. Through advocacy, organizing, and policy development, the organization works to challenge systemic inequality and promote economic systems that benefit communities. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); This fellowship provides students with an opportunity to gain practical experience working on advocacy campaigns that address structural inequality. Fellows will contribute to projects that focus on economic justice and neighborhood equity while learning from experienced advocates and organizers. The program combines policy work, research, community engagement, and communications strategies. Fellows will work alongside experts and activists who are actively involved in shaping policies and programs that promote financial inclusion, community ownership, and equitable economic systems. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Benefits of the Racial Justice Fellowship Participants in the Racial Justice Fellowship receive several benefits that support their professional growth and career development. First , the fellowship is a paid opportunity, offering compensation of $17 per hour. This ensures that students who may not otherwise have access to funded internships can participate in the program. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Second , fellows gain hands-on experience in several areas related to economic justice and policy advocacy. Participants will learn about: Policy advocacy and legislative research Coalition organizing and grassroots mobilization Community education and public engagement Research and mapping projects Strategic communications and storytelling Third , fellows will gain valuable exposure to the nonprofit and policy sectors, allowing them to understand how advocacy campaigns are designed and implemented. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Finally , the fellowship provides networking opportunities with professionals working in social justice, community development, and public policy. Areas of Work and Learning During the Racial Justice Fellowship, participants will work on projects that contribute to building stronger and more equitable communities. Key focus areas include: Community Wealth Building Fellows will explore models that help communities retain wealth and resources locally. These include worker cooperatives, community land trusts, and other innovative economic models. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Policy Advocacy Participants will support policy campaigns aimed at addressing systemic financial inequality and promoting inclusive economic systems. Coalition Organizing The fellowship emphasizes collaboration with community groups and partner organizations. Fellows will assist with coalition efforts that bring together advocates working toward shared goals. Community Education Fellows may contribute to outreach efforts designed to educate communities about economic justice issues and available resources. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Research and Mapping Participants will conduct research that supports policy advocacy and campaign development. Eligibility Requirements To be eligible for the Racial Justice Fellowship, applicants must meet several criteria. Applicants must currently be enrolled as undergraduate or graduate students at an accredited institution. The fellowship is designed for students interested in gaining experience in policy, community organizing, and economic justice work. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Candidates should demonstrate a strong commitment to advancing racial and economic justice. This may be shown through previous academic work, volunteer activities, internships, or personal initiatives. Applicants must also possess excellent interpersonal and communication skills, as fellows will collaborate with team members, partner organizations, and community stakeholders. Additionally, strong organizational skills and attention to detail are essential, as fellows will contribute to research, campaign coordination, and communications projects. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); While the fellowship is open to applicants from different locations, priority will be given to applicants based in New York City. Duration and Location The Racial Justice Fellowship is a full-time program lasting between 8 and 10 weeks during the summer of 2026. The program follows a hybrid structure, combining remote work with in-person engagement. This allows fellows to participate in research and advocacy work while also attending meetings, events, and community activities. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Participants will work closely with New Economy Project staff and partner organizations during the fellowship period. How to Apply Applicants must submit their application materials by email. To apply for the Racial Justice Fellowship, candidates must prepare a single PDF file that includes: A current resume A cover letter explaining their interest in the fellowship and relevant experience ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); The email subject line should read: 2026 Summer Fellowship Application. Applications should be submitted to: hiring@neweconomyproject.org APPLY HERE Deadline March 9, 2026 Applicants are encouraged to submit their materials before the deadline to ensure their applications are considered. Final Note The Racial Justice Fellowship is an excellent opportunity for students who are passionate about social justice, economic equality, and community empowerment. By participating in this program, fellows will gain practical skills, professional connections, and meaningful experience working on campaigns that aim to create a more equitable economy. Students interested in policy advocacy, community organizing, or nonprofit work will find this fellowship especially valuable as it provides direct exposure to the strategies used to address systemic inequality. ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); For more global fellowships, scholarships, internships, and funding opportunities for students and professionals, click here to explore more opportunities on Opportunities for Youth. The post Racial Justice Fellowship 2026 at New Economy Project (Paid Opportunity for Students) appeared first on Opportunities for Youth .","tags":["education","Fellowship","America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T07:11:56Z","updated_at":"2026-02-23T07:11:56Z"}
{"id":"64cb323c247aa218f3bca5d06399acb70b7ab179","title":"Parliamentary Research Programme 2026 Paid Internship in South Africa","url":"https://opportunitiesforyouth.org/2026/02/23/parliament-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T06:02:25Z","summary":"Parliamentary Research Programme 2026 applications are now open for graduates interested in gaining practical policy and research experience inside Parliament in Cape Town, South Africa. The Parliamentary Research Programme offered by the Konrad-Adenauer-Stiftung provides a five-month paid internship designed to equip young professionals with hands-on experience in parliamentary processes, research, and policy development. The programme will run from 28 April to 25 September 2026, and interested applicants must submit their applications before the 8 March 2026 deadline at 22:00. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the Opportunity The Parliamentary Research Programme is an intensive professional internship programme organized by the Konrad-Adenauer-Stiftung (KAS). The initiative is designed to support young graduates who are interested in public policy, governance, legislative processes, and democratic institutions. This paid internship programme offers participants the opportunity to work directly within Parliament in Cape Town while contributing to research and policy analysis. Interns gain valuable insight into the workings of parliamentary systems and policy development while building professional skills relevant to careers in public policy, governance, research, and political institutions. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Through the Parliamentary Research Programme, participants are immersed in the daily operations of parliamentary work. This exposure allows interns to understand how research and policy recommendations influence legislative debates, parliamentary oversight, and democratic decision-making processes. The programme is particularly beneficial for graduates who are passionate about governance, democracy, and policymaking. Participants gain direct exposure to the functioning of Parliament while strengthening their research, analytical, and communication skills in a real-world policy environment. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Working within Parliament also enables interns to build valuable professional networks with policymakers, researchers, and public sector professionals. Benefits Participants selected for the Parliamentary Research Programme will receive several professional and career development benefits. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Key benefits include: A paid internship opportunity within Parliament in Cape Town Practical exposure to parliamentary procedures and policymaking Hands-on experience conducting research and supporting policy work Development of strong analytical and research skills Networking opportunities with policymakers, researchers, and governance professionals Professional experience that strengthens future careers in policy, governance, research, and public administration This programme provides a unique opportunity for graduates to build their understanding of legislative processes while gaining practical experience in policy-related work. Parliamentary Research Programme Learning Experience Participants in the Parliamentary Research Programme will be involved in research activities that support parliamentary work and policy discussions. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Interns may assist with: Conducting policy and legislative research Preparing research briefs and reports Supporting parliamentary research initiatives Contributing to policy analysis and documentation Engaging in discussions on governance and public policy issues Through these activities, participants gain a deeper understanding of parliamentary oversight, policy analysis, and the legislative decision-making process. The programme also allows interns to learn how research supports evidence-based policymaking and democratic governance. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Eligibility The Parliamentary Research Programme is designed for graduates who are interested in governance, research, and policymaking. Ideal candidates are individuals who: Have completed a university degree Demonstrate strong interest in public policy, governance, or parliamentary processes Possess strong analytical, research, and writing skills Are able to commit to the full-time programme schedule Applicants should also demonstrate a strong commitment to democratic values and interest in policy development and governance. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Duration and Location The Parliamentary Research Programme 2026 will take place in Cape Town, South Africa, where participants will gain experience working within Parliament. Programme details include: Programme Duration: 28 April 25 September 2026 Commitment : Full-time internship (minimum 40 hours per week) The five-month programme provides participants with sufficient time to develop practical research experience and a deeper understanding of parliamentary operations. How to Apply Interested applicants must submit their application through the official online application form. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); To begin the application process, candidates must fill out the application form available through the official programme portal. After submitting the form, applicants will receive an email with further instructions about the programme and the remaining steps required to complete the application. Applicants should ensure they check their email inbox and spam folders if the confirmation email is delayed. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); APPLY HERE Deadline Application Deadline: 8 March 2026 at 22:00 Applicants are strongly encouraged to apply early to ensure their applications are submitted before the deadline. Final Note The Parliamentary Research Programme provides a valuable opportunity for graduates interested in governance, policy development, and parliamentary processes. By participating in this programme, interns will gain meaningful professional experience that can open doors to careers in policy research, government institutions, international organizations, and public administration. Graduates interested in understanding how research supports policymaking and democratic governance are strongly encouraged to apply. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); More Opportunities For more global opportunities including scholarships, fellowships, internships, jobs, grants, and conferences, click here The post Parliamentary Research Programme 2026 Paid Internship in South Africa appeared first on Opportunities for Youth .","tags":["education","Africa","Internships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T07:11:56Z","updated_at":"2026-02-23T07:11:56Z"}
{"id":"6ba336f882263a3dc4540214fb5187fb02781f3a","title":"Future Leaders Program 2026 at One Acre Fund for Emerging Professionals in Africa","url":"https://opportunitiesforyouth.org/2026/02/23/future-leaders-program-africa/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T05:43:08Z","summary":"Leaders interested in agricultural development and social impact can now apply for the Future Leaders Program 2026 at One Acre Fund, a 12-month leadership program designed for emerging professionals across Africa. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The Future Leaders Program by One Acre Fund is a 12-month leadership and professional development program designed for high-potential professionals with 2 5 years of experience. Participants will work on high-impact projects supporting smallholder farmers across East Africa while receiving mentorship, leadership training, and hands-on experience within one of Africa s leading social enterprises. Leaders Development Through the Future Leaders Program The Future Leaders Program is an intensive 12-month leadership development initiative offered by One Acre Fund, a nonprofit social enterprise dedicated to helping smallholder farmers grow more food and earn more income. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Agriculture remains one of Africa s largest sources of employment, engaging approximately 46% of the population, while smallholder farmers produce 80% of the continent s food supply. One Acre Fund works to improve agricultural productivity and livelihoods for farming communities across Africa, with a goal of serving over 10 million farmers by 2030. The Future Leaders Program is designed to identify and develop the next generation of leaders who will contribute to solving Africa s agricultural and rural development challenges. The program offers participants the opportunity to gain hands-on operational experience while developing leadership, problem-solving, and strategic management skills. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Through direct engagement with senior leaders and participation in critical projects across multiple country programs, fellows will gain exposure to the systems and strategies that support hundreds of thousands of farm families across Africa. Participants in the Future Leaders Program will work in one of One Acre Fund s country programs, including Kenya, Rwanda, Uganda, Tanzania, Zambia, Ethiopia, Burundi, or Malawi. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Benefits Participants in the Future Leaders Program will receive several professional development benefits including: Direct mentorship from senior leadership within One Acre Fund Hands-on experience working on high-priority operational and strategic initiatives Leadership development and professional training Exposure to large-scale agricultural and social enterprise programs Opportunities to build strong networks within the development sector Potential pathway to permanent employment opportunities within One Acre Fund after completing the program This program provides a unique opportunity for professionals who want to develop leadership capabilities while contributing to meaningful social impact across Africa. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Program Structure The Future Leaders Program follows a structured process designed to support leadership growth and professional development. Interviews and Matching Applicants go through a rigorous interview process. Successful candidates are matched with One Acre Fund country programs based on their skills and organizational needs. Onboarding Selected participants begin the program with a two-week induction alongside other fellows, where they gain foundational knowledge of the organization and its operations. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Secondment Participants are then seconded to a host country program where they will work closely with program leadership. Project Assignments During the secondment period, fellows will work on two to three critical projects that contribute to the organization s strategic and operational priorities. Learning and Development Participants dedicate approximately 10% of their weekly schedule to professional development activities, mentorship sessions, and leadership training. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Program Closeout At the end of the program, participants will have the opportunity to interview for permanent roles within One Acre Fund. Eligibility Applicants interested in the Future Leaders Program must meet the following requirements: Have the legal right to work in one of the program countries (Kenya, Rwanda, Uganda, Tanzania, Zambia, Ethiopia, Burundi, or Malawi) Hold a Bachelor s degree or higher Have 2 4 years of relevant professional experience Demonstrate strong project management and stakeholder engagement skills Have proficiency in English Knowledge of local languages such as Swahili, Kinyarwanda, Kirundi, Amharic, Chichewa, or French is an advantage ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Candidates should also demonstrate strong analytical thinking, leadership potential, and the ability to translate strategy into structured project plans. Duration Location The Future Leaders Program runs for 12 months. Participants will be placed in One Acre Fund programs located in: Kenya Rwanda Uganda Tanzania Zambia Ethiopia Burundi Malawi ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); How to Apply Interested candidates must apply through the official One Acre Fund application portal. Applicants should ensure they meet the eligibility requirements and demonstrate leadership potential, professional experience, and commitment to social impact in their application. Apply through the official application portal below. APPLY HERE YDeadline Applications are reviewed on a rolling basis. Early applications are strongly encouraged. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Final Note The Future Leaders Program offers an exceptional opportunity for emerging professionals who want to build leadership careers while contributing to agricultural development and poverty reduction in Africa. If you are passionate about social impact, leadership, and agricultural development, consider applying to become part of the next generation of leaders supporting Africa s smallholder farmers. More Opportunities For more global opportunities including scholarships, fellowships, internships, jobs, and grants, ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); click here The post Future Leaders Program 2026 at One Acre Fund for Emerging Professionals in Africa appeared first on Opportunities for Youth .","tags":["education","Africa","Fellowship","unknown"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T07:11:56Z","updated_at":"2026-02-23T07:11:56Z"}
{"id":"5936668e0805f71906cdb65a6e946df3f4c7c2ed","title":"YLSA 2026: Fully Funded Young Leaders Summer Academy in Germany","url":"https://opportunitiesforyouth.org/2026/02/23/ylsa-2026-germany-%e2%9c%85/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T05:07:33Z","summary":"YLSA 2026 applications are now open for the fully funded Young Leaders Summer Academy on Climate Change and Security taking place from 5 8 July 2026 in Hamburg, Germany. Early-career scholars, diplomats, journalists, and practitioners from the Middle East and Europe are invited to apply before the 2 March 2026 deadline, with all travel, accommodation, and meal costs covered by the organizers. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The Summer Academy 2026 focuses on the urgent nexus between climate change and security, equipping future leaders with strategic foresight skills and interdisciplinary expertise to address regional and global challenges collaboratively. About the Summer Academy 2026 The Young Leaders Summer Academy 2026 is organised by: Institute for International Cooperation, Technological Diplomacy and Communication (ICI) German Institute of Global and Area Studies (GIGA) Helmut Schmidt University / University of the Federal Armed Forces Hamburg ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The program responds to escalating regional tensions and the growing impact of climate change on security dynamics. The Summer Academy 2026 seeks to foster dialogue and cooperation between emerging leaders from the Middle East and Europe. Climate change increasingly shapes political stability, economic resilience, and security policy. Extreme weather events, long-term environmental transformations, and the global transition away from fossil fuels create interconnected security implications. The Summer Academy 2026 addresses these complex challenges through interdisciplinary dialogue. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Summer Academy 2026 Goals The Summer Academy 2026 has two main objectives: 1. Building Networks for Peace Participants will engage in professional exchange with peers and high-ranking international experts. The program creates a protected space for dialogue, free from domestic political pressures, encouraging collaborative problem-solving across regions. 2. Strengthening Strategic Skills The Summer Academy 2026 provides training in: Strategic foresight Scenario development Policy strategy design Anticipating alternative futures ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); These skills prepare participants to integrate climate and security perspectives into future leadership roles. Summer Academy 2026 Theme: Climate Change and Security The 2026 theme, Climate Change and Security, explores: Impacts of extreme weather events on regional stability Long-term environmental transformation and migration Fossil fuel transitions and geopolitical implications Multidimensional mitigation and adaptation strategies Participants will analyze how environmental stressors intersect with political, economic, and social systems. The Summer Academy 2026 encourages holistic and sustainable approaches to peacebuilding. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Benefits of the Summer Academy 2026 The Summer Academy 2026 is fully funded. Selected participants will receive: Full travel coverage Accommodation in Hamburg Meals during the program Access to leading international experts Intensive interdisciplinary training Long-term professional networking opportunities Participation in the Summer Academy 2026 also enhances professional credibility and provides exposure to global policy discussions. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Who Can Apply for the Summer Academy 2026? Eligible applicants include: Early-career scholars Diplomats Journalists Policy practitioners Applicants must be from: The Middle East (broad definition) Europe Candidates from diverse academic backgrounds are encouraged to apply, including: Social sciences Natural sciences Economics Law History The Summer Academy 2026 promotes interdisciplinary exchange and values diverse perspectives. Duration and Location Program Dates: 5 8 July 2026 Location: Hamburg, Germany Format: In-person The Summer Academy 2026 takes place annually, building a growing network of future leaders committed to peace and sustainability. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); How to Apply for the Summer Academy 2026 Applicants must submit: CV Letter of motivation (maximum 2 pages) Documents should be combined into a single PDF file. Email subject line: CfA YLSA 2026 [Your Last Name] Send to: romanyshyn@ici-institute.de Summer Academy 2026 Deadline APPLY HERE Application Deadline : 2 March 2026 Late submissions will not be considered. Final Note The Summer Academy 2026 offers a rare opportunity for emerging leaders from the Middle East and Europe to collaboratively explore climate-security challenges in a structured, expert-led environment. By combining interdisciplinary dialogue with strategic foresight training, the program strengthens the next generation of policymakers and changemakers working toward sustainable peace. For more global fellowships, summer programs, grants, and scholarships, click here to explore more opportunities on Opportunities for Youth The post YLSA 2026: Fully Funded Young Leaders Summer Academy in Germany appeared first on Opportunities for Youth .","tags":["education","Europe","Short Courses"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T07:11:56Z","updated_at":"2026-02-23T07:11:56Z"}
{"id":"7d508aa572f78a863edf35d8da35bb542c7182c1","title":"Communications Design Lead at YLabs: A Senior Role Shaping Global Youth-Focused Impact","url":"https://opportunitiesforyouth.org/2026/02/23/communications-design-lead-at-ylabs-a-senior-role-shaping-global-youth-focused-impact/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T01:08:39Z","summary":"YLabs, a global design and research organization dedicated to improving health and economic opportunities for young people, is seeking a Communications Design Lead . This senior consulting role is ideal for design professionals who excel at transforming complexity into clarity, and who are eager to contribute to projects impacting young people across Africa, Asia, and Latin America. With a strong foundation in human-centered design and experience working in diverse global contexts, the successful candidate will help shape high-quality communication and design outputs that support strategic decision-making, research translation, and global development initiatives. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); YLabs works with young people aged 10 24 to co-create solutions in areas such as sexual and reproductive health, HIV/AIDS, mental health, climate resilience, and financial inclusion. The organization maintains teams across the United States and Rwanda, operating in hybrid and remote formats within the GMT+0 to GMT+4 time zones. About the Role at YLabs The Communications Design Lead will play a central role in converting research insights, system maps, stakeholder feedback, and program strategies into compelling, high-fidelity visual frameworks. This is a full-time consultancy position at 40 hours per week, with an expected start date of March 1, 2026 . The contract runs for three months with the possibility of extension depending on performance and project needs. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Candidates ideally based in East Africa or elsewhere within GMT+0 to GMT+4 are encouraged to apply. YLabs is looking for someone who combines visual design mastery with strong systems thinking, UI/UX fluency, and interdisciplinary communication skills. Core Responsibilities The Communications Design Lead will collaborate closely with multidisciplinary teams, partners, and funders to produce contextualized, relevant, and actionable design outputs. Responsibilities include: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Designing high-fidelity frameworks, toolkits, and visual assets that support alignment across teams. Translating complex research and abstract concepts into intuitive visual communication. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Applying strong design fundamentals, including accessibility, hierarchy, layout, and typography. Conducting sensemaking from user insights and incorporating them into design decisions. Maintaining and extending YLabs existing visual identity through coherent, thoughtful design. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Creating front-end UI/UX concepts and digital visual experiences aligned with project needs. This role requires the ability to communicate clearly across diverse audiences from local community members to C-suite leaders. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Expected Deliverables Depending on ongoing project needs, deliverables may include: Comprehensive toolkits and reusable templates Visual syntheses of research findings and insights Service design blueprints and journey maps Advanced systems maps Data visualizations and infographics Any additional outputs formally delegated by project leadership These materials will support strategic learning, program design, partner alignment, and broader communication goals. Who Should Apply YLabs is seeking candidates who bring: Strong professional experience in communication design and systems visualization A portfolio demonstrating high-fidelity frameworks and strategic design outputs Proficiency in Adobe Creative Suite, Figma, Mural, and other collaborative design tools ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Experience working with global development, innovation labs, or social impact organizations Demonstrated understanding of design for diverse and low-resource contexts, particularly within African communities Knowledge of accessibility and inclusive design principles Confidence collaborating with multidisciplinary teams ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Compensation YLabs follows Project Fair s pay equity standards to ensure fair and competitive compensation. The pay range for this senior-level consultancy is: 161,538 RWF 186,538 RWF per day (equivalent to USD 111 127 per day), tax inclusive , commensurate with experience. Application Deadline Applications are reviewed on a rolling basis until the position is filled. However, YLabs expects the successful candidate to begin on March 1, 2026 . Early applications are strongly encouraged to ensure timely review by the Hiring Committee. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Final Notes All applicant information is handled confidentially, and hiring is contingent on background checks and clearances. Only shortlisted candidates will be contacted due to the volume of applications. If you are a design professional passionate about youth empowerment, global impact, and translating complex ideas into compelling visual communication, this role offers a unique opportunity to contribute your skills at a global scale. Application can be accessed from here . To know more about such opportunities, click here . The post Communications Design Lead at YLabs: A Senior Role Shaping Global Youth-Focused Impact appeared first on Opportunities for Youth .","tags":["education","Africa","America","East Africa Consultancy Opportunities","Global Design Jobs","Human-Centered Design Africa","Social Impact Design Roles","Visual Communication Jobs","YLabs Communications Design Lead","Youth Development Careers"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T07:11:56Z","updated_at":"2026-02-23T07:11:56Z"}
{"id":"294931f42317a4c599935fb4884a6a73be5337f5","title":"Presidency Youth Climate Champion (PYCC) – COP31: A National Call for Young Climate Leaders","url":"https://opportunitiesforyouth.org/2026/02/23/presidency-youth-climate-champion-pycc-cop31-a-national-call-for-young-climate-leaders/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T01:00:53Z","summary":"The Australian Government is calling for Expressions of Interest (EOIs) from young Australians ready to shape global climate action. The Presidency Youth Climate Champion (PYCC) for COP31 will play a central role in ensuring that children and young people are not only represented, but meaningfully included, in climate decision-making at the world s most significant climate summit. This prestigious role offers a rare opportunity to influence international climate governance at the highest level. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Application Deadline: 1 March 2026, 11:30 pm AEDT About the Presidency Youth Climate Champion Role The PYCC is a non-statutory, full-time appointment for up to 20 months, created under UNFCCC Decision 16/CP.28. The position is embedded within the COP31 Presidency, enabling the selected candidate to bring youth perspectives into the heart of climate negotiations. With COP31 hosted by T rkiye and Australia serving as President of Negotiations, the PYCC will contribute to a process that directly influences climate policies shaping the futures of young people for decades to come. The role is designed to create space, voice, and influence for youth without placing responsibility for negotiating outcomes on young people themselves. The PYCC will be supported by the COP31 Presidency team and collaborate with national, regional, and international partners. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Key Responsibilities 1. Meaningful Youth Participation The PYCC will use their position to ensure children and youth can participate fully and safely across COP31-related processes. This includes supporting opportunities at events such as COY, Pre-COP, COP, and Subsidiary Body meetings. The aim is to create structured pathways for youth to contribute policy ideas and generate tangible outcomes. 2. Amplifying Youth Voices A major function of the role is to elevate the priorities of diverse youth communities including First Nations and Pacific youth within the Presidency and broader UNFCCC discussions. This may include presenting youth-led statements, sharing stocktake insights, and convening dialogues with global decision-makers. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); 3. Systems, Access, and Support The PYCC will advocate for proper safeguarding, accessibility, logistics, and resourcing to enable inclusive participation. This includes supporting COP work programs relevant to children and youth and ensuring youth-focused spaces are appropriately structured and resourced. 4. Capacity-Building The PYCC will help expand access to climate education, negotiation skills, and UNFCCC learning tools. This includes coordinating capacity-building efforts across domestic, regional, and international networks to strengthen long-term youth engagement in climate governance. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Eligibility Requirements Applicants must: Be aged 18 35 throughout the full duration of the appointment (until December 2027) Be an Australian citizen Demonstrate strong English writing and communication skills Have experience in youth engagement and climate-related work Be available for full-time commitment , including domestic and international travel, for the entire COP31 Presidency period ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Cultural capability, policy fluency, and trust-based leadership especially regarding First Nations and Pacific youth perspectives are key qualities sought in the ideal candidate. About the Opportunity This is a high-profile leadership position that requires deep collaboration with the COP31 Presidency, the UNFCCC Secretariat, YOUNGO, civil society partners, and youth networks globally. The role demands professionalism, diplomacy, and the ability to navigate complex international spaces with clarity and credibility. The PYCC will travel domestically and internationally, attend key climate meetings, and engage youth communities across Australia and beyond. Remuneration will be negotiated based on skills, experience, and institutional approvals. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Why This Role Matters The decisions made at COP31 will directly shape climate policies impacting the lives of young people. By appointing a PYCC, Australia ensures that the voices of youth are not peripheral but integrated into the climate processes that determine global pathways for adaptation, mitigation, and resilience. For young Australians seeking to contribute to global climate solutions, the PYCC role represents a landmark opportunity to drive action, amplify voices, and influence the future. Application can be accessed from here . To know about more such opportunities, click here . The post Presidency Youth Climate Champion (PYCC) – COP31: A National Call for Young Climate Leaders appeared first on Opportunities for Youth .","tags":["education","unknown","Australian Government Opportunities","Climate Governance","Climate Leadership Programs","COP31 Australia","UNFCCC Opportunities","Youth Climate Champion","youth engagement climate action"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T07:11:56Z","updated_at":"2026-02-23T07:11:56Z"}
{"id":"e94715ba4f9e650f9df12e885cf2b0cfd3fb2c26","title":"Paul D. Coverdell Fellows Program: Graduate Funding for Returned Peace Corps Volunteers","url":"https://opportunitiesforyouth.org/2026/02/23/paul-d-coverdell-fellows-program-graduate-funding-for-returned-peace-corps-volunteers/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T00:34:47Z","summary":"The Paul D. Coverdell Fellows Program offers Returned Peace Corps Volunteers (RPCVs) a unique pathway to continue their service while pursuing graduate degrees, professional certificates, and advanced training across the United States. Designed to recognise the global experience, adaptability, and community-driven skills that Volunteers gain abroad, the program provides financial assistance and hands-on professional opportunities that strengthen careers and support underserved communities. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the Paul D. Coverdell Fellows Program The Coverdell Fellows Program is an educational fellowship that supports RPCVs seeking to deepen their impact through further study. Fellows receive a combination of tuition reductions, scholarships, stipends, assistantships, or other forms of financial aid. Beyond academic support, the program keeps RPCVs connected to the Peace Corps mission by placing them in internships in the United States that address locally identified needs. This blend of education, service, and professional advancement makes the program one of the most valuable benefits available to Volunteers after returning home. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Why Become a Coverdell Fellow? Financial Support Partner universities offer fellows a range of benefits, from partial tuition reductions to full scholarships and paid assistantships. This makes advanced education more affordable and accessible for RPCVs across different fields. Hands-On Service Each Fellow completes an internship with a U.S.-based organisation, strengthening their applied skills while serving local communities. These internships align with Peace Corps values, ensuring that participants continue to support community priorities. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Professional Development Fellows build leadership skills, gain practical workplace experience, and expand their networks. Many institutions integrate internships with coursework, offering meaningful opportunities to connect learning with real-world problem-solving. Extending the Peace Corps Mission By sharing their international experiences in classrooms and local communities, Fellows help fulfil the Peace Corps third goal: to promote a better understanding of other peoples among Americans. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Choice and Flexibility With more than 150 partner universities across the United States, RPCVs can pursue degrees in social work, public health, education, international affairs, environmental studies, and many more disciplines. Federal Hiring Advantage RPCVs may qualify for extended noncompetitive eligibility for federal jobs up to three years after service, depending on agency discretion if they enrol soon after returning. Eligibility Criteria RPCVs maintain lifetime eligibility for the Coverdell Fellows Program if they meet one of the following: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Completed a full Peace Corps tour or received completion of service status. Were medically separated. Received interrupted service due to circumstances beyond their control. Completed at least 12 months of Peace Corps Response or Advancing Health Professionals service within a 24-month period. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Volunteers who resigned or were administratively separated are not eligible unless they previously earned eligibility through earlier service. Questions about eligibility can be directed to the Peace Corps Office of University Programs. How to Apply Applications to the Coverdell Fellows Program are handled directly by partner universities. The Peace Corps does not manage or decide individual admissions. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Prospective applicants should: Contact coordinators at participating universities. Request detailed program and application information. Follow each school s deadlines, requirements, and instructions carefully. Prepare necessary materials such as transcripts, test scores (if required), and a signed Description of Service (DOS). Many universities allow RPCVs to apply online, even while still abroad. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application Deadline Because each partner institution manages its own application cycle, deadlines vary by program . RPCVs should check the specific due dates for every university they plan to apply to. Why This Program Matters For RPCVs, the Coverdell Fellows Program is more than an academic opportunity it is a chance to build on global service, strengthen local communities, and gain meaningful professional experience. Whether through public health work, educational initiatives, or community development, Fellows continue to advance the core principles of the Peace Corps while preparing for impactful careers. Application can be accessed from here . To know more about such opportunities, click here . The post Paul D. Coverdell Fellows Program: Graduate Funding for Returned Peace Corps Volunteers appeared first on Opportunities for Youth .","tags":["education","America","Fellowship","Community Service Internships","Coverdell Fellows Program","Graduate Fellowships USA","Peace Corps Benefits","Returned Peace Corps Volunteers","RPCV Education Funding","University Partnerships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T07:11:56Z","updated_at":"2026-02-23T07:11:56Z"}
{"id":"b715494676bbc30cd132cc56aab89d34fa9efdf2","title":"RiseUp with ServiceNow x The Diana Award: A Free 10-Week Tech Career Accelerator for Young People in Africa","url":"https://opportunitiesforyouth.org/2026/02/23/riseup-with-servicenow-x-the-diana-award-a-free-10-week-tech-career-accelerator-for-young-people-in-africa/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T00:18:34Z","summary":"The Diana Award, in partnership with ServiceNow, has opened applications for RiseUp: Advanced Foundations a fully funded, 10-week programme designed to help young people launch careers in the fast-growing ServiceNow technology ecosystem. Through hands-on training, mentoring, and a globally recognised certification pathway, the programme equips participants with the practical and professional skills needed to succeed in tech. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the RiseUp: Advanced Foundations RiseUp: Advanced Foundations is a full-time, intensive learning experience aimed at democratising access to technology careers. Delivered entirely online, the programme runs from 13 April to 19 June 2026 , Monday to Friday, 9:00 17:00 SAST. It is open to young people aged 18 30 based in Kenya, Nigeria, and South Africa , and offers free training to ensure that financial barriers do not limit potential. The initiative forms part of The Diana Award s mission to create meaningful opportunities for young people, while ServiceNow contributes its expertise to open pathways into one of the world s most in-demand digital platforms. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Who Can Apply? The programme is ideal for individuals who are motivated to begin a career in tech, regardless of whether they have prior experience or formal qualifications. Applications are open to: Young people aged 18 30 Residents of Kenya, Nigeria, or South Africa Individuals not currently employed by ServiceNow, a ServiceNow customer, or a ServiceNow partner ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The programme especially encourages participation from groups underrepresented in the tech industry. The ideal learner is: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Proficient in English Curious and eager to learn Able to think through problems logically Comfortable collaborating with others and explaining ideas Ready to commit full-time for the entire 10-week duration Programme Benefits Participants will gain comprehensive training in the ServiceNow ecosystem, building both technical knowledge and professional confidence. The programme offers: Technical Skills Learners will develop hands-on experience in: Application design, development, and management Using Flow Designer, Service Catalog, and JavaScript User interface design and process automation Analytical and communication skills relevant to IT environments Foundations of artificial intelligence and responsible AI usage ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); By the end of the programme, participants will be equipped to support digital workflows, automate tasks, and contribute effectively in tech roles. Employability and Career Skills The programme includes: Personalised one-to-one mentoring Group networking opportunities with professionals Industry-recognised certification (after examination) Ongoing job placement and career support These elements together provide a strong foundation for employment and long-term career growth. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Career Pathways After Completion Graduates of RiseUp: Advanced Foundations can pursue a wide range of entry-level tech roles across companies that use ServiceNow. Potential career paths include: Platform Developer or Application Specialist Junior Technical Consultant Software Developer Analyst or Operations Specialist The programme prepares participants with the skills, confidence, and credentials needed to enter the tech workforce immediately. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Additional Programme Features Mentorship Participants may opt for one-on-one guidance from experienced mentors who provide personalised advice, help navigate challenges, and support learners in identifying their strengths. Mental Fitness Workshops Led by The Diana Award, these sessions focus on wellbeing, confidence, and resilience key elements for navigating the professional world. Networking Opportunities Throughout the programme, participants will connect with peers, alumni, industry experts, and employer partners, building community and expanding professional networks. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application Process The application journey includes: Submitting an Expression of Interest form Attending an introductory webinar Completing ServiceNow onboarding Receiving a conditional offer Completing pre-work on the ServiceNow platform Starting the programme Application can be accessed from here . To know more about such opportunities, click here . The post RiseUp with ServiceNow x The Diana Award: A Free 10-Week Tech Career Accelerator for Young People in Africa appeared first on Opportunities for Youth .","tags":["education","Short Courses","Africa","Free Tech Programme","Kenya Nigeria South Africa Opportunities","RiseUp with ServiceNow","ServiceNow Certification","Tech Training Africa","The Diana Award","Youth Career Development"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T07:11:56Z","updated_at":"2026-02-23T07:11:56Z"}
