{"id":"e7250f9a0df3150d597e9782c8f8d3c70d1d3224","title":"Youth Climate Changemakers Fund for Informal Groups – €1,000 Grants to Fuel Inclusive Climate Action in Europe","url":"https://opportunitiesforyouth.org/2026/02/26/youth-climate-changemakers-fund-for-informal-groups-e1000-grants-to-fuel-inclusive-climate-action-in-europe/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T11:29:36Z","summary":"Are you part of a young, passionate group of changemakers under 30 with a bold climate action idea but no formal organisation status ? The Funding Fairer Futures Youth Climate Changemakers Fund is your chance to turn ideas into impact with grants up to 1,000 , training, community support, and visibility across Europe! ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); What Is the Funding Fairer Futures Initiative? Funding Fairer Futures is a European climate justice initiative dedicated to transforming the climate movement into one that is inclusive, diverse, and representative especially for groups and communities that have historically lacked access and funding. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); At its heart is the Youth Climate Changemakers Fund , one of Europe s largest youth climate funding opportunities , designed to support youth organisations and informal groups to strengthen climate action and build an inclusive movement. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Funding for Informal Groups Key Highlights Grant Size: Up to 1,000 per project Open to informal youth groups no formal registration required Minimum group size: At least 3 young people under 30 Flexible project duration: 6 12 months Europe-wide eligibility: Groups based in the 27 European Union Member States can apply Funding reviews: Rolling process apply early for best chances What Type of Projects Are Funded? Your project should contribute to strengthening the climate movement in ways such as: Awareness-raising and education campaigns Public engagement activities Mobilisation advocacy efforts Capacity building and training sessions Community outreach inclusivity initiatives Projects that link climate action with social justice, diversity, gender equity, disability rights, rural inclusion, or other justice movements are especially welcomed. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Eligibility Checklist To qualify for the micro-grant, you must ensure: 1. Group has 3 members under 30 2. Your project lasts 6 12 months 3. You are eligible to work on climate challenges within the EU 4. Your activities focus on meaningful impact not commercial profit 5. You have not already received or are not applying for another EU DEAR programme fund for the same project Benefits You ll Gain Beyond the financial boost, selected groups will benefit from: Structured training in project design, advocacy, and mobilisation Access to a European network of youth climate actors Visibility and recognition across climate justice platforms Long-term community support and collaboration opportunities This micro-grant doesn t just fund activities it builds skills, networks, and momentum for future impact. How to Apply Step-by-Step To submit your proposal, prepare and send the following documents by email to: fundingfairerfutures@gceurope.org Required submission files: Completed Application Form Group Representation Form Declaration of Honour Declaration on Exclusion Criteria Consultation Survey Before applying, download all application templates and guidance from the official programme page. Apply here Critical Dates Deadlines Application deadline: 1 April 2026 at 23:59 CET (Applications are accepted on a rolling basis, so early submission is highly recommended.) ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Final Tips for Success 1. Start early: Rolling application means early proposals can secure review and approval sooner. 2. Be ambitious but credible: Highlight long-term impact beyond funding. 3. Collaborate and network: Projects with cross-community partnerships often stand out. 4. Tie your project into climate justice: Demonstrate clear connection to the climate movement and inclusive impact. Ready to drive climate action with your team? Prepare your application now and bring your vision to life the climate movement needs diverse voices like yours! For more information visit here For more global opportunities click here The post Youth Climate Changemakers Fund for Informal Groups – €1,000 Grants to Fuel Inclusive Climate Action in Europe appeared first on Opportunities for Youth .","tags":["education","Continent","Europe","Grants"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T13:17:45Z","updated_at":"2026-02-26T13:17:45Z"}
{"id":"afdad4908fc10057b288b09aa882c48d07bd4224","title":"PhD Position in Social Anthropology in Sweden — Fully Funded Doctoral Employment","url":"https://opportunitiesforyouth.org/2026/02/26/phd-position-in-social-anthropology-in-sweden-fully-funded-doctoral-employment/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T10:41:32Z","summary":"A new PhD position in Social Anthropology is now open for applications in Sweden. Doctoral positions in Sweden are structured as paid employment ( doktorand ), making this an attractive opportunity for candidates seeking both academic growth and financial stability. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Why a PhD in Sweden Is Unique In Sweden, PhD candidates are not self-funded students they are formally employed by the university. This means: Four-year fully funded doctoral position Monthly salary and employment benefits Teaching opportunities alongside research Strong work-life balance Access to research funding and academic networks Swedish doctoral education is internationally recognized for its structured supervision and collaborative academic culture. Field: Social Anthropology The position is in Social Anthropology, a discipline focused on understanding social life, culture, power structures, and human diversity through ethnographic and theoretical research. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Applicants are typically expected to: Hold a Master s degree (or equivalent) in Social Anthropology or a related field Demonstrate strong research potential Submit a well-developed research proposal Meet language and academic entry requirements What Makes This Opportunity Attractive Competitive doctoral salary (rather than tuition-based study) Four years of funded research Teaching experience Academic mentorship A collaborative research environment ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Sweden is known for offering doctoral researchers strong institutional support and stable employment conditions compared to many other countries. Key Date Application Deadline: March 30 The timeline is short, so early preparation is strongly recommended especially for refining your research proposal and gathering required documentation. For Official link, Click here . For more OFY PHD opportunities, Visit here. The post PhD Position in Social Anthropology in Sweden — Fully Funded Doctoral Employment appeared first on Opportunities for Youth .","tags":["education","Scholarships","PhD"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T13:17:45Z","updated_at":"2026-02-26T13:17:45Z"}
{"id":"e6c2cc7b1f062a933719416316cc452941ca52ca","title":"Apply for the Intergenerational Peace Education Fellowship 2026 – Drive Lasting Peace in Education","url":"https://opportunitiesforyouth.org/2026/02/26/intergenerational-fellowship/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T09:40:18Z","summary":"Are you a school or organizational leader ready to lead intergenerational peace education in your institution? The Intergenerational Peace Education Leaders Fellowship Program offers a six month journey designed to equip you with the leadership tools, supportive community, and strategic framework needed to institutionalize peace education effectively. This fellowship is ideal for decision-makers committed to strengthening peacebuilding efforts within schools and communities across the Philippines. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Organized by Teach Peace Build Peace Movement (TPBPM) in partnership with the Rotary Club of Makati San Lorenzo through a Rotary Global Grant, this fellowship program positions leaders at the forefront of peace education innovation. Over the course of six months, selected participants will deepen their understanding of peacebuilding strategies, expand their professional networks, and design initiatives that make peace an actionable part of organizational culture and policy. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Why This Opportunity Matters This fellowship goes beyond individual professional development. It supports leaders who are actively shaping the future of education and community engagement through peace education. By participating, fellows contribute to building a culture where peace is lived, learned, and sustained transforming institutional practice and influencing broader educational ecosystems. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); If your goal is to lead systemic change, foster peace within your organization, and catalyze community transformation, then this fellowship offers the tools, community, and support to help you achieve it. Apply now and commit to building a more peaceful future through education. Who This Fellowship Is For This Fellowship is tailored to leaders with authority and influence within their institutions. Eligible participants must be: Filipino citizens (with priority slots for Bangsamoro Autonomous Region in Muslim Mindanao BARMM). School principals, school heads, founders, executive directors, program heads, or those in equivalent leadership roles. Leaders with the capacity to influence programs, policies, and organizational practices. Actively engaged with children, youth, educators, or community members. Committed to peace education, values formation, or peacebuilding initiatives. Willing to integrate fellowship learnings into institutional systems beyond personal development. Available to participate fully in all fellowship activities and requirements throughout the six month duration. This fellowship is not a short term workshop or training. It is a leadership journey committed to long term impact , emphasizing sustained action and accountability within participating institutions. Fellows are expected to translate their learning into concrete initiatives that embed peace into curricula, policies, and organizational culture. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); What You Will Gain Participating in the Intergenerational Peace Education Leaders Fellowship Program means stepping into a community of practice dedicated to peacebuilding excellence. Benefits of the fellowship include: Strategic Leadership Development: Gain the skills to lead and institutionalize peace education in meaningful and measurable ways within your organization. Peace Education Implementation Tools: Learn practical approaches for integrating peace principles into school curricula, daily practices, and internal policies. Network Expansion: Connect with other leaders, educators, and peace practitioners committed to systemic peace education. Collaborative Learning: Engage in shared learning activities, implementation phases, and monitoring sessions that support the fellowship s long term goals. Community of Practice Membership: Become part of a network engaged in continuous peacebuilding work, supporting each other beyond the fellowship period. Fellowship Timeline and Commitment The fellowship timeline is structured to support a phased and comprehensive learning experience, beginning with application and screening and continuing through implementation and culmination phases: Application Period: February 2026. Document Screening: March 5 15, 2026. Interviews with Shortlisted Participants: March 15, 2026. Announcement of Selected Fellows: March 20, 2026. Online Orientation / Pre Fellowship Activities: 25-30, March 2026. In Person Fellowship Activities in Metro Manila: Scheduled in April 2026 (exact dates to be finalized). Online Peace Education Pocket Sessions / Implementation / Culminating Activity: May to July 2026. This comprehensive engagement ensures that participants not only internalize peace education principles but also apply them in real contexts within their institutions. The structured timeline balances in person and virtual learning components to foster a supportive environment for deep reflection and sustained action. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); How to Apply Application for the Intergenerational Peace Education Leaders Fellowship Program requires thoughtful preparation. Applicants are encouraged to prepare a one minute video explaining their motivation for joining the fellowship, highlighting their commitment to peace education and the impact they hope to achieve within their institutions. This video is a key component of your application. Application Deadline: March 5, 2026 All applications must be submitted before this date to be considered for the fellowship cohort. To apply, visit the official program page and complete the online application form. Ensure you include all required documents and your motivation video, and verify your eligibility before submitting. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Looking for more Opportunities? Check out the Opportunities for Youth website! The post Apply for the Intergenerational Peace Education Fellowship 2026 – Drive Lasting Peace in Education appeared first on Opportunities for Youth .","tags":["education","Asia","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T13:17:45Z","updated_at":"2026-02-26T13:17:45Z"}
{"id":"8be7bc1f8d3164bd9e3e7779490a73e54e603883","title":"Apply Now for the Girl Scout Global Citizen Summit 2026 – A Leadership Adventure in Washington, D.C.","url":"https://opportunitiesforyouth.org/2026/02/26/girl-scout-summit/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T09:30:31Z","summary":"Are you a Girl Scout ready to take your leadership and global awareness to the next level? The Girl Scout Global Citizen Summit is a unique opportunity designed to cultivate young leaders who are passionate about making a difference in their communities and around the world. This immersive summit, taking place July 20 24, 2026, in Washington, D.C. , brings together Girl Scouts aged 15 to 20 to learn, grow, and connect with like-minded peers. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The summit is not just an event; it s a leadership experience that combines hands-on workshops, networking opportunities, and discussions on global issues to prepare participants for meaningful civic engagement. By attending, participants gain skills and experiences that extend far beyond the summit itself, impacting their communities, schools, and future careers. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Who Should Apply The Girl Scout Global Citizen Summit is open to Girl Scouts in good standing with Girl Scouts of the Nation s Capital. Candidates should demonstrate the qualities of a Global Girl Scout Citizen , including: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Leadership potential and initiative in their communities. Cultural awareness and a curiosity about global issues. Commitment to civic engagement and service. Readiness to participate in all pre-summit sessions, in-person activities, and post-summit projects. Fluency in English to engage fully in program content. It is important to note that National Council Session delegates are not eligible to participate due to overlapping dates. What Participants Will Experience Participants at the summit can expect a variety of engaging and educational experiences that help build leadership and global citizenship skills. These include: Leadership Development: Interactive workshops, mentorship sessions, and practical exercises allow participants to strengthen their leadership abilities in real-world contexts. Global Issue Exploration: Participants examine pressing international challenges and work collaboratively to develop actionable solutions. Networking Opportunities: Connect with Girl Scouts from across the nation and young leaders from diverse backgrounds to exchange ideas and experiences. Girl Scouts UNITE: Participants have the chance to amplify their impact by sharing what they learned at the summit with peers and community members, inspiring others to take action. Through these experiences, Girl Scouts gain confidence, expand their global perspectives, and develop skills that support both personal growth and community impact. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); How to Prepare for Your Application Applicants should carefully showcase how they embody the qualities of a global citizen and a Girl Scout leader. This includes: Highlighting leadership roles in school, community, or Girl Scout activities. Detailing experiences away from home that demonstrate independence, resilience, or problem-solving skills. Including participation in extracurriculars such as clubs, arts, sports, or volunteer work. Demonstrating commitment to attending all summit activities, preparation sessions, and post-summit projects. A virtual interview may be required, and selected participants must provide a headshot for official summit materials. Thoughtful preparation will help your application stand out and improve your chances of being selected. Why This Summit Matters The Girl Scout Global Citizen Summit is more than a leadership program; it s a platform for young women to build confidence, explore global issues, and become active agents of change. Participants develop leadership, teamwork, and communication skills while engaging in meaningful civic activities. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Attending the summit provides: A chance to meet mentors and experts in leadership, social impact, and global engagement. Opportunities to collaborate on projects that address social and environmental challenges. Skills and experiences that enhance college applications, resumes, and future career pathways. Lifelong connections with peers who share a commitment to leadership and community impact. By participating, Girl Scouts contribute to a global movement, gaining the tools and confidence needed to lead positive change both locally and internationally. Application Details The application is straightforward but requires attention to detail. It takes approximately 30 minutes to complete and must be submitted in a single session. A parent or guardian should be available for verification where required. Make sure to provide complete and accurate information to avoid delays in processing your application. Application Deadline: March 12, 2026 Don t miss this opportunity to become a Global Girl Scout Citizen . Visit the official website to apply and take the first step toward a transformative leadership journey that will impact your life, your community, and the world. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Looking for more opportunities? Check out the Opportunities for Youth website! The post Apply Now for the Girl Scout Global Citizen Summit 2026 – A Leadership Adventure in Washington, D.C. appeared first on Opportunities for Youth .","tags":["education","Conferences","America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T13:17:45Z","updated_at":"2026-02-26T13:17:45Z"}
{"id":"f6b20ec0d326f21bd71b2106dbc108b7db03d819","title":"Global Leadership Fellows Program 2026 – Transforming Early-Career Professionals into Global Leaders","url":"https://opportunitiesforyouth.org/2026/02/26/global-leadership-fellows/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T09:20:54Z","summary":"In an interconnected world where local success increasingly depends on global fluency, developing leaders who understand international systems, cross-sector collaboration, and complex problem-solving is vital. To support this development, the Global Leadership Fellows Program 2026 offers emerging professionals a structured, transformative experience designed to cultivate globally fluent leadership for Atlanta and beyond. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Hosted by the World Affairs Council of Atlanta , this 10-month leadership program brings together a cohort of early-career professionals with diverse backgrounds in business, government, nonprofit, and civic sectors. The fellowship combines classroom master classes, personalized leadership coaching, and an international immersion experience that strengthens participants global perspective and equips them with tools to lead effectively in a complex world. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Program Overview The Global Leadership Fellows Program is designed for candidates with 5 to 15 years of professional experience who are motivated to expand their leadership capabilities and broaden their global outlook. Over the course of the program, fellows engage in a series of structured learning modules, peer collaboration, strategic leadership exercises, and experiential immersion designed to enhance their ability to navigate global issues and make meaningful impact in their organizations and communities. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Key components of the program include: Dynamic Master Classes on leadership frameworks, global trends, and strategic thinking. Professional Leadership Coaching tailored to each fellow s growth and development. International Immersion involving travel abroad to engage with global institutions, learn cross-cultural leadership skills, and observe decision-making in international contexts. Networking and Peer Learning opportunities that foster long-term professional relationships and community impact. Why This Opportunity Matters As globalization reshapes local economies and social systems, leaders must be equipped to operate beyond familiar boundaries. This program fills a crucial gap for mid-career professionals who may not have access to formal international leadership training but are poised to influence decision-making, drive innovation, and contribute to civic and economic development. The combination of strategic coursework, mentorship, real-world examples, and immersion abroad builds a leadership foundation that extends beyond traditional professional development. Fellows learn not just to respond to change but to anticipate, shape, and lead through it. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); For Atlanta a city with growing global influence building this talent pipeline helps ensure that the next generation of leaders is prepared to represent the city on the world stage and generate sustainable impact within their organizations and communities alike. Who Should Apply The program targets a wide range of professionals, including: Emerging leaders who have demonstrated leadership potential and are eager to grow. Professionals with a global mindset who want to deepen their understanding of international affairs. Cross-sector innovators from business, government, nonprofit, or civic organizations. Community builders and aspiring change makers committed to driving positive impact locally and globally. Candidates who value continuous professional and personal growth . Participants are expected to bring their professional experience, collaborative spirit, and curiosity to the cohort, enriching the learning experience for themselves and their peers. Application Details and Requirements The 2026 application period opens on Monday, February 2, 2026 , and closes on Friday, April 3, 2026 (11:59 p.m. EST) . Applications submitted after the deadline or incomplete applications will not be accepted. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); A $500 participation fee is required upon acceptance into the program. Participants selected for the international immersion experience receive a travel grant that includes: Partial round-trip airfare from Atlanta (standard coach class; upgrades and airline miles are not reimbursed). Accommodations and local transportation for planned itinerary activities. Meals based on U.S. Department of State foreign per diem rates. Admission to scheduled museums, tours, and public or government sites on the itinerary. Excluded from the travel grant are: Meal costs outside per diem rates. Activities not on the official itinerary. Personal transportation, incidentals, travel insurance, and visa costs if required. Commitment and Participation Expectations Fellows must attend all scheduled Master Classes, leadership sessions, and the international immersion component. Attendance and active participation are critical aspects of the program, designed to ensure a cohesive learning experience for each cohort. Supervisor approval is required before participation, confirming that each fellow can balance professional responsibilities with program engagement. Applicants must submit a signed Supervisor Approval Form as part of their application. Application Timeline Application opens: 2 February 2026 Application deadline: 3 April 2026 (11:59 p.m. EST) Prospective applicants are encouraged to gather all required materials, including recommendation letters that speak to leadership potential and professional impact, before beginning the online submission. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); For full application requirements, dates, and instructions, visit the official program page . Looking for more opportunities? Check out the Opportunities for Youth website! The post Global Leadership Fellows Program 2026 – Transforming Early-Career Professionals into Global Leaders appeared first on Opportunities for Youth .","tags":["education","Fellowship","America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T13:17:45Z","updated_at":"2026-02-26T13:17:45Z"}
{"id":"89d5d29efd50d875810de32b96a0b81a5faa9b68","title":"Women’s Congressional Staff Foundation Scholarship 2026: Applications Now Open","url":"https://opportunitiesforyouth.org/2026/02/26/womens-congressional-staff-foundation-scholarship-2026-applications-now-open/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T05:10:36Z","summary":"The Women s Congressional Staff Foundation Scholarship (WCSF) aims to create the path to a career on Capitol Hill, when for many women, especially those from middle- and low-income backgrounds, the financial burden of living and working in Washington, D.C., can put these opportunities out of reach. Through its 2026 Scholarship Program, the Foundation is once again supporting aspiring female staffers and working to create a more equitable and inclusive workplace on Capitol Hill. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Applications for the summer 2026 scholarship are open now , with all materials due no later than 11:59 PM EST on April 15, 2026 . ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Supporting Women With Women s Congressional Staff Foundation Scholarship The WCSF Scholarship is designed to ensure that more women from diverse backgrounds are able to access congressional internships positions that often serve as the entry point for long-term legislative careers. The Foundation s mission centers on broadening representation, elevating women s voices, and ensuring that the experiences of women inform the policymaking process from the very beginning. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Beyond financial support, scholarship recipients gain access to a valuable professional network. Members of the WCSF Board provide mentorship, career guidance, and connections that can shape a recipient s long-term trajectory in public service. Why This Scholarship Matters Interning on Capitol Hill is an exciting opportunity, but it can also be financially demanding. The cost of housing, transportation, and basic living expenses in D.C. can quickly add up making internships inaccessible for many talented women. WCSF seeks to remove this barrier by ensuring that a student s economic background does not define her ability to serve. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); By supporting early-career women at this pivotal stage, the Foundation strengthens the pipeline of future congressional staffers and leaders. Many previous recipients have gone on to full-time roles in congressional offices, political communications, public policy, and advocacy organizations. The program is not only empowering individuals it is reshaping the landscape of representation on Capitol Hill. Deadline and Selection Timeline All application materials must be submitted by Wednesday, April 15, 2026, at 11:59 PM EST . Finalists will then be contacted to schedule interviews with members of the selection committee. Final scholarship awards will be announced no later than May 24, 2026 . Applications are reviewed on a rolling basis, and candidates are strongly encouraged to apply early. Eligibility Requirements To qualify, applicants must already have applied for an internship with a congressional office whether with a Member, Delegate, or Resident Commissioner of Congress, or with a U.S. Senate or House committee, caucus, or leadership office based in Washington, D.C. Confirmation of the internship will be required before the scholarship funds are awarded. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Applicants must identify as a woman, be at least 18 years old, and hold a diploma from an accredited high school. What the Selection Committee Looks For The WCSF committee evaluates applicants holistically, placing high priority on: Demonstrated financial need, including anticipated expenses related to the internship A clear connection between the internship and academic or professional goals Applications submitted for high-responsibility internships Strong writing, references, and overall application quality A solid academic track record Program Expectations Scholarship recipients are expected to complete the full internship described in their application. Withdrawing early or misrepresenting financial need may require forfeiture or repayment of funds, except in extraordinary circumstances approved by the Foundation s board. The award is tied to the specific internship listed in the application and cannot be transferred. Empowering Women on Capitol Hill Through mentorship, financial assistance, and long-term professional support, the Women s Congressional Staff Foundation is shaping the future of equitable leadership in Washington, D.C. The 2026 scholarship cycle is an opportunity for emerging women leaders to take their first steps toward meaningful service and impact. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Women pursuing internships on Capitol Hill are encouraged to apply before April 15, 2026 , and begin a journey that could define their careers for years to come. Application can be accessed here . To know more about such opportunities, click here . The post Women’s Congressional Staff Foundation Scholarship 2026: Applications Now Open appeared first on Opportunities for Youth .","tags":["education","America","Scholarships","congressional internships","financial aid for students","public service careers","scholarships 2026","Washington DC opportunities","women empowerment","women in politics"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T13:17:45Z","updated_at":"2026-02-26T13:17:45Z"}
{"id":"c1ef9b112a5534cb44cdc67ee9f83b53efee4052","title":"Human-Centred Conservation Storytelling Grant: Empowering Journalism Rooted in Real People and Real Landscapes","url":"https://opportunitiesforyouth.org/2026/02/26/human-centred-conservation-storytelling-grant-empowering-journalism-rooted-in-real-people-and-real-landscapes/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T05:01:44Z","summary":"The Human-Centred Conservation Storytelling Grant invites experienced journalists and storytellers to rethink how conservation narratives are shaped, told, and understood. Too often, global conversations around conservation focus solely on wildlife or landscapes, overlooking the people whose lives are inextricably tied to ecological outcomes. This grant seeks to transform that narrative. By supporting high-quality, publishable stories that centre human realities in African conservation contexts, the program aims to elevate storytelling that is nuanced, responsible, and grounded in lived experiences. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About Human-Centred Conservation Storytelling Grant Conservation is never just about ecosystems; it is about the people who sustain, live within, and depend on them. The grant responds to a pervasive issue in public storytelling: narratives are frequently simplified, romanticised, or disconnected from crucial social, political, and economic dynamics. This initiative challenges that pattern by commissioning stories that reflect complexity rather than gloss over it. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Human-Centred Conservation places people at the heart of every story. It considers how rights, livelihoods, governance systems, and cultural relationships shape outcomes on the ground. From land-use decisions to resource access, from coexistence with wildlife to health and economic pressures, the approach recognises that conservation is deeply intertwined with daily realities. Stories supported through this grant may highlight successful models that empower local communities or reveal what happens when people are excluded from decision-making. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); What Kind of Stories Will Be Supported? The grant seeks strong, original ideas rooted in rigorous reporting and thoughtful examination. Ideal stories acknowledge that conservation is not linear. They explore where human-centred approaches drive positive change, where they fall short, and where tensions and trade-offs define everyday life. This includes stories that: Showcase innovation, resilience, and hope led by communities Illuminate challenges, contradictions, or unintended consequences Investigate governance, livelihoods, coexistence with wildlife, food systems, or climate adaptation Highlight land-use decisions shaped by cultural, economic, or political pressures There is no prescribed angle or format, allowing storytellers to work across print, film, photography, or audio. What matters is editorial maturity, depth, and respect for complexity. This grant is specifically designed for creators who already work to professional publishing standards and can deliver work suitable for established media platforms. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); What Will Not Be Funded To maintain high editorial integrity, the grant will not support promotional content, advocacy material, or simplified wildlife stories lacking a human focus. Narratives that present conservation as universally successful or universally failing, without acknowledging lived conditions and context, also fall outside the program s scope. Additionally, proposals requiring significant development support or capacity-building are unlikely to be selected, as this opportunity is intended for experienced professionals. Funding Tiers and What Applicants Can Expect Applicants may apply for one of three funding tiers: Tier 1: Up to USD 5,000 Tier 2: Up to USD 8,000 Tier 3: Up to USD 12,000 Budgets must be realistic and proportional to the proposed story. The application process requires a concise pitch, previous work samples, details on likely publication or broadcast pathways, and a summary budget. Selection Criteria and Review Process A selection panel will evaluate applications based on the clarity and quality of the pitch, alignment with Human-Centred Conservation principles, evidence of professional experience, and feasibility of the budget. Not all eligible applications will receive funding, making clarity and originality crucial. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Key Dates Applications open: 1 February 2026 Deadline: 23:59 GMT on 8 March 2026 Applicants with questions may contact the organising team, though individual feedback on proposals will not be provided. A Commitment to Thoughtful, People-Centred Storytelling The Human-Centred Conservation Storytelling Grant underscores a powerful truth: conservation cannot succeed without understanding the people who shape and are shaped by it. By supporting storytellers who elevate these human dimensions, the program aims to contribute to more informed, inclusive, and impactful global conversations on conservation. Application can be accessed from here . To know more about such opportunities, click here . The post Human-Centred Conservation Storytelling Grant: Empowering Journalism Rooted in Real People and Real Landscapes appeared first on Opportunities for Youth .","tags":["education","Africa","Grants","Africa environmental reporting","climate and governance","community livelihoods","conservation storytelling","human-centred conservation","journalism grant 2026","wildlife coexistence"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T13:17:45Z","updated_at":"2026-02-26T13:17:45Z"}
{"id":"3a4a039d4f65e6dfc71a19a92cc6e7d223574d74","title":"Smithsonian Young Ambassadors Program 2026: A Transformative Leadership Opportunity","url":"https://opportunitiesforyouth.org/2026/02/26/smithsonian-young-ambassadors-program-2026-a-transformative-leadership-opportunity/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T04:54:39Z","summary":"The Smithsonian Young Ambassadors Program (YAP) returns in 2026 with another year of transformative learning, cultural exploration, and leadership development. Hosted by the National Museum of the American Latino, this nationally recognized program empowers rising high school seniors across the United States and Puerto Rico to become community-conscious leaders through exposure to the Smithsonian s world-class resources. As the program enters another year, it continues to nurture the next generation of thinkers, creatives, and changemakers. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Smithsonian Young Ambassadors Program Goals and Mission YAP is designed to cultivate leaders in the arts, sciences, humanities, and civic life. The program promotes higher education by exposing students to a wide range of academic disciplines and introducing them to Latino role models in these fields. This representation is powerful showcasing diverse professional paths and inspiring students to envision their own futures in new ways. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Another core goal is to provide hands-on learning environments that build strong 21st-century skills. Throughout the program, students gain experience in communication, collaboration, critical thinking, and professional development. These transferable skills prepare them for college life, internships, and future leadership roles, ensuring they leave the program confident and capable. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Washington Week Experience A major highlight of YAP is the immersive Washington Week in Washington, D.C. During this once-in-a-lifetime learning experience, students participate in workshops led by leading scholars, museum professionals, and community advocates. They explore topics related to STEM, the arts, history, and culture while engaging directly with the Smithsonian s exhibitions and collections. For many participants, Washington Week becomes a defining moment in their academic and personal journeys. The exposure to new ideas, the opportunity to connect with inspiring professionals, and the sense of belonging within a national institution create an unforgettable foundation for their future ambitions. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Making History Community Practicum Following Washington Week, students participate in the Making History Community Practicum , a key component that bridges their experiences in Washington with their communities back home. Through this practicum, students engage with local organizations, contribute to civic initiatives, and explore what it means to serve as ambassadors of their communities. This hands-on involvement helps students understand how museums can function as spaces for representation, storytelling, and community engagement. It also instills a deep sense of civic responsibility, encouraging participants to view themselves as active contributors to the world around them. Alumni Network and Long-Term Impact YAP s impact extends far beyond the summer experience. The program maintains a strong and active Alumni Network that provides graduates with continued leadership development, mentorship, and professional opportunities. Many alumni go on to pursue degrees and careers in fields such as the arts, education, business, technology, and public service. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); The program s track record speaks to its success: a 97% college graduation rate, 354 alumni, 19 years of programming, and engagement across 18 cities throughout the United States and Puerto Rico. YAP alumni consistently serve their communities with creativity, confidence, and purpose, demonstrating the long-term value of the program s mission. Application Details and Deadline Applications for the 2026 Young Ambassadors Program open on February 23, 2026 , and will remain open until April 10, 2026 . The program is open to rising high school seniors regardless of race or ethnicity. All programming is offered in English, and applicants are not required to speak Spanish. Students interested in leadership, culture, and community engagement are encouraged to apply. With its unique blend of academic enrichment, cultural learning, and hands-on experience, YAP continues to be one of the nation s premier youth leadership opportunities. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Application Deadline: April 10, 2026. Application can be accessed from here . To know more about such opportunities, click here . The post Smithsonian Young Ambassadors Program 2026: A Transformative Leadership Opportunity appeared first on Opportunities for Youth .","tags":["education","Latin America and the Caribbean","high school internships","Latino community empowerment","Smithsonian education programs","Smithsonian YAP 2026","student civic engagement","Washington Week","youth leadership program"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T13:17:45Z","updated_at":"2026-02-26T13:17:45Z"}
{"id":"60b8c98efbbb69225dc6f7f24713bb73f8a27f11","title":"2026 Japan International Award for Young Agricultural Researchers","url":"https://opportunitiesforyouth.org/2026/02/26/2026-japan-international-award-for-young-agricultural-researchers/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T04:21:55Z","summary":"The Japan International Award for Young Agricultural Researchers (Japan Award) is now open for nominations for its 20th presentation in 2026 . Established in 2007, the award recognizes exceptional young researchers from developing countries who have demonstrated excellence in research and development in agriculture, forestry, fisheries, and related fields. The program aims to encourage innovation, strengthen global scientific collaboration, and inspire the next generation of leaders in agricultural science. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The deadline for submission is May 15, 2026 (JST) . About the Japan International Award The Japan Award seeks to boost motivation among young researchers working to improve agricultural systems in developing regions. Through this award, the Japan International Research Center for Agricultural Sciences (JIRCAS) highlights researchers whose work contributes to sustainable food production, environmental stewardship, and technological advancement in agriculture. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Up to three awardees will be selected through a competitive international evaluation process conducted by the selection committee. Eligibility Criteria Nominees must meet all of the following requirements: Be researchers from a developing country or territory . Be under 40 years old as of January 1, 2026 . Be affiliated with a non-Japanese research institute or university . Be actively engaged in research and development related to agriculture, forestry, fisheries, or related industries in developing regions. Candidates must also satisfy at least one of the following conditions: Have demonstrated outstanding performance in research that benefits agricultural development in a developing region. Have achieved research results that show strong potential for future technological innovation . Applicants who were not selected in previous years may re-apply . Awardees must, in principle, be able to attend the awarding ceremony in Japan and deliver a lecture. Award Components Up to three selected researchers will receive: An official testimonial , awarded by the Chairman of the AFFRC during the awarding ceremony A cash prize of USD 5,000 , supported through the MOTAI JIRCAS Award An invitation to Japan for the ceremony and related events The MOTAI JIRCAS Award is funded by a donation from Mr. Shigeru Motai , former Chairman of the AFFRC of MAFF, and is administered by JIRCAS. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Application Process Applications must be submitted by the recommending research institutes , whether Japanese or non-Japanese. Each institute may recommend only one researcher , including any branch institutions. Application Deadline: May 15, 2026 (Friday, JST) Key phases of the 2026 cycle: Nomination submission deadline: May 15, 2026 Selection and determination of awardees: August or September 2026 (tentative) Awarding Ceremony: October or November 2026 (tentative) Nomination packages must include all required forms, including the application form, self-advertisement sheet, research achievements list, and checklist, along with supporting documentation. Complete guidelines and templates are provided in the official application materials. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Purpose and Impact The Japan Award plays a vital role in supporting scientific talent in the Global South. By elevating the work of young researchers, the award encourages innovations that can strengthen food security, enhance climate resilience, and transform agricultural technologies in developing regions. Awardees become part of a global network committed to advancing sustainable agriculture and contributing to improved livelihoods and food systems worldwide. Submission Details Applications must be submitted by post to the Secretariat of the Japan International Award for Young Agricultural Researchers, at the JIRCAS Headquarters in Tsukuba, Japan. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Application Deadline: May 15, 2026 (JST) Announcement of Winners: August September 2026 (tentative) Award Ceremony: October November 2026 (tentative) To further strengthen its global impact, the Japan International Award for Young Agricultural Researchers also serves as a bridge between scientific innovation and real-world application. By bringing awardees to Japan for the ceremony and lecture delivery, the programme fosters international exchange, collaboration, and the sharing of cutting-edge knowledge across continents. This in-person engagement not only elevates the visibility of young scientists but also exposes them to Japan s advanced research ecosystem, encouraging long-term partnerships that can accelerate agricultural transformation in developing regions. Application can be accessed from here . To know more about such opportunities, click here . The post 2026 Japan International Award for Young Agricultural Researchers appeared first on Opportunities for Youth .","tags":["education","Asia","Awards","Agricultural Research","developing countries","food security","forestry and fisheries","global innovation","Japan Award 2026","JIRCAS","research funding","science awards","sustainable agriculture","young researchers"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T13:17:45Z","updated_at":"2026-02-26T13:17:45Z"}
{"id":"461d5fa99142d29b4a994f30545cdbf89b8c799f","title":"Youth for Biosecurity Fellowship 2026: Fully Funded UNODA Programme for Young Scientists from the Global South","url":"https://opportunitiesforyouth.org/2026/02/26/empowering-youth-for-global-biosecurity-the-youth-for-biosecurity-fellowship/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T01:36:15Z","summary":"The United Nations Office for Disarmament Affairs (UNODA) in Geneva has opened applications for the Fourth Edition of the Youth for Biosecurity Fellowship 2026 , a fully funded international training and leadership programme designed for emerging biosecurity leaders from the Global South. The fellowship provides advanced learning, policy engagement, and international networking opportunities for young scientists interested in biosecurity, disarmament, and global health security. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Application Deadline: 5 March 2026 Programme Duration: June August 2026 (3 months) Location: Online sessions + in-person visit to Geneva, Switzerland Funding: Economy-class travel and daily subsistence allowance provided according to UN rules ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); About the Youth for Biosecurity Initiative The Youth for Biosecurity Initiative was established as a Biosecurity Diplomacy Workshop in 2019 and has since engaged more than 140 young scientists through an innovative training model focused on biosecurity diplomacy and international cooperation. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); For the 2026 edition, 20 competitively selected young scientists from the Global South will participate in a structured programme that combines virtual learning, collaborative research, and direct exposure to global biosecurity diplomacy processes during the Biological Weapons Convention (BWC) meetings in Geneva. The fellowship is designed to strengthen the next generation of leaders working at the intersection of life sciences, security, and international policy. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Fellowship Objectives The Youth for Biosecurity Fellowship aims to support emerging leaders by enabling them to: Deepen expertise in biosecurity and disarmament policy Build leadership skills and confidence in international engagement Exchange ideas with senior experts and policymakers Develop practical proposals to strengthen global biosecurity Collaborate with interdisciplinary peers from different regions Join an international network of young biosecurity professionals Who Can Apply? Be under 35 years old at the time of applying, Be citizens of a BWC State Party listed as least developed country, low- or lower/upper middle-income country Check if your country is in the Development Assistance Committee List of the Organisation for Economic Co-operation and Development (OECD) . Have an advanced degree in the life sciences or a related discipline from a recognized university or institution. Have proof of proficiency in written and spoken English to a level of B2 or higher ( Global scale Table 1 (CEFR 3.3): Common Reference levels Common European Framework of Reference for Languages (CEFR). ), with a certificate of confirmation to be provided. Female candidates are strongly encouraged to apply. The selection process will be guided by the need to ensure the highest quality of participants while maintaining a gender and regional balance. What the Programme Includes The fellowship runs over a three-month period and is structured to accommodate professional and academic schedules while maintaining active participation requirements. Online Webinar Series (June July 2026) Five interactive online webinars Schedule: 3 June to 1 July 2026 Frequency: Approximately one session per week Duration: About two hours per session Time: Wednesdays at 2:00 PM CET (opening session at 3:00 PM CET) Collaborative Scientific Poster Project Group-based scientific poster competition Preparation during July 2026 Presentation at the BWC Working Group meeting in August 2026 In-Person Visit to Geneva Five-day visit from 17 21 August 2026 Participation in meetings of the BWC Working Group on the Strengthening of the Convention Full attendance required for all selected fellows Funding and Travel Support Successful applicants will receive: Economy-class travel tickets to Geneva Daily subsistence allowance during official programme dates Access to all programme learning activities and events Participants are responsible for securing any required travel documents, including visas, for entry into Switzerland. Why Apply for the Youth for Biosecurity Fellowship? This programme offers a rare opportunity for young scientists to engage directly with international policy processes while strengthening technical knowledge and leadership capacity in biosecurity. Fellows gain exposure to UN-level discussions, interdisciplinary collaboration, and global professional networks that can support long-term career growth in science, policy, and international security. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); How to Apply Applications must be submitted through the official application form . Application Deadline: 5 March 2026 Applicants are encouraged to prepare their documents early and ensure that all eligibility requirements are met before submission. Final Thoughts The Youth for Biosecurity Fellowship 2026 is an exceptional opportunity for young scientists from the Global South to develop expertise in biosecurity diplomacy, contribute to international discussions, and build a global professional network. With fully funded participation and direct engagement with the United Nations disarmament framework, the fellowship offers both academic and professional value for those committed to strengthening global biosecurity. If you are an emerging scientist interested in international policy, life sciences, and global security, this programme provides a strong platform to advance your leadership journey. Apply by 5 March through this form . Source: https://www.disarmamenteducation.org/#/en/resources/type-41/project/764 The post Youth for Biosecurity Fellowship 2026: Fully Funded UNODA Programme for Young Scientists from the Global South appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Europe","Fellowship","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T13:17:45Z","updated_at":"2026-02-26T13:17:45Z"}
