{"id":"4c7bce20583e81af03f1188c4cbe0ba519f67d7d","title":"Effie Collegiate U.S. Program 2026: Paid Marketing Competition for U.S. College Students","url":"https://opportunitiesforyouth.org/2026/02/23/effie-collegiate-u-s-program-2026-paid-marketing-competition-for-u-s-college-students/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T13:00:35Z","summary":"The Effie Collegiate U.S. program is a premier opportunity for marketing students to gain hands-on, real-world experience by solving business challenges for leading global brands. Designed to inspire, educate, and engage future marketers, the program connects classroom learning with professional practice helping students develop strategies that deliver measurable results. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); For more than a decade, Effie Collegiate U.S. has partnered with major brands such as Bose , IBM , MINI , Subaru , Target , V8 , and Coca-Cola giving students the chance to tackle real marketing briefs and present their solutions to industry leaders. About the Effie Collegiate Program The Effie Collegiate experience is built around real brand challenges, where students work in teams to research, develop, and present strategic marketing campaigns. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Participants present their ideas to a panel of senior marketing professionals. Finalist teams are invited to pitch their campaigns directly to brand executives, with top teams receiving monetary prizes and national recognition. This immersive structure helps students bridge the gap between theory and practice while preparing them for successful careers in marketing and advertising. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Student Benefits Students who participate in Effie Collegiate U.S. gain: Real-world marketing experience working with major brands Practical application of classroom knowledge to real business challenges Professional feedback from experienced industry experts Networking opportunities with senior marketers and industry leaders The chance to win monetary awards and build a strong professional portfolio ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Professor Benefits The program also enhances teaching and curriculum development for marketing educators by providing: Access to real brand case studies and current marketing challenges A structured Effie framework that simplifies course integration Industry insights and trends to enrich classroom learning Supplementary teaching resources and materials Improved student engagement through applied learning projects ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 2026 Brand Challenge: UNA-USA For the Spring 2026 edition, Effie Collegiate U.S. is collaborating with UNA-USA (United Nations Association of the USA) . Students will design a culturally relevant campaign that demonstrates how UNA-USA improves lives and strengthens communities across the United States. This challenge gives students the opportunity to work on a mission-driven campaign that blends marketing strategy with social impact. Why You Should Apply The Effie Collegiate U.S. program offers a rare opportunity to gain practical marketing experience, develop industry-ready skills, and engage directly with leading brands and professionals. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Whether you are a student looking to launch your marketing career or a professor seeking to enhance your curriculum, this program provides the tools, experience, and exposure needed to succeed in today s competitive marketing landscape Eligibility Criteria The competition is open to: Full-time and part-time students Undergraduate and graduate students Portfolio and online program students Students enrolled at accredited U.S. colleges, universities, or educational institutions ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Key Dates Application Deadline: April 1, 2026 Program Period: Spring 2026 academic semester How to Apply To participate in the Effie Collegiate U.S. 2026 program, applicants should: Register for the program Download the Entry Kit Complete the Entry Form Sign and submit the NDA to access the official client brief ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); For more details about Competition opportunities, click HERE . The post Effie Collegiate U.S. Program 2026: Paid Marketing Competition for U.S. College Students appeared first on Opportunities for Youth .","tags":["education","Competition","America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T13:16:24Z","updated_at":"2026-02-23T13:16:24Z"}
{"id":"081dc9f4adf283d6e6c4ab69cbda6f391685fadb","title":"Outdoor Facilitation: Guiding in Nature 2026 in Chiang Mai, Thailand – Intensive 8-Day Certification Training for Emerging Outdoor Leaders","url":"https://opportunitiesforyouth.org/2026/02/23/outdoor-facilitation-guiding-in-nature-2026-in-chiang-mai-thailand-intensive-8-day-certification-training-for-emerging-outdoor-leaders/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T11:10:24Z","summary":"Outdoor Facilitation: Guiding in Nature is an intensive 8-day residential training program taking place from March 18 25, 2026 in a nature-rich setting near Chiang Dao, Chiang Mai, Thailand. Designed for aspiring outdoor facilitators, youth leaders, educators, and experiential learning practitioners, this immersive course provides a strong professional foundation in outdoor facilitation, leadership, safety, communication, and program design. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Organized by YEP Academy, the program blends practical outdoor skills with facilitation theory, self-management, and ethical leadership. Participants engage in a carefully structured journey that develops both technical competence and reflective capacity, enabling them to lead meaningful, safe, and transformative learning experiences in nature-based settings. Scholarship deadline: March 8, 2026 Program dates: March 18 25, 2026 Ticket sale deadline: March 13, 2026 ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Why Outdoor Facilitation Skills Matter Today As experiential education and nature-based learning gain global momentum, facilitators must move beyond basic outdoor survival skills. Modern outdoor leadership requires: Understanding of learning processes Ethical group facilitation Emotional intelligence Conflict management Risk assessment and safety integration Program design competence ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); This training addresses these needs holistically by combining experiential practice with conceptual frameworks. Program Overview Outdoor Facilitation: Guiding in Nature is structured as a professional starting point for individuals taking responsibility for groups outdoors. The course combines: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Core facilitation methods Outdoor awareness Self-management and resilience Program development strategies Group dynamics and communication tools Participants will explore critical questions such as: How do people learn and grow individually and collectively? What is the ethical responsibility of an outdoor facilitator? How can safety and awareness be integrated seamlessly into learning processes? How do facilitators manage emotions, feedback, and conflict in diverse groups? ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Learning Outcomes Participants will gain the ability to: Understand Learning and Facilitation Processes Apply core learning models Understand group development stages Differentiate facilitation from training and coaching Integrate emotional intelligence into practice Communicate and Manage Groups Effectively Practice active listening Use nonviolent communication Provide feedback and feedforward Recognize and manage conflict dynamics Create psychologically safe environments ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Facilitate Responsibly in Outdoor Settings Apply camp management fundamentals Conduct risk assessments Integrate first aid awareness Establish safety protocols Design and Deliver Outdoor Learning Programs Develop session agendas Structure experiential curricula Co-facilitate sessions Evaluate learning impact Program Structure and Daily Flow This 8-day, 7-night residential basecamp experience follows a rhythmic yet adaptive format. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Each day typically includes: Morning check-ins for intention setting Experiential outdoor activities Facilitation input sessions Guided practice sessions Reflection and feedback circles Evening sharing and integration The program adapts to environmental conditions and group development stages, modeling real-world facilitation flexibility. Location and Logistics Location: Nature-rich setting near Chiang Dao, Chiang Mai, Thailand Meeting time: March 18 at 2:00 PM Program concludes: March 25 at approximately 2:00 PM ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Participants set up tents upon arrival before formal sessions begin at 5:00 PM on the first day. Facilitator Lead Facilitator: Dirk Reber Dirk brings decades of experience in ecotherapy, outdoor education, and transformational facilitation. He oversees safety, curriculum design, supervision, and feedback throughout the program. Participant Cohort Size Minimum participants: 6 Maximum participants: 12 The small group size ensures personalized mentorship, deep experiential engagement, and strong community bonding. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Certification Participants receive a Certificate of Continuing Professional Development (CPD) upon successful completion. Requirements for certification: Full attendance Active engagement in sessions and reflections Advanced Certification Pathway: Participants may pursue Certified Outdoor Youth Facilitator (YEP) status through a mentored co-facilitation phase. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Those completing additional intensive journeys may earn the designation: International Nature Outdoor Youth Facilitator Leader (YEP) Safety and Risk Management Safety measures include: Pre-collected medical information Signed consent forms First-aid certified facilitators Accident insurance coverage up to USD 5,000 Location-specific risk assessments The program emphasizes basecamp immersion rather than high-risk adventure activities. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); What Is Included in the Program Fee All facilitation sessions Learning materials Accommodation (basecamp) Accident insurance Daily lunch Shared dinner ingredients Online preparation meeting What Is Not Included Travel costs Visa and vaccinations Personal outdoor equipment Optional gear rental fees Accommodation before/after program Scholarships 50% scholarships are available via donor-subsidy from the German Government. ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Eligibility: Citizens of ASEAN and SAARC countries Scholarship application deadline: March 8, 2026 Application submission: info@yep-academy.org Click here to apply for the mentioned scholarship. Ticket Price Standard Ticket: $890 (VAT included) Ticket sale ends: March 13, 2026 Contact Information Email: info@yep-academy.org Phone: +85512346825 Click here for more information about this event. For more global conference opportunities, visit here . The post Outdoor Facilitation: Guiding in Nature 2026 in Chiang Mai, Thailand – Intensive 8-Day Certification Training for Emerging Outdoor Leaders appeared first on Opportunities for Youth .","tags":["education","Conferences","Asia","Scholarships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T13:16:24Z","updated_at":"2026-02-23T13:16:24Z"}
{"id":"0ac62fc9f720684f49d28ae710de934bd569fed5","title":"YECAP Climate Impact Micro Grants 2026: Up to USD 2,000 for Youth-Led Climate Action in Asia-Pacific","url":"https://opportunitiesforyouth.org/2026/02/23/yecap-climate-impact-micro-grants-2026-up-to-usd-2000-for-youth-led-climate-action-in-asia-pacific/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T10:09:50Z","summary":"Applications are now open for the 2026 YECAP Climate Impact Micro Grants , an initiative under the Youth Empowerment in Climate Action Platform (YECAP) designed to support youth-led climate solutions across Asia and the Pacific. The programme provides catalytic funding to young changemakers implementing community-driven projects that advance climate adaptation, mitigation, and long-term resilience. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This funding opportunity aims to empower young leaders to design and scale practical climate initiatives that strengthen local systems, promote innovation, and advance inclusive climate action at the community level. About the YECAP Climate Impact Micro Grants The YECAP Climate Impact Micro Grants provide up to USD 2,000 per project to support youth-led initiatives addressing pressing climate challenges. The programme focuses on practical, locally driven solutions that deliver measurable impact and encourage youth participation in climate action. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Priority Project Areas Eligible projects should focus on one or more of the following themes: Low-carbon and climate mitigation initiatives Climate-resilient food, water, and community systems Nature-based and regenerative solutions Renewable energy and sustainable energy access Climate literacy and youth engagement Indigenous and local knowledge for environmental sustainability ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Projects must be implemented and fully reported before June 2026 . Eligibility Criteria Applicants must meet the following requirements: Must be based in one of the eligible YECAP-supported countries: Bangladesh, Nepal, Vietnam, Philippines, Indonesia, Mongolia, Pakistan, Samoa, Vanuatu, Papua New Guinea ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Projects must be youth-led (youth defined according to national definitions in the applicant s country). Eligible applicants include: Registered youth-led organizations Informal youth groups Youth-led social enterprises Preference will be given to ongoing initiatives or projects scaling existing work. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Application Deadline 23:59 (GMT+7), 9 March 2026 Apply here: https://forms.office.com/Pages/ResponsePage.aspx?id=Xtvls0QpN0iZ9XSIrOVDGR5YCUc6lbVCvAnkUrKGg9NUNEhXRjY5RTdKWlc4V05EU0hKS045OTczOC4u Grant Size and Project Duration Funding amount: Up to USD 2,000 per project Projects must begin promptly after selection. All activities must be completed before June 2026 . A final impact report must be submitted within two weeks after project completion. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Application Process Applications must be submitted in English . Only shortlisted applicants will be contacted via email. Submitting the form does not automatically collect personal details unless applicants provide them. For common questions about the application process, please reach out to shaan.gom@undp.org ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Application Deadline 23:59 (GMT+7), 9 March 2026 Apply here: https://forms.office.com/Pages/ResponsePage.aspx?id=Xtvls0QpN0iZ9XSIrOVDGR5YCUc6lbVCvAnkUrKGg9NUNEhXRjY5RTdKWlc4V05EU0hKS045OTczOC4u Why This Opportunity Matters Youth-led climate innovation plays a critical role in accelerating local adaptation and building resilient communities. The YECAP Climate Impact Micro Grants offer a valuable opportunity for young leaders to access seed funding, strengthen existing initiatives, and demonstrate scalable climate solutions that can inspire broader change across Asia and the Pacific. If you are leading a youth-driven climate initiative and looking for support to expand your impact, this grant programme provides a practical pathway to turn ideas into measurable climate action. The post YECAP Climate Impact Micro Grants 2026: Up to USD 2,000 for Youth-Led Climate Action in Asia-Pacific appeared first on Opportunities for Youth .","tags":["education","Asia","Australia and Oceania"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T13:16:24Z","updated_at":"2026-02-23T13:16:24Z"}
{"id":"f256202a549a2419607521a22f82fb5a231140a6","title":"Paid UN Graduate Opportunities 2026: UNIDIR Arms Control & Security Research Positions","url":"https://opportunitiesforyouth.org/2026/02/23/paid-un-graduate-opportunities-2026-unidir-arms-control-security-research-positions/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T09:13:18Z","summary":"Are you passionate about international peace, security, and disarmament? The United Nations Institute for Disarmament Research (UNIDIR) is offering two Graduate Professional positions under its Conventional Arms and Ammunition Programme . This is a unique opportunity to contribute to global efforts aimed at reducing arms-related violence while gaining hands-on research and policy experience. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Programme Overview UNIDIR is an autonomous research institute within the United Nations system dedicated to advancing ideas and actions that promote sustainable peace and security . Based at the Palais des Nations in Geneva , Switzerland , UNIDIR conducts cutting-edge research on disarmament and international security. Its Conventional Arms and Ammunition Programme focuses on preventing the misuse and proliferation of arms and ammunition through research, policy advice, and multi-stakeholder engagement. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Available Positions UNIDIR is recruiting two Graduate Professionals : Research Pillar 2: Preventing Armed Conflict and Armed Violence (PACAV) Location: Remote Focus: Preventing armed violence and conflict through research and policy engagement ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Exploratory Research Cell (ERC) Location: Geneva, Switzerland Focus: Addressing emerging global and local ( glocal ) security and development challenges ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Applicants are encouraged to indicate their preferred position in their application. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Key Details Application Deadline: 2 March 2026 Start Date: 20 April 2026 (negotiable) Duration: 6 months Work Rate: Full-time (100%, negotiable) Contract Type: Temporary Stipend Benefits Graduate Professionals receive a monthly stipend to support living costs: USD 1,331 per month (in-person, Geneva-based role) USD 665.50 per month (remote role) ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Please note: Selected candidates are responsible for travel, visa, insurance, and accommodation costs . Key Responsibilities As a Graduate Professional, you will: Conduct background research and policy analysis Support programme activities such as meetings, workshops, and conferences Assist in project coordination, documentation, and monitoring Provide general administrative and research support Contribute to reports, briefs, and knowledge products Required Skills Competencies Ideal candidates should demonstrate: Strong research, writing, and presentation skills Ability to synthesize complex information into clear briefs Excellent organizational and coordination abilities Proficiency in Microsoft Office and design tools (e.g., InDesign) Effective communication and teamwork skills ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Additional Assets Knowledge of conventional arms control or disarmament Experience in data collection and analysis Understanding of gender mainstreaming Interest in UN peace and security work UN Core Competencies Candidates are expected to embody the UN s core values: Professionalism Integrity Respect for Diversity Additional competencies include communication, teamwork, planning and organization, creativity, and client orientation. Why Apply? This UNIDIR Graduate Professional opportunity offers: Direct exposure to international peace and security policy Practical experience within a United Nations research institute Opportunities to engage with global experts and policymakers A pathway into careers in disarmament, diplomacy, and international development ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Eligibility Criteria To qualify, applicants must: Have recently graduated (within one year) with a relevant university degree; or Be currently enrolled in a graduate-level programme ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Preferred academic backgrounds include: Politics International Relations Peace Conflict Studies Security Studies International Law Language Requirements Fluency in English (required) Knowledge of French or Spanish (desirable) Screening Questions to Prepare For Applicants should be ready to explain: Their eligibility for the Graduate Professional Programme Their English language proficiency Their research experience and skills Their proficiency in Microsoft Office and design tools Their organizational and multitasking abilities ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); How to Apply Submit your application HERE and clearly indicate your preferred placement (Remote PACAV or Geneva-based ERC). Pro Tip for Applicants Tailor your application to demonstrate clear interest in disarmament and conventional arms control . Highlight any academic research, coursework, or projects that align with peace, conflict, or security studies , even if you don t have formal work experience. If you re ready to contribute to a safer and more secure world while gaining valuable UN experience, this UNIDIR Graduate Professional Programme is an excellent opportunity to launch your international policy career. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Discover more Graduate opportunities HERE. The post Paid UN Graduate Opportunities 2026: UNIDIR Arms Control Security Research Positions appeared first on Opportunities for Youth .","tags":["education","Internships","Africa","America","Asia","Australia and Oceania","Continent","Europe","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T13:16:24Z","updated_at":"2026-02-23T13:16:24Z"}
{"id":"f1adf68379754615c3b434a5df1d016e93b9809e","title":"GovAI Summer Fellowship 2026 in Washington DC: $21,000 AI Policy Fellowship (Apply by March 1)","url":"https://opportunitiesforyouth.org/2026/02/23/govai-summer-fellowship-2026-in-washington-dc-21000-ai-policy-fellowship-apply-by-march-1/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T09:10:24Z","summary":"Applications are now open for the 2026 Summer Fellowship hosted by GovAI , a nonprofit organization dedicated to advancing effective and responsible AI governance. The three-month, in-person program in Washington, DC offers aspiring and established professionals a unique opportunity to conduct independent AI policy research while earning a competitive stipend. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); If you re looking to break into or accelerate your career in U.S. AI policy, this fellowship could be your next big step. Fellowship Overview The GovAI DC Fellowship runs from June 8 to August 28, 2026 , in Washington, DC. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); What Fellows Receive $21,000 total stipend ($7,000 per month) Travel support Mentorship from leading AI policy experts Access to high-level policy networks in Washington, DC Fellows conduct independent research on an AI governance topic of their choice. Outputs may include: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); White papers Journal articles Policy reports Op-eds targeted at decision-makers The program begins with a two-week exploration phase, during which fellows survey the AI policy landscape before refining a research proposal with guidance from their supervisor. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Throughout the fellowship, participants engage in: Expert Q A sessions Hands-on policy workshops Peer feedback discussions Networking events with policymakers and researchers Who Should Apply? GovAI emphasizes that the fellowship is bipartisan , bringing together participants from diverse political perspectives to address shared AI governance challenges. They are seeking applicants who demonstrate: Strong analytical reasoning Clear and persuasive writing Relevant subject-matter expertise Good professional judgment Openness to feedback ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Eligible Backgrounds The program welcomes: Early-career professionals (including undergraduates) Mid-career professionals Individuals transitioning from related fields such as: Public policy Computer science Economics Cybersecurity China studies Risk management There are no strict degree requirements , making this fellowship accessible to a wide range of applicants with strong intellectual ability and interest in AI governance. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Critical Eligibility Requirement Applicants must already have legal authorization to work in the United States through August 28, 2026 . GovAI does not sponsor visas. Application Process The selection process consists of four stages: Written application Abstract reasoning assessment Paid remote work test Interviews and reference checks Key Dates Application Details Deadline: Sunday, March 1, 2026 at 11:59 PM ET Location: Washington, DC (In-person) Duration: June 8 August 28, 2026 Stipend: $21,000 ($7,000/month) ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Apply HERE About GovAI GovAI researches AI governance risks and advises decision-makers in both industry and government. Its team and alumni have worked across: U.S. government bodies (NSC, OSTP, Senate, Commerce, DHS) European institutions (EU AI Office, UK AI Security Institute) Leading think tanks such as CSIS , CSET , and RAND Corporation Frontier AI companies including OpenAI , Anthropic , and DeepMind ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); This fellowship provides unparalleled exposure to the institutions shaping AI governance at the highest levels. For aspiring AI policy leaders, the GovAI Summer Fellowship offers a rare combination of funding, mentorship, policy access, and real-world impact all in the heart of Washington, DC. Discover more Fellowship opportunities HERE . The post GovAI Summer Fellowship 2026 in Washington DC: $21,000 AI Policy Fellowship (Apply by March 1) appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Fellowship","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T13:16:24Z","updated_at":"2026-02-23T13:16:24Z"}
{"id":"9856c2cd58bdcb749d03da2502d1515aea72b926","title":"Carnegie Ethics Fellowship 2025–2027: Two-Year Global Leadership Program in Ethical Decision-Making and International Affairs","url":"https://opportunitiesforyouth.org/2026/02/23/apply-now-for-the-carnegie-ethics-fellowship/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T09:00:55Z","summary":"The Carnegie Ethics Fellowship is a prestigious two-year leadership development program hosted by the Carnegie Council for Ethics in International Affairs in New York City. Designed for talented young professionals across sectors, the fellowship cultivates values-driven leadership in an era defined by geopolitical uncertainty, technological transformation, and global economic change. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); As ethical leadership becomes increasingly central to business, public policy, academia, and civil society, the Carnegie Ethics Fellowship provides a structured space for emerging leaders to deepen their understanding of responsible decision-making while collaborating on high-impact global projects. About the Carnegie Council for Ethics in International Affairs The Carnegie Council for Ethics in International Affairs is a globally respected institution dedicated to advancing ethics in global policy, governance, and leadership. Through research, public programming, publications, and fellowships, the Council connects ethical theory with real-world international decision-making. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The Carnegie Ethics Fellowship is one of the Council s flagship initiatives, aligning young leaders with a powerful global network committed to reflective right action in public and private life. Fellowship Duration and Structure The Carnegie Ethics Fellowship runs for two years and is structured around leadership development, curated curriculum modules, collaborative projects, and thought leadership opportunities. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Rather than functioning as a traditional academic program, the fellowship blends professional development, ethical inquiry, and applied policy engagement. Fellows engage in: Curated leadership modules Interdisciplinary collaboration Research and policy discussions Project development Public engagement and publication ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Core Objectives of the Fellowship The program aims to: Develop ethical leadership capacity among emerging professionals Strengthen multilateral cooperation through ethical dialogue Align power and decision-making with reflective responsibility Foster cross-sector collaboration Build a lasting community of values-driven leaders The fellowship recognizes that ethical leadership is not theoretical. It must operate in complex, real-world contexts across business, government, and global institutions. Key Fellowship Benefits 1. Leadership Cohort Experience Fellows join a carefully selected leadership cohort embedded within Carnegie Council s broader networks, including: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Expert networks Affiliate networks Alumni networks Global ethics communities This ecosystem provides mentorship, collaboration, and long-term engagement opportunities. 2. Tailored Two-Year Curriculum The fellowship curriculum includes sponsored and endorsed development modules focused on: Ethical decision-making Responsible leadership International cooperation Technology governance Social justice Climate ethics ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Modules are curated by Carnegie Council and partner institutions to ensure intellectual rigor and real-world relevance. 3. Custom Networking and Events Fellows participate in curated events that foster meaningful engagement across industries and disciplines. The program provides: Cross-sector networking opportunities Deep discussion forums Institutional engagement Exposure to policymakers, academics, and business leaders ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); 4. Thought Leadership Platform Fellows collaborate with Carnegie Council to produce: Articles and essays Policy briefs Public event presentations Published research This platform allows Fellows to reach a global audience while shaping conversations in international affairs. Examples from the 2023 2025 Cohort The inaugural cohort completed significant projects addressing contemporary ethical challenges. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Artificial Intelligence and Election Integrity Explored how AI technologies influenced democratic processes as billions voted globally in 2024. Ethical AI in Education and Healthcare Examined moral frameworks governing AI deployment in education and medical systems. Climate Migrant Bill of Rights Analyzed ethical obligations toward individuals displaced by climate change. Child Poverty in the United States Investigated structural inequality and policy solutions through an ethical lens. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); These projects culminated in a four-part Symposium at Carnegie Council s Global Ethics Hub in February 2025. Who Should Apply The Carnegie Ethics Fellowship is designed for young professionals working in: Business Government Academia Non-governmental organizations International affairs Policy institutions ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Ideal candidates demonstrate: Commitment to ethical leadership Professional excellence Cross-sector engagement interest Capacity for reflective decision-making Desire to contribute to global dialogue Why Ethical Leadership Matters Now In an era defined by: Artificial intelligence disruption Climate-induced migration Economic inequality Geopolitical instability Leaders must balance innovation with ethical responsibility. The Carnegie Ethics Fellowship prepares participants to: Navigate moral dilemmas Lead with integrity Shape responsible institutions Influence public discourse ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Location Carnegie Council Global Ethics Hub 170 East 64th Street New York, NY 10065 United States How to Apply Application portal: https://www.carnegiecouncil.org Visit HERE to learn more about the Carnegie Ethics Fellowship programme. Discover more global fellowship opportunities on OFY HERE . The post Carnegie Ethics Fellowship 2025–2027: Two-Year Global Leadership Program in Ethical Decision-Making and International Affairs appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Continent","Europe","Fellowship","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T13:16:24Z","updated_at":"2026-02-23T13:16:24Z"}
{"id":"612b2d3191626d0aa0a84eac852c08c6e558c36e","title":"Swiss Fellowship for Inclusive Development 2026: Graduate Opportunity at AUC","url":"https://opportunitiesforyouth.org/2026/02/23/swiss-fellowship/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T08:52:09Z","summary":"The Swiss Fellowship for Inclusive Development (SFID) at The American University in Cairo (AUC) provides a fully funded opportunity for Egyptian nationals to pursue graduate-level study in public administration or public policy . This fellowship is designed to support students with strong academic records who are committed to advancing inclusive governance, public service, and policy development in Egypt. By providing financial coverage and structured engagement opportunities, the fellowship enables students to focus on learning, skill-building, and professional growth while contributing to meaningful public policy initiatives. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The SFID fellowship covers essential academic and support costs for a full year of study, including tuition for up to nine credits per semester , student services and activities fees , and medical service and health insurance . This comprehensive support ensures that fellows can dedicate themselves fully to their graduate diploma studies, without the distraction of financial concerns. The fellowship is awarded for two semesters , with a review at the end of the first semester to confirm satisfactory academic progress. This approach allows AUC to ensure that fellows are meeting program expectations while maintaining high standards of academic excellence. Who Can Apply Eligibility for the Swiss Fellowship is focused on Egyptian nationals who are newly admitted to graduate study at AUC. Applicants must meet all admissions requirements for the graduate diploma programs in public administration or public policy . Continuing students who wish to retain the fellowship must maintain a minimum GPA of 3.2 . All fellowship recipients are required to be enrolled full-time to qualify for financial support. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The Swiss fellowship targets individuals who are committed to public service and inclusive development. Applicants should demonstrate both academic capability and a genuine interest in contributing to governance, policy analysis, or public administration initiatives. The program s structure encourages fellows to integrate classroom learning with practical experience in Egypt s policy environment. Opportunities and Career Impact Fellows who complete the graduate diploma program are positioned to continue their studies toward an MPA (Master of Public Administration) or MPP (Master of Public Policy) degree, though fellowship funding is limited to the diploma program. The Swiss Fellowship provides a strong foundation for students who wish to pursue careers in public administration, policy analysis, governance reform, and inclusive development initiatives. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Through its combination of academic rigor, financial support, and experiential learning, the fellowship equips recipients with both theoretical knowledge and practical skills. Fellows gain insight into policymaking processes, project management, and inclusive development strategies, preparing them to contribute effectively to Egypt s governance and public service landscape. Responsibilities of Fellows In addition to academic requirements, fellows are expected to actively engage with the AUC community and participate in hands-on initiatives. Responsibilities include: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Enrolling full-time in the eligible graduate diploma program Maintaining a minimum GPA of 3.2 throughout the fellowship Completing at least 12 working hours per week with the Public Policy HUB , where fellows gain practical experience in policy-related projects Responding to reporting requests and participating in fellowship events as required by AUC ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); These responsibilities are designed to ensure that fellows gain professional experience in addition to academic knowledge. By contributing to the Public Policy HUB, fellows learn to apply their coursework to real-world public policy challenges, preparing them for leadership roles in government, civil society, or international development. How to Apply Applicants must complete two steps to be considered for the fellowship: Submit an application for graduate admission to AUC, ensuring they meet all program requirements for the public administration or public policy graduate diploma programs. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Submit the SFID online fellowship application through AUC s official platform. The fellowship cycle for Fall 2026 is open from April 2, 2026 until May 3, 2026. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Learn more and apply by clicking this link. The fellowship is a unique opportunity for Egyptian graduate students to access high-quality education, gain professional experience, and develop the skills necessary for leadership roles in public policy and inclusive development. By combining academic study with hands-on engagement through the Public Policy HUB, recipients graduate with both knowledge and practical experience, enabling them to make meaningful contributions in their careers. Looking for more opportunities? Check out the Opportunities for Youth website. The post Swiss Fellowship for Inclusive Development 2026: Graduate Opportunity at AUC appeared first on Opportunities for Youth .","tags":["education","Africa","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T13:16:24Z","updated_at":"2026-02-23T13:16:24Z"}
{"id":"9f5d03695dbd7e86e685fb8c3cb3004f5883543c","title":"dsm-firmenich Progress Foundation Scholarship 2026: Empowering Young Changemakers","url":"https://opportunitiesforyouth.org/2026/02/23/dsm-firmenich-progress-foundation-scholarship-2026-empowering-young-changemakers/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T07:29:40Z","summary":"Applications are now open for the dsm-firmenich Progress Foundation Scholarship 2026 , offering young leaders an opportunity to attend the One Young World Summit in Cape Town, South Africa, from 3 6 November 2026 . The scholarship supports emerging entrepreneurs making a measurable impact in their communities, driving sustainable solutions for a better future. The application deadline is 23 March 2026 . ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the dsm-firmenich Progress Foundation Scholarship At dsm-firmenich, the belief that capability comes with responsibility drives their mission to create lasting societal impact. Through the dsm-firmenich Progress Foundation , the organisation empowers communities, supports innovation, and nurtures the next generation of global changemakers. The foundation offers five young leaders the chance to join the One Young World Summit, a platform connecting youth from across the globe to share ideas, build networks, and drive positive change. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Focus Areas The scholarship targets entrepreneurs creating impact in one of three critical areas: Fighting Malnutrition Initiatives that address micronutrient deficiencies, ensuring high-quality, nutritious food reaches vulnerable populations. Strengthening Community Resilience Projects that reduce social inequality and improve community capacity to overcome challenges. Protecting and Restoring Ecosystems Efforts that promote climate action, biodiversity conservation, and water system protection to build nature s resilience. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Applicants work should demonstrate measurable impact in these areas, whether at a local, regional, or global scale. Eligibility Criteria To apply, candidates must: Be aged 18 30 (exceptions may be considered for older candidates with significant personal impact). Reside in Africa, Asia-Pacific, or Latin America . Have 3 5 years of business experience , ideally running their own enterprise. Be actively making a positive impact in one of the three scholarship focus areas. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Candidates under 18 at the time of the summit are not eligible. Applications from those over 30 will be considered if they demonstrate initiative, measurable impact, and engagement potential. What the Scholarship Provides Selected scholars will receive: Full participation at the One Young World Summit 2026 . Opportunities to network with global peers and industry leaders. Exposure to expert mentorship and practical workshops. Recognition as a dsm-firmenich Progress Foundation scholar, strengthening professional credibility and visibility. All associated program costs, including summit registration, travel, and accommodation, are covered for selected participants, ensuring inclusivity and access regardless of financial background. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Application Process and Deadline Applications for the 2026 cohort are now open. Prospective scholars should submit their online applications, detailing their achievements, impact, and alignment with one of the three focus areas. The application deadline is 23 March 2026 . Successful applicants will be notified following a competitive review process conducted by the foundation and One Young World teams. A Platform for Global Change The dsm-firmenich Progress Foundation Scholarship is more than a summit ticket. It is an opportunity for young entrepreneurs to amplify their impact, exchange ideas with global peers, and access resources that can accelerate their initiatives. By investing in young changemakers, the foundation fosters a new generation of leaders capable of creating sustainable, systemic change in communities worldwide. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Through this scholarship, dsm-firmenich continues its commitment to building a future where innovation, sustainability, and social responsibility intersect, empowering youth to translate ideas into meaningful action. Application Deadline: 23 March 2026 Summit Dates: 3 6 November 2026, Cape Town, South Africa Application can be accessed from here . To know more about such opportunities, click here . The post dsm-firmenich Progress Foundation Scholarship 2026: Empowering Young Changemakers appeared first on Opportunities for Youth .","tags":["education","Africa","Scholarships","community resilience","dsm-firmenich Scholarship 2026","ecosystem protection","fighting malnutrition","One Young World Summit","social impact entrepreneurs","young leaders"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T13:16:24Z","updated_at":"2026-02-23T13:16:24Z"}
{"id":"59fa4aa2b9cc26e446ec5f930bc967e427db1a04","title":"Ed Bradley Journalism Fellowship 2026: Intensive Summer Workshop at NYU","url":"https://opportunitiesforyouth.org/2026/02/23/ed-bradley-journalism-fellowship-2026-intensive-summer-workshop-at-nyu/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T07:24:30Z","summary":"Applications are now open for the Ed Bradley Journalism Fellowship Summer 2026 , hosted by the New York University Arthur L. Carter Journalism Institute in partnership with the Dow Jones News Fund. This one-week intensive workshop in New York City brings together a select cohort of college journalists for mentorship, hands-on training, and newsroom experience. The deadline to apply is March 1, 2026 . ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the Ed Bradley Journalism Fellowship The Ed Bradley Fellowship was created to address the under-representation of African-American males in U.S. newsrooms. By fostering awareness of this disparity and encouraging diverse allies to participate, the program aims to promote equitable representation in journalism. The fellowship welcomes all U.S. college students who share this mission, regardless of identity or background, provided they have completed their freshman year by summer 2025 . Twenty students will be selected from a competitive pool for the June 2026 workshop. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); All program costs, including instruction, housing, meals, and transportation to New York City, are fully covered to ensure economic diversity among participants. Program Dates and Location The fellowship will take place from June 8 14, 2026 , at NYU s East Village campus. Students will live in NYU dorms and experience life in one of the country s most vibrant cities for journalism. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); What Fellows Will Experience Participants in the Ed Bradley Fellowship will gain practical skills and industry exposure through: Hands-on training in reporting, news writing, and multimedia journalism led by NYU faculty and visiting professionals. Visits to top newsrooms , including The New York Times, CNN, Dow Jones, The Wall Street Journal, ESPN, Slate, CBS New York, ProPublica, MSNBC, and NBC News. Opportunities to report and produce original stories , published on the program s website and social media platforms. Networking with industry professionals as part of the Dow Jones News Fund network. Experiencing life away from home in New York City, fostering independence and collaboration. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); This immersive program equips fellows with practical skills, professional contacts, and an understanding of newsroom culture. Eligibility Criteria Applicants must meet the following requirements: U.S. college student who supports the fellowship s mission to increase representation of Black males in journalism. Completed freshman year by summer 2025 . Willingness to participate fully in the one-week workshop in June 2026. All applicants will be reviewed through a competitive selection process, with decisions communicated in early April 2026 . Admitted students attend the program at no cost. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Application Process Applicants must submit the online application by the deadline: March 1, 2026 . Complete applications should clearly convey the applicant s interest in journalism, commitment to equity, and enthusiasm for gaining practical skills. Incomplete submissions or late applications will not be considered. For additional questions, applicants may contact the program team via email and are encouraged to respond promptly to any information requests from the review committee. A Unique Opportunity for Aspiring Journalists The Ed Bradley Fellowship provides a rare chance for college students to gain mentorship, hands-on experience, and access to some of the country s top journalists. Participants will leave the program with enhanced reporting skills, industry connections, and a deeper understanding of newsroom practices. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); By addressing inequities in representation and fostering talent from diverse backgrounds, the fellowship continues the legacy of Ed Bradley , a trailblazing journalist committed to excellence and inclusivity. Deadline to apply: March 1, 2026 Program Dates: June 8 14, 2026 Application can be accessed from here . To know more about such opportunities, click here . The post Ed Bradley Journalism Fellowship 2026: Intensive Summer Workshop at NYU appeared first on Opportunities for Youth .","tags":["education","America","Fellowship","Black male journalists","college journalism workshop","Dow Jones News Fund","Ed Bradley Fellowship","journalism mentorship","NYU Journalism 2026","summer journalism program"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T13:16:24Z","updated_at":"2026-02-23T13:16:24Z"}
{"id":"4df74c4368e781f02025c689385eff88b7531cdc","title":"SENSE Foundation Brussels Grants 2026: Supporting Science, Health, and Sustainable Development","url":"https://opportunitiesforyouth.org/2026/02/23/sense-foundation-brussels-grants-2026-supporting-science-health-and-sustainable-development/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T07:19:56Z","summary":"The SENSE Foundation Brussels is inviting applications for its 2026 grants, offering financial support to non-profit organisations and students in Belgium and abroad. The grants aim to fund projects that promote scientific research, environmental protection, sustainable development, and health initiatives, with a particular focus on genetics and nutrition. Applications are open now, with deadlines set for 5 PM CEST, 30 April 2026 , and 5 PM CEST, 30 September 2026 . ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the SENSE Foundation Brussels Founded to advance science and education while preserving nature and health, the SENSE Foundation Brussels supports projects, initiatives, and research efforts that align with its core objectives. The Foundation also promotes inclusion, equality, and diversity, placing special emphasis on projects led by women or benefiting minority groups. Student grants often favour Women in STEM (Science, Technology, Engineering, Mathematics). The Foundation provides one-off contributions, usually covering up to 25% of the total project costs, with a maximum grant amount of 25,000. Of this, up to 10% may be allocated to overhead costs, ensuring that funds primarily support project activities. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Who Can Apply Eligible applicants include legally registered non-profits with at least two years of operation and a track record of 24 months or more. Organisations registered after 1 January 2024 are not eligible. Projects should last 9 12 months , implemented between summer 2026 and summer 2027, although shorter grants can be part of multi-year initiatives. Only one application per calendar year per organisation will be accepted. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Focus Areas and Funding Priorities Projects must align with the Foundation s objectives, including: Scientific research in genetics or nutrition Environmental protection and sustainable development Health-related initiatives (excluding mental health as a priority) Student support through merit- and need-based scholarships Charitable assistance for temporary hardship Projects that demonstrate impact, sustainable approaches, and alignment with inclusion, equality, and diversity values will be prioritised. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); What the Fund Supports The SENSE Foundation s grant can cover: Staff costs directly linked to the project Project-related materials, equipment, and operational expenses Initiatives that enhance visibility, engagement, or outreach The grant cannot support projects with excessive overheads (over 20%), political or religious affiliations, commercial sponsorships, or previously rejected applications. Application Deadlines The Foundation has two annual deadlines for submissions: First round: 5 PM CEST, 30 April 2026 decisions communicated during the summer Second round: 5 PM CEST, 30 September 2026 decisions communicated by end of December 2026 ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Applicants must ensure submissions are complete, clearly describing the project s goals, target beneficiaries, expected outcomes, and how the grant will be used effectively. Selection and Reporting Process All applications undergo an initial review by the Foundation Team for completeness and alignment with objectives. Valid submissions are then assessed by the Steering Committee, focusing on project impact, methodology, and sustainability. Selected beneficiaries will receive a grant agreement , with funds transferred within 30 days of signature. Projects must submit an impact report in English by October/November 2027, detailing outcomes and the use of funds. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); A Chance to Advance Science and Social Good The SENSE Foundation Brussels grants offer a strategic opportunity for organisations and students to implement meaningful, high-impact projects. With clear deadlines, structured support, and a focus on inclusion and sustainable outcomes, applicants are encouraged to propose innovative solutions that address pressing challenges in science, health, and environmental protection. Deadline Reminder: 30 April 2026 (first round) and 30 September 2026 (second round). Application can be accessed from here . To know more about such opportunities, click here . The post SENSE Foundation Brussels Grants 2026: Supporting Science, Health, and Sustainable Development appeared first on Opportunities for Youth .","tags":["education","Europe","Grants","environmental projects","health research funding","science grants 2026","SENSE Foundation Brussels","student scholarships","sustainable development","Women in STEM"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T13:16:24Z","updated_at":"2026-02-23T13:16:24Z"}
