{"id":"89d5d29efd50d875810de32b96a0b81a5faa9b68","title":"Women’s Congressional Staff Foundation Scholarship 2026: Applications Now Open","url":"https://opportunitiesforyouth.org/2026/02/26/womens-congressional-staff-foundation-scholarship-2026-applications-now-open/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T05:10:36Z","summary":"The Women s Congressional Staff Foundation Scholarship (WCSF) aims to create the path to a career on Capitol Hill, when for many women, especially those from middle- and low-income backgrounds, the financial burden of living and working in Washington, D.C., can put these opportunities out of reach. Through its 2026 Scholarship Program, the Foundation is once again supporting aspiring female staffers and working to create a more equitable and inclusive workplace on Capitol Hill. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Applications for the summer 2026 scholarship are open now , with all materials due no later than 11:59 PM EST on April 15, 2026 . ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Supporting Women With Women s Congressional Staff Foundation Scholarship The WCSF Scholarship is designed to ensure that more women from diverse backgrounds are able to access congressional internships positions that often serve as the entry point for long-term legislative careers. The Foundation s mission centers on broadening representation, elevating women s voices, and ensuring that the experiences of women inform the policymaking process from the very beginning. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Beyond financial support, scholarship recipients gain access to a valuable professional network. Members of the WCSF Board provide mentorship, career guidance, and connections that can shape a recipient s long-term trajectory in public service. Why This Scholarship Matters Interning on Capitol Hill is an exciting opportunity, but it can also be financially demanding. The cost of housing, transportation, and basic living expenses in D.C. can quickly add up making internships inaccessible for many talented women. WCSF seeks to remove this barrier by ensuring that a student s economic background does not define her ability to serve. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); By supporting early-career women at this pivotal stage, the Foundation strengthens the pipeline of future congressional staffers and leaders. Many previous recipients have gone on to full-time roles in congressional offices, political communications, public policy, and advocacy organizations. The program is not only empowering individuals it is reshaping the landscape of representation on Capitol Hill. Deadline and Selection Timeline All application materials must be submitted by Wednesday, April 15, 2026, at 11:59 PM EST . Finalists will then be contacted to schedule interviews with members of the selection committee. Final scholarship awards will be announced no later than May 24, 2026 . Applications are reviewed on a rolling basis, and candidates are strongly encouraged to apply early. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Eligibility Requirements To qualify, applicants must already have applied for an internship with a congressional office whether with a Member, Delegate, or Resident Commissioner of Congress, or with a U.S. Senate or House committee, caucus, or leadership office based in Washington, D.C. Confirmation of the internship will be required before the scholarship funds are awarded. Applicants must identify as a woman, be at least 18 years old, and hold a diploma from an accredited high school. What the Selection Committee Looks For The WCSF committee evaluates applicants holistically, placing high priority on: ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Demonstrated financial need, including anticipated expenses related to the internship A clear connection between the internship and academic or professional goals Applications submitted for high-responsibility internships Strong writing, references, and overall application quality A solid academic track record Program Expectations Scholarship recipients are expected to complete the full internship described in their application. Withdrawing early or misrepresenting financial need may require forfeiture or repayment of funds, except in extraordinary circumstances approved by the Foundation s board. The award is tied to the specific internship listed in the application and cannot be transferred. Empowering Women on Capitol Hill Through mentorship, financial assistance, and long-term professional support, the Women s Congressional Staff Foundation is shaping the future of equitable leadership in Washington, D.C. The 2026 scholarship cycle is an opportunity for emerging women leaders to take their first steps toward meaningful service and impact. Women pursuing internships on Capitol Hill are encouraged to apply before April 15, 2026 , and begin a journey that could define their careers for years to come. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Application can be accessed here . To know more about such opportunities, click here . The post Women’s Congressional Staff Foundation Scholarship 2026: Applications Now Open appeared first on Opportunities for Youth .","tags":["education","America","Scholarships","congressional internships","financial aid for students","public service careers","scholarships 2026","Washington DC opportunities","women empowerment","women in politics"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"c1ef9b112a5534cb44cdc67ee9f83b53efee4052","title":"Human-Centred Conservation Storytelling Grant: Empowering Journalism Rooted in Real People and Real Landscapes","url":"https://opportunitiesforyouth.org/2026/02/26/human-centred-conservation-storytelling-grant-empowering-journalism-rooted-in-real-people-and-real-landscapes/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T05:01:44Z","summary":"The Human-Centred Conservation Storytelling Grant invites experienced journalists and storytellers to rethink how conservation narratives are shaped, told, and understood. Too often, global conversations around conservation focus solely on wildlife or landscapes, overlooking the people whose lives are inextricably tied to ecological outcomes. This grant seeks to transform that narrative. By supporting high-quality, publishable stories that centre human realities in African conservation contexts, the program aims to elevate storytelling that is nuanced, responsible, and grounded in lived experiences. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About Human-Centred Conservation Storytelling Grant Conservation is never just about ecosystems; it is about the people who sustain, live within, and depend on them. The grant responds to a pervasive issue in public storytelling: narratives are frequently simplified, romanticised, or disconnected from crucial social, political, and economic dynamics. This initiative challenges that pattern by commissioning stories that reflect complexity rather than gloss over it. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Human-Centred Conservation places people at the heart of every story. It considers how rights, livelihoods, governance systems, and cultural relationships shape outcomes on the ground. From land-use decisions to resource access, from coexistence with wildlife to health and economic pressures, the approach recognises that conservation is deeply intertwined with daily realities. Stories supported through this grant may highlight successful models that empower local communities or reveal what happens when people are excluded from decision-making. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); What Kind of Stories Will Be Supported? The grant seeks strong, original ideas rooted in rigorous reporting and thoughtful examination. Ideal stories acknowledge that conservation is not linear. They explore where human-centred approaches drive positive change, where they fall short, and where tensions and trade-offs define everyday life. This includes stories that: Showcase innovation, resilience, and hope led by communities Illuminate challenges, contradictions, or unintended consequences Investigate governance, livelihoods, coexistence with wildlife, food systems, or climate adaptation Highlight land-use decisions shaped by cultural, economic, or political pressures There is no prescribed angle or format, allowing storytellers to work across print, film, photography, or audio. What matters is editorial maturity, depth, and respect for complexity. This grant is specifically designed for creators who already work to professional publishing standards and can deliver work suitable for established media platforms. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); What Will Not Be Funded To maintain high editorial integrity, the grant will not support promotional content, advocacy material, or simplified wildlife stories lacking a human focus. Narratives that present conservation as universally successful or universally failing, without acknowledging lived conditions and context, also fall outside the program s scope. Additionally, proposals requiring significant development support or capacity-building are unlikely to be selected, as this opportunity is intended for experienced professionals. Funding Tiers and What Applicants Can Expect Applicants may apply for one of three funding tiers: Tier 1: Up to USD 5,000 Tier 2: Up to USD 8,000 Tier 3: Up to USD 12,000 Budgets must be realistic and proportional to the proposed story. The application process requires a concise pitch, previous work samples, details on likely publication or broadcast pathways, and a summary budget. Selection Criteria and Review Process A selection panel will evaluate applications based on the clarity and quality of the pitch, alignment with Human-Centred Conservation principles, evidence of professional experience, and feasibility of the budget. Not all eligible applications will receive funding, making clarity and originality crucial. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Key Dates Applications open: 1 February 2026 Deadline: 23:59 GMT on 8 March 2026 Applicants with questions may contact the organising team, though individual feedback on proposals will not be provided. A Commitment to Thoughtful, People-Centred Storytelling The Human-Centred Conservation Storytelling Grant underscores a powerful truth: conservation cannot succeed without understanding the people who shape and are shaped by it. By supporting storytellers who elevate these human dimensions, the program aims to contribute to more informed, inclusive, and impactful global conversations on conservation. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Application can be accessed from here . To know more about such opportunities, click here . The post Human-Centred Conservation Storytelling Grant: Empowering Journalism Rooted in Real People and Real Landscapes appeared first on Opportunities for Youth .","tags":["education","Africa","Grants","Africa environmental reporting","climate and governance","community livelihoods","conservation storytelling","human-centred conservation","journalism grant 2026","wildlife coexistence"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"3a4a039d4f65e6dfc71a19a92cc6e7d223574d74","title":"Smithsonian Young Ambassadors Program 2026: A Transformative Leadership Opportunity","url":"https://opportunitiesforyouth.org/2026/02/26/smithsonian-young-ambassadors-program-2026-a-transformative-leadership-opportunity/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T04:54:39Z","summary":"The Smithsonian Young Ambassadors Program (YAP) returns in 2026 with another year of transformative learning, cultural exploration, and leadership development. Hosted by the National Museum of the American Latino, this nationally recognized program empowers rising high school seniors across the United States and Puerto Rico to become community-conscious leaders through exposure to the Smithsonian s world-class resources. As the program enters another year, it continues to nurture the next generation of thinkers, creatives, and changemakers. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Smithsonian Young Ambassadors Program Goals and Mission YAP is designed to cultivate leaders in the arts, sciences, humanities, and civic life. The program promotes higher education by exposing students to a wide range of academic disciplines and introducing them to Latino role models in these fields. This representation is powerful showcasing diverse professional paths and inspiring students to envision their own futures in new ways. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Another core goal is to provide hands-on learning environments that build strong 21st-century skills. Throughout the program, students gain experience in communication, collaboration, critical thinking, and professional development. These transferable skills prepare them for college life, internships, and future leadership roles, ensuring they leave the program confident and capable. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Washington Week Experience A major highlight of YAP is the immersive Washington Week in Washington, D.C. During this once-in-a-lifetime learning experience, students participate in workshops led by leading scholars, museum professionals, and community advocates. They explore topics related to STEM, the arts, history, and culture while engaging directly with the Smithsonian s exhibitions and collections. For many participants, Washington Week becomes a defining moment in their academic and personal journeys. The exposure to new ideas, the opportunity to connect with inspiring professionals, and the sense of belonging within a national institution create an unforgettable foundation for their future ambitions. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Making History Community Practicum Following Washington Week, students participate in the Making History Community Practicum , a key component that bridges their experiences in Washington with their communities back home. Through this practicum, students engage with local organizations, contribute to civic initiatives, and explore what it means to serve as ambassadors of their communities. This hands-on involvement helps students understand how museums can function as spaces for representation, storytelling, and community engagement. It also instills a deep sense of civic responsibility, encouraging participants to view themselves as active contributors to the world around them. Alumni Network and Long-Term Impact YAP s impact extends far beyond the summer experience. The program maintains a strong and active Alumni Network that provides graduates with continued leadership development, mentorship, and professional opportunities. Many alumni go on to pursue degrees and careers in fields such as the arts, education, business, technology, and public service. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); The program s track record speaks to its success: a 97% college graduation rate, 354 alumni, 19 years of programming, and engagement across 18 cities throughout the United States and Puerto Rico. YAP alumni consistently serve their communities with creativity, confidence, and purpose, demonstrating the long-term value of the program s mission. Application Details and Deadline Applications for the 2026 Young Ambassadors Program open on February 23, 2026 , and will remain open until April 10, 2026 . The program is open to rising high school seniors regardless of race or ethnicity. All programming is offered in English, and applicants are not required to speak Spanish. Students interested in leadership, culture, and community engagement are encouraged to apply. With its unique blend of academic enrichment, cultural learning, and hands-on experience, YAP continues to be one of the nation s premier youth leadership opportunities. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Application Deadline: April 10, 2026. Application can be accessed from here . To know more about such opportunities, click here . The post Smithsonian Young Ambassadors Program 2026: A Transformative Leadership Opportunity appeared first on Opportunities for Youth .","tags":["education","Latin America and the Caribbean","high school internships","Latino community empowerment","Smithsonian education programs","Smithsonian YAP 2026","student civic engagement","Washington Week","youth leadership program"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"60b8c98efbbb69225dc6f7f24713bb73f8a27f11","title":"2026 Japan International Award for Young Agricultural Researchers","url":"https://opportunitiesforyouth.org/2026/02/26/2026-japan-international-award-for-young-agricultural-researchers/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T04:21:55Z","summary":"The Japan International Award for Young Agricultural Researchers (Japan Award) is now open for nominations for its 20th presentation in 2026 . Established in 2007, the award recognizes exceptional young researchers from developing countries who have demonstrated excellence in research and development in agriculture, forestry, fisheries, and related fields. The program aims to encourage innovation, strengthen global scientific collaboration, and inspire the next generation of leaders in agricultural science. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The deadline for submission is May 15, 2026 (JST) . About the Japan International Award The Japan Award seeks to boost motivation among young researchers working to improve agricultural systems in developing regions. Through this award, the Japan International Research Center for Agricultural Sciences (JIRCAS) highlights researchers whose work contributes to sustainable food production, environmental stewardship, and technological advancement in agriculture. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Up to three awardees will be selected through a competitive international evaluation process conducted by the selection committee. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Eligibility Criteria Nominees must meet all of the following requirements: Be researchers from a developing country or territory . Be under 40 years old as of January 1, 2026 . Be affiliated with a non-Japanese research institute or university . Be actively engaged in research and development related to agriculture, forestry, fisheries, or related industries in developing regions. Candidates must also satisfy at least one of the following conditions: Have demonstrated outstanding performance in research that benefits agricultural development in a developing region. Have achieved research results that show strong potential for future technological innovation . Applicants who were not selected in previous years may re-apply . ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Awardees must, in principle, be able to attend the awarding ceremony in Japan and deliver a lecture. Award Components Up to three selected researchers will receive: An official testimonial , awarded by the Chairman of the AFFRC during the awarding ceremony A cash prize of USD 5,000 , supported through the MOTAI JIRCAS Award An invitation to Japan for the ceremony and related events The MOTAI JIRCAS Award is funded by a donation from Mr. Shigeru Motai , former Chairman of the AFFRC of MAFF, and is administered by JIRCAS. Application Process Applications must be submitted by the recommending research institutes , whether Japanese or non-Japanese. Each institute may recommend only one researcher , including any branch institutions. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Application Deadline: May 15, 2026 (Friday, JST) Key phases of the 2026 cycle: Nomination submission deadline: May 15, 2026 Selection and determination of awardees: August or September 2026 (tentative) Awarding Ceremony: October or November 2026 (tentative) Nomination packages must include all required forms, including the application form, self-advertisement sheet, research achievements list, and checklist, along with supporting documentation. Complete guidelines and templates are provided in the official application materials. Purpose and Impact The Japan Award plays a vital role in supporting scientific talent in the Global South. By elevating the work of young researchers, the award encourages innovations that can strengthen food security, enhance climate resilience, and transform agricultural technologies in developing regions. Awardees become part of a global network committed to advancing sustainable agriculture and contributing to improved livelihoods and food systems worldwide. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Submission Details Applications must be submitted by post to the Secretariat of the Japan International Award for Young Agricultural Researchers, at the JIRCAS Headquarters in Tsukuba, Japan. Application Deadline: May 15, 2026 (JST) Announcement of Winners: August September 2026 (tentative) Award Ceremony: October November 2026 (tentative) To further strengthen its global impact, the Japan International Award for Young Agricultural Researchers also serves as a bridge between scientific innovation and real-world application. By bringing awardees to Japan for the ceremony and lecture delivery, the programme fosters international exchange, collaboration, and the sharing of cutting-edge knowledge across continents. This in-person engagement not only elevates the visibility of young scientists but also exposes them to Japan s advanced research ecosystem, encouraging long-term partnerships that can accelerate agricultural transformation in developing regions. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Application can be accessed from here . To know more about such opportunities, click here . The post 2026 Japan International Award for Young Agricultural Researchers appeared first on Opportunities for Youth .","tags":["education","Asia","Awards","Agricultural Research","developing countries","food security","forestry and fisheries","global innovation","Japan Award 2026","JIRCAS","research funding","science awards","sustainable agriculture","young researchers"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"713eae8e1660189f68910433dcee59992e0c40a8","title":"ITLOS – Nippon Foundation Capacity-Building and Training Programme 2026–2027 (Fully Funded Law of the Sea Fellowship in Germany)","url":"https://opportunitiesforyouth.org/2026/02/25/itlos-nippon-foundation-capacity-building-and-training-programme-2026-2027-fully-funded-law-of-the-sea-fellowship-in-germany/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T18:43:59Z","summary":"Key Details Programme: ITLOS Nippon Foundation Capacity-Building and Training Programme on Dispute Settlement under UNCLOS ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Location: Hamburg, Germany Duration: July 2026 March 2027 (9 months, full-time) Funding: Fully funded (travel, accommodation, medical insurance, and monthly allowance) ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Application Deadline: 6 March 2026 Eligibility: Junior to mid-level government officials and researchers, mainly from developing countries ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Age Requirement: 25 40 years Language: English and French (programme mainly conducted in English) Overview In cooperation with the Nippon Foundation , the Tribunal runs an annual capacity-building and training programme on dispute settlement under the United Nations Convention on the Law of the Sea ( UNCLOS ). The full-time programme, which runs for nine months and begins in July each year, takes place at the seat of the Tribunal in Hamburg, Germany. Contingent upon the availability of funds, a call for applications is generally announced each year during the month of January or February. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); The programme is aimed at junior to mid-level government officials and researchers mainly from developing countries who are currently working on issues related to the law of the sea, maritime law or dispute settlement. It provides participants with a unique opportunity to develop their legal skills and deepen their practical knowledge of dispute settlement in the law of the sea under UNCLOS. All participants costs, including travel, accommodation, medical insurance and a monthly allowance, are covered by the Nippon Foundation. Flyer Lectures A series of lectures takes place throughout the nine months of the programme. Lectures are generally held over the course of two days, offering the fellows the possibility of close debate with the lecturers. The faculty of lecturers is drawn from Judges of the Tribunal, Registry officials, United Nations and international organizations, universities, law firms and other relevant institutions. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); At the beginning of the programme, the fellows take part in the four-week Summer Academy of the International Foundation for the Law of the Sea . This course focuses on law of the sea and maritime law and is attended by around 40 young professionals from around the world working in the fields of law of the sea and maritime law. Some examples of lectures given during recent programmes are: Dispute settlement under UNCLOS The mechanism for the settlement of disputes under Part XV of UNCLOS with a special focus on ITLOS Contentious and advisory proceedings Giving evidence before international courts and tribunals Provisional measures Prompt release International organizations and the law of the sea The role of international organizations in the implementation of UNCLOS The work of the Division for Ocean Affairs and the Law of the Sea, Office of Legal Affairs, United Nations The mandate and work of the Commission on the Limits of the Continental Shelf under UNCLOS The interaction between the International Seabed Authority and the Tribunal Current issues related to the law of the sea Law of maritime delimitation Law of the sea and human rights The Arctic and UNCLOS The establishment of the limits of the continental shelf Fisheries management Marine scientific research Marine biological diversity of areas beyond national jurisdiction International environmental law General principles of international environmental law UNCLOS and the regional seas programmes The precautionary principle and the protection of the marine environment Climate change and the law of the sea Biodiversity and protection of ecosystems Maritime law lecture series Maritime security Ship registration Vessel pollution International law lecture series Sources of international law law of international organizations State responsibility Law of treaties Training Training sessions and workshops are arranged in order to enhance the practical and professional skills of the fellows. The programme offers training in negotiation and mediation. Workshops are organized to prepare the fellows for their potential role as agents, counsel, or legal advisers in cases before international courts and tribunals. The tools used for this purpose include exercises in drafting documents relating to cases, attendance at oral proceedings at the Tribunal, the International Court of Justice or the Permanent Court of Arbitration, and presentation skills using audio-visual tools. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Collaborating institutes An integral part of the training and capacity-building programme on dispute settlement under UNCLOS is the cooperative arrangement with Max Planck Foundation for International Peace and the Rule of Law in Heidelberg, Germany, and the Norwegian Centre for the Law of the Sea in Troms , Norway. Cooperation is undertaken in the following areas: Max Planck Foundation for International Peace and the Rule of Law in Heidelberg, Germany: training on conflict resolution and visits to the library of the Max Planck Institute for Comparative Public Law and International Law . Norwegian Centre for the Law of the Sea in Troms , Norway: discussions and training on the law of the sea and visits to relevant institutions. Study visits Group visits of between two and five days complement the knowledge gained and training given in dispute settlement and issues/topics related to the law of the sea. Accompanied by a legal officer, the fellows are given exclusive access to experts from the institutions and have the chance to attend hearings or meetings. In previous years, the following visits have been organized for the fellows: ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Belgium: Brussels European Commission s Directorate-General for Maritime Affairs and Fisheries Germany: Berlin, Bremen, Cuxhaven, Hamburg, Hanover, Kiel Alfred Wegener Institut Federal Coastguard Federal Institute for Geosciences and Natural Resources Federal Maritime Hydrographic Agency GEOMAR Helmholtz Center for Ocean Research Kiel Hamburg Port Authority Maritime Safety and Security Centre Italy: Rome Food and Agriculture Organization of the United Nations Switzerland: Geneva The United Nations Office at Geneva Geneva Center for International Dispute Settlement The Netherlands: The Hague International Court of Justice International Criminal Court Permanent Court of Arbitration United Kingdom: London International Maritime Organization International Oil Pollution Compensation Funds OSPAR Commission Research Research on law of the sea disputes and other ocean matters relevant to governments and institutions of the participants is an integral part of the training. After a training session on legal research methodology, the fellows undertake research using the library facilities of the Tribunal. Participants undertake their research under the guidance and supervision of the Registry. Participants have also the opportunity to refer questions concerning their research topics to the Judges of the Tribunal. The results of the research are presented to the Judges of the Tribunal at the end of the programme. Eligibility Applicants must be between the ages of 25 and 40. Applicants must have a first university degree in law and demonstrate a capacity to undertake independent scientific research, study and training. Applicants must be: Junior to mid-level government officials from an administration or government agency, dealing with ocean affairs or maritime matters as well as legal issues relating thereto; or Researchers from an institute (academic or government) dealing with ocean-related or maritime matters as well as legal issues relating thereto. Applicants must indicate the research topic which they intend to pursue during the programme. The research topic should address legal issues of relevance to the State and institutions of the participants regarding the implementation of UNCLOS, in particular Part XV thereof. The administration or institute nominating the applicant must indicate on the nomination form the tasks performed by the applicant and explain the extent to which the training programme will benefit the institution/State concerned. Applicants must have an excellent knowledge of one of the official languages of the Tribunal (English and French) and a working knowledge of the other language. The lectures and activities of the Programme are mainly held in English. Procedure The following documents must be submitted in order for an application to be processed: Fellowship Application Form to be duly completed, signed and submitted by the applicant. Nomination Form to be duly completed, signed and directly submitted by the nominating agency. The submitted form must be typed. In the case of government officials, the nominating agency should be a relevant governmental body. For researchers, the nominating agency may be the institute or academic department of the university to which they are affiliated. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Nominating agencies are invited to submit two copies of the Nomination Form: One scanned version of the signed original; and One electronic version. The Nomination Form should preferably be sent by e-mail to training@itlos.org , by fax to: +49 40 35607-245, or by post to: Office of the Registrar International Tribunal for the Law of the Sea Am Internationalen Seegerichtshof 1 22609 Hamburg Germany ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Conditional acceptance to the programme Admitted applicants must submit the following documents: A medical certificate issued by a duly qualified physician stating that they are in good health and fit to complete the entire programme (from July 2026 until March 2027). The certificate must indicate that the admitted applicant is able to travel inside Germany and overseas. A certificate issued by the nominating agency indicating that the candidate is granted permission to travel to Hamburg and to participate in the full nine-month programme from July 2026 to March 2027. Final admission to the programme will be contingent upon submission of the medical and permission certificates. Admitted applicants must submit a copy of the certificates within two weeks of announcing the admission. The original certificates must be submitted on the first day of the programme and must be in either English or French or accompanied by a certified translation. Participants costs, including travel, accommodation, medical insurance and a monthly subsistence allowance, are covered by the Nippon Foundation. Participants are responsible for obtaining a visa for Germany for the period of the programme at their own cost, although assistance may be provided in order to facilitate the visa application process. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); During the programme, the fellows become part of the ITLOS community and are fully integrated in the life of the Registry for nine months. They interact with staff, Judges and participants of the other training programmes run at the Tribunal. As ITLOS alumni, the fellows join a growing network of young professionals from around the world working in the field. Fellows are provided with a fully equipped office with computer, printer and internet connection for the duration of the programme. Fellows have access to the Tribunal s specialized Library, which houses a comprehensive collection on the law of the sea and related subjects, such as maritime law, environmental law, ocean affairs, coastal management, international courts and tribunals, international organizations, dispute settlement, arbitration, and general issues of public international law. Accommodation in the vicinity of the Tribunal is provided in studio apartments, with a bedroom/sitting area, kitchen and bathroom. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); During their first weeks in Hamburg, the fellows are introduced to life in Germany and given German language classes. Language training in French may also be provide For further information please contact: The ITLOS-Nippon Programme Coordinator International Tribunal for the Law of the Sea Am Internationalen Seegerichtshof 1 22609 Hamburg Germany Tel.: (+49) 40 35607-243 Fax: (+49) 40 35607-245 training@itlos.org Source: https://www.itlos.org/en/main/the-registry/training/itlos-nippon-foundation-capacity-building-and-training-programme/ The post ITLOS – Nippon Foundation Capacity-Building and Training Programme 2026–2027 (Fully Funded Law of the Sea Fellowship in Germany) appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Fellowship","Latin America and the Caribbean","Middle East and North Africa","Short Courses","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"96098219a6009acea37822be5e5e5ef6846552eb","title":"Manaaki New Zealand Scholarships 2027: Fully Funded Postgraduate Study in New Zealand","url":"https://opportunitiesforyouth.org/2026/02/25/manaaki-new-zealand-scholarships-2027-fully-funded-postgraduate-study-in-new-zealand/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T17:53:53Z","summary":"Applications for the Manaaki New Zealand Scholarships will open on March 1, 2026. Funded by the Government of New Zealand , these fully funded scholarships support applicants from eligible countries to undertake full-time postgraduate studies in 2027. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This prestigious program aims to build leadership capacity and contribute to sustainable development in partner countries. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Scholarship Overview The Manaaki New Zealand Scholarships provide full financial support for selected international students pursuing postgraduate qualifications in New Zealand. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Priority Sectors Applicants must align their proposed studies with one of the following priority development areas: Climate resilience, science and environment Economic resilience and the private sector Food security and agriculture Governance Infrastructure Peace, security and justice Resilient societies Programs of study should clearly demonstrate how they contribute to development outcomes in the applicant s home country. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Eligible Educational Institutions Scholarship recipients may study at the following New Zealand institutions: Auckland University of Technology Lincoln University Massey University University of Auckland University of Canterbury University of Otago University of Waikato Victoria University of Wellington Southern Institute of Technology Unitec Institute of Technology Applicants must apply to eligible programs offered at these institutions. Who Can Apply? Applicants must: Be from an eligible country Apply for full-time postgraduate study (Master s or PhD level) Demonstrate alignment with priority development sectors Meet academic and English language requirements Intend to return to their home country after completion Key Dates to Remember Applications Open: March 1, 2026 Applications Close: March 30, 2026 ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Late applications are not accepted, so early preparation is strongly advised. Application Period March 1 March 30, 2026 Official Scholarship Information. Eligible Countries List. For more OFY Schorlarship opportunities, click here. #Scholarships #StudyInNewZealand #ManaakiScholarships #FullyFunded #Postgraduate The post Manaaki New Zealand Scholarships 2027: Fully Funded Postgraduate Study in New Zealand appeared first on Opportunities for Youth .","tags":["education","Scholarships","Master","PhD"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"40f9a28cf4ee6ac27e95b09cc1ab5c6450033179","title":"Global Leadership Opportunity: Transatlantic Future Leaders Forum Internship 2026","url":"https://opportunitiesforyouth.org/2026/02/25/global-leadership-opportunity-transatlantic-future-leaders-forum-internship-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T17:10:47Z","summary":"The Transatlantic Future Leaders Forum (TFLF) is a prestigious internship platform designed to give the brightest Polish university students an opportunity to gain hands-on experience in the offices of top lawmakers in Washington, D.C. and London . ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Through this program, participants are immersed in transatlantic policymaking environments, working alongside decision-makers and gaining valuable insights into legislative processes in both the United States and the United Kingdom. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Beyond the internship experience, TFLF provides a robust support and mentoring structure for talented students, helping them build professional skills, expand their networks, and prepare for leadership roles in public life. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); What TFLF Offers TFLF is more than an internship it is a comprehensive leadership development platform that equips participants with knowledge, exposure, and connections. Participants benefit from: Internships with leading policymakers in the U.S. Congress and the UK House of Commons ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Mentorship and career support from experienced professionals Exclusive meetings with leaders in politics, academia, and business Exposure to think tanks, companies, and professional service organizations in both countries A strong network of high-achieving Polish peers and alumni The program is built and led by former interns of U.S. Congress and the UK Parliament who are committed to creating opportunities for the next generation of Polish leaders. Vision and Mission The Transatlantic Future Leaders Forum aims to: Connect exceptional Polish students with open-minded and influential decision-makers in Washington and London ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Provide educational and professional development opportunities through real-world policy experience Build a strong network of future Polish leaders equipped with international perspectives Foster long-term collaboration between Polish scholars and global institutions Through its programming, TFLF serves as a bridge between academic excellence and real-world policymaking. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Why Apply to TFLF? The Transatlantic Future Leaders Forum offers a rare opportunity to: Gain real-world experience in global policymaking Learn directly from influential lawmakers and institutions Build a competitive international profile Join a prestigious network of future Polish leaders For ambitious Polish students passionate about public policy, international relations, and leadership, TFLF is a transformative stepping stone toward a global career. Application Process 1. Online Application To apply for the 2026 summer internship program , candidates must complete the official online application form . ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Deadline: 31 March 2026 (23:59 CET) Applicants should prepare the following before starting the application: Answers to assessment questions (in plain text format) Personal details and availability information Updated CV Note: The application form cannot be saved midway, so all required information must be ready before starting. Applicants seeking guidance can attend an online information session (date to be announced), with registration details available on the program s website. 2. Oral Examination (Assessment Centre) Shortlisted candidates will be invited to an Assessment Centre in Warsaw , where they will participate in: An interview Practical exercises conducted in English The program committee will evaluate candidates based on their overall performance and recommend top applicants for internship placement. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); 3. Final Candidate Selection Recommended candidates will have their applications forwarded to participating Members of Parliament and Members of Congress. Each office may: Conduct its own internal review Invite candidates for an additional phone interview Successful applicants will be notified by TFLF once their placement is confirmed with a specific office. Key Deadline Application Deadline: 31 March 2026 (23:59 CET) Start your journey toward transatlantic leadership with TFLF and become part of the next generation shaping the future of global policy. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Discover more Internship Opportunities Here The post Global Leadership Opportunity: Transatlantic Future Leaders Forum Internship 2026 appeared first on Opportunities for Youth .","tags":["education","Europe","Continent","Internships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"fb7ac00eac99aaf99a2a0a1f4bbcd3fa94d144f9","title":"Hermès Internships 2026 in Paris & Île-de-France: Paid 6-Month Luxury Industry Opportunities in Communication, Marketing, Finance, Quality, Retail & Product Development","url":"https://opportunitiesforyouth.org/2026/02/25/hermes-internships-2026-in-paris-ile-de-france-paid-6-month-luxury-industry-opportunities-in-communication-marketing-finance-quality-retail-product-development/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T17:01:31Z","summary":"Are you looking to launch your career inside one of the world s most prestigious luxury maisons? Herm s, the iconic French house founded in 1837, is offering multiple paid, full-time internships for 2026 across its Communication, Marketing, Finance, Quality, Product Development, and Retail Education departments. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); These six-month internships, primarily based in Paris, Pantin, Fontenay-sous-Bois, and surrounding le-de-France locations, provide exceptional hands-on experience within a global luxury group employing more than 25,000 people worldwide. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Herm s is recognized for its craftsmanship, creativity, entrepreneurial spirit, and commitment to excellence. Interns will work alongside experienced professionals in a dynamic, high-performance environment that values ethics, diversity, inclusion, and responsible management. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); All internships are full-time and paid, lasting six months. Start dates vary between July and September 2026 depending on the position. About Herm s: A Global Leader in Luxury Craftsmanship Herm s is a French, family-owned, and independent company with nearly two centuries of heritage. The House operates across sixteen artisanal m tiers, producing leather goods, fashion accessories, crystal, jewelry, saddlery, ready-to-wear, and more. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); With nearly 300 stores worldwide, Herm s maintains a unique artisanal model rooted in local production in France, respecting both people and nature. These internships are hosted within Herm s International (the holding company), Herm s Sellier, Herm s Manufacture de M taux, and Cristallerie Saint Louis. Why Apply to Herm s Internships? Work within a globally respected luxury maison Gain hands-on experience in real projects Build international exposure Develop technical, analytical, and creative skills Strengthen your professional network in luxury, communication, finance, and innovation ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Herm s promotes ethics, diversity, inclusion, and equal opportunity. Overview of Available Herm s Internships 2026 1. Assistant Press Officer (Accessories) Paris Location: Paris Duration: 6 months Start: Second half of 2026 Within the Press/Influence Department, interns will support media and influencer relations strategy. Key Responsibilities: Preparing, sending, and managing press samples for French and international distribution Coordinating with media outlets and influencers (print, TV, radio, digital) ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Supporting press events and ensuring media coverage Managing communication between subsidiaries and internal departments Profile: Student in Communication/Public Relations Strong organizational skills Fluent English Proficient in Word, Excel, Internet tools Appreciation for high-end products Learn more HERE . 2. Assistant Project Manager Institutional Communication (Advertising Campaigns) Paris Location: Paris Duration: 6 months Start: Second half of 2026 This role supports paid advertising campaigns including cross-business campaigns, holiday campaigns, and store openings. Responsibilities: Coordinating with advertising agencies and subsidiaries Managing campaign timelines and budgets Designing editorial pages for hermes.com Overseeing styling logistics and production Managing digital and print deliverables Preparing campaign reports Profile: Business/Communication school student Prior internship experience in agency or corporate communications Fluent English Skilled in PowerPoint, Excel, Word Strong project management skills Learn more HERE . 3. Operational Marketing Assistant Cristallerie Saint Louis (Pantin) Location: Pantin Start: July 2026 Duration: 6 months Saint-Louis creates exceptional handcrafted crystal pieces. Responsibilities: Supporting sales promotions, trade shows, and events Developing communication materials Coordinating window display adaptations internationally Supporting video content creation Monitoring sales tools and promotional materials Profile: Marketing student Proficient in PowerPoint Excel Fluent English Interest in interior design and lifestyle Learn more HERE . 4. Assistant Management Controller Finance ( le-de-France) Locations: Pantin, Fontenay-Sous-Bois, Bobigny Duration: 6 months Start: Second half of 2026 Responsibilities: Supporting budget review and financial closing Preparing Excel and PowerPoint financial reports Developing performance indicators Conducting benchmarking analysis Assisting in cross-functional financial projects Profile: Finance or Business School student Strong Excel skills Analytical mindset Prior experience in management control preferred Learn more HERE . 5. Quality Assistant Herm s Manufacture de M taux (Fontenay-sous-Bois) Location: Fontenay-sous-Bois Start: September 2026 Duration: 6 months Responsibilities: Supplier monitoring and audit prioritization Implementing Master Data management tools Developing quality documents Creating KPIs Supporting continuous improvement initiatives Profile: Engineering student (Master s level) Knowledge of manufacturing processes Excel, Power BI proficiency Fluent English Learn more HERE . 6. Development Assistant Project Manager Jewelry Leather Enamel Division (Pantin) Location: Pantin Start: September 2026 Duration: 6 months Responsibilities: Managing prototype and runway schedules Coordinating suppliers and production sites Monitoring product development phases Managing reporting and inventory updates Supporting podium campaign execution Profile: Business or Engineering student Interest in Supply Chain Strong Excel PowerPoint skills Highly organized and adaptable Learn more HERE . 7. Retail Education Assistant Fashion Accessories (Pantin) Location: Pantin Start: September 2026 Duration: 6 months Responsibilities: Developing product training materials Creating e-learning modules Organizing international Train The Trainers seminars Designing creative educational tools Supporting internal communications Profile: Master s-level student Fluent English Strong PowerPoint skills Retail experience valued Creative and organized Learn more HERE . Frequently Asked Questions (FAQ) Are Herm s internships paid? Yes. All listed internships are paid and full-time for six months. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Where are the internships located? Primarily in Paris and the le-de-France region including Pantin, Fontenay-sous-Bois, and Bobigny. Who can apply? Students enrolled in undergraduate (rising junior or above), Master s programs, or recent graduates depending on role. Is English required? Yes. Most roles require fluency in English (written and spoken). ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Are beginners accepted? Yes. Beginners are accepted, though prior internship experience is valued for some roles. Do I need to send both a CV and cover letter? Yes. Applicants must submit both documents and specify availability. Visit HERE to find more information about the Herm s Internships 2026 in Paris. Discover more Internship opportunities HERE . The post Hermès Internships 2026 in Paris Île-de-France: Paid 6-Month Luxury Industry Opportunities in Communication, Marketing, Finance, Quality, Retail Product Development appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Continent","Europe","Internships","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"c0ea3b33236d638849fa037ab2a4c77e51d59042","title":"5 Fully Funded Commonwealth Scholarships for MSc in Global Development at The Open University (U.K.)","url":"https://opportunitiesforyouth.org/2026/02/25/5-fully-funded-commonwealth-scholarships-for-msc-in-global-development-at-the-open-university-u-k/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T16:49:00Z","summary":"If you are a Malawian development professional eager to advance your career in global development, peace, security and governance , this is one of the most prestigious and high-impact scholarship opportunities available this year. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the Programme MSc in Global Development This Master of Science (MSc) in Global Development focuses on building skills that strengthen: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Peace and security Development policy analysis Governance and leadership in development settings ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); It is delivered via distance learning , meaning you can continue working and contributing to your community while pursuing your studies. The course is taught by The Open University and delivered in partnership with Civil Society Agriculture Network (CISANET) in Malawi. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); What s on Offer? The Commonwealth Distance Learning Scholarships have awarded five fully funded awards worth 90,000 to support Malawian nationals to study for the highly respected MSc in Global Development delivered by The Open University (U.K.) Why This Scholarship Matters Fully funded scholarships (tuition covered) Study a globally recognised Master s degree from a top UK distance-learning institution Continue working at home while studying part-time Become a leader in development policy, peace, governance and security Make a measurable impact in your community and country This programme has supported over 220 East African professionals to date. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Benefits Here s what the scholarship includes: 1. Full tuition fee coverage for the MSc 2. Ability to study part-time via distance learning 3. A Master s degree from a respected UK university 4. Enhanced skills in development policy, governance, peace and security 5. Boosted professional credibility and career prospects Note : Scholarships generally cover tuition only; living costs are your responsibility. Eligibility Criteria To be considered for one of the five Commonwealth Scholarships, applicants must: ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); 1. Be Malawian nationals 2. Be employed by a development agency (government, NGO or private sector) in Malawi 3. Have at least two years of professional experience working on development issues in Malawi 4. Hold a good undergraduate degree (preferably in a relevant development field) 5. Demonstrate a strong commitment to local and national development goals 6. Meet scholarship and degree entry requirements set by the Foreign, Commonwealth Development Office (FCDO) and CSC. This scholarship is designed for professionals with leadership potential and practical experience. Application Process To apply: Step 1 Create a CSC Account Go to the Commonwealth Scholarship Commission (CSC) application portal and sign up. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); You will find the eligible course MSc Global Development (distance learning) listed under Group 4: Strengthening global peace, security and governance . Step 2 Complete the Online Application Form Apply here Important: Provide a detailed explanation of how your degree will benefit Malawi . This narrative is a key part of the selection process. Step 3 Submit Before Deadline Submit all required materials before 16:00 GMT, 31st March 2026 . ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Important Dates Deadlines Deadline Detail 31st March 2026 16:00 GMT Final deadline to submit the scholarship application online. October 2026 Expected programme start date for MSc in Global Development scholars. Pro Tip: Submit early late or incomplete applications will not be considered. This is a rare and highly competitive scholarship for development professionals in Malawi one that can truly elevate your career and multiply your impact back home. For more information visit here For more global opportunities click here The post 5 Fully Funded Commonwealth Scholarships for MSc in Global Development at The Open University (U.K.) appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","Scholarships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
{"id":"5f55355970f28b9f0acc9481f433ec696fe732f1","title":"£15,000 David McClure Public Interest Journalism Fellowship 2026–2031: Major Funding Opportunity for Investigative and Long-Form Journalism","url":"https://opportunitiesforyouth.org/2026/02/25/15000-david-mcclure-public-interest-journalism-fellowship-2026-2031-major-funding-opportunity-for-investigative-and-long-form-journalism/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T16:40:19Z","summary":"The David McClure Public Interest Journalism Fellowship is a prestigious, fully funded opportunity designed to support independent, non-fiction writers and journalists producing rigorously researched public interest journalism . From 2026 , one Fellow per year will receive 15,000 to complete an investigation that holds power to account and serves the public good. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Presented by the Oxford International Centre for Publishing (OICP) at Oxford Brookes University , this Fellowship honours the legacy of acclaimed investigative journalist David McClure , whose work exposed centuries-old institutional privilege and reshaped public understanding of royal wealth and power. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); About David McClure David McClure was a highly respected journalist, news producer, and author whose career was defined by deep forensic investigation and public accountability journalism . Over a decade, he uncovered how the British Royal Family s private estates and investments were shielded from scrutiny for centuries. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); His investigations resulted in two landmark non-fiction books Royal Legacy: How the Royal Family Have Made, Spent and Passed on Their Wealth (2014) and The Queen s True Worth: Unravelling the Public Private Finances of Queen Elizabeth II (2020). These works were serialised in the UK press, described as bombshell revelations , and covered extensively by global media. McClure passed away from cancer in June 2022. Why This Fellowship Matters Funding for investigative journalism has been under sustained pressure for more than a decade. The 2019 Cairncross Review highlighted the growing financial fragility of public interest reporting an issue that remains unresolved today. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); The David McClure Public Interest Journalism Fellowship directly addresses this challenge by providing dedicated financial support for investigations that are: Time-intensive Costly to research Independent of political or commercial influence Essential to the public domain Without this Fellowship, many such investigations might never be completed or published. Fellowship Overview Award Amount: 15,000 Number of Fellows: 1 per year Duration: Five years (2026 2031) Start Date: September each year Funded By: David McClure Trust Fund Host Institution: Oxford International Centre for Publishing (OICP) The Fellowship supports the completion of a single, long-form piece of public interest journalism with strong contemporary relevance. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); What Type of Journalism Is Supported? The Fellowship is intentionally flexible, with minimal restrictions. However, the proposed investigation must be: Original Non-fiction Non-biased and non-partisan Rigorously researched Of clear public interest and contemporary relevance The selection panel s primary consideration is how deserving the investigation is to be in the public domain . Key Benefits of the Fellowship 15,000 in dedicated funding Institutional support from Oxford Brookes University Recognition associated with David McClure s investigative legacy Time and financial freedom to complete ambitious journalism Increased likelihood of publication and impact Eligibility and Qualifications Open to journalists, authors, and non-fiction writers worldwide No restrictions on: Age Nationality Background Career stage Diversity is welcomed, but merit and public value are the deciding factors ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Can I Apply If My Investigation Is Already Underway? Yes. The Fellowship is specifically designed for writers who have begun an investigation but cannot progress or complete it without financial support . Can I Apply If I Haven t Started Yet? The Fellowship prioritises projects already in progress. Applicants must demonstrate research undertaken and progress to date . Financial Need and Use of Funds Applicants will not be means-tested . However, applications must clearly explain: ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Why Fellowship funding is essential to complete the investigation How the 15,000 will be used (e.g. research time, travel, data access, legal review, archival work) The panel will prioritise public value over personal financial circumstances . Selection Panel The Fellow will be chosen by a panel comprising: Members of the Oxford International Centre for Publishing (OICP) Selected experts from its Publishing Advisory Board Selected experts from its Journalism Advisory Board Panel members include publishers, literary agents, journalists, authors, and senior industry professionals. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application Requirements Applicants must submit a 1,500-word pitch that includes: Synopsis of the investigation Aims and objectives Public interest relevance Key research undertaken so far Progress to date Why Fellowship support is essential Detailed explanation of how funds will be used Shortlisted applicants will be invited to an online interview . Deadlines and Key Dates Application Deadline: 31 May (annually) Interview Period: Summer Fellowship Start Date: September Frequency: Once per year, for five consecutive years starting in 2026 How to Apply Applications must be submitted via the official application form: Apply here (Shortlisted candidates will be contacted directly for interview details.) The David McClure Public Interest Journalism Fellowship is a rare and powerful opportunity for writers committed to truth, accountability, and public value . If you are pursuing an investigation that matters but lack the resources to finish it this Fellowship exists to make that work possible. For more information visit here For more global opportunities click here The post £15,000 David McClure Public Interest Journalism Fellowship 2026–2031: Major Funding Opportunity for Investigative and Long-Form Journalism appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Fellowship","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-26T07:06:25Z","updated_at":"2026-02-26T07:06:25Z"}
