{"id":"093b7d9c62c3add2ca052cadc0a2757f8c357b34","title":"Green Climate Fund (GCF) Internship 2026: Office of the Chief Investment Officer – Front Office, Investment Operations","url":"https://opportunitiesforyouth.org/2026/02/23/green-climate-fund-gcf-internship-2026-office-of-the-chief-investment-officer-front-office-investment-operations/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T22:25:04Z","summary":"The Green Climate Fund (GCF) is now accepting applications for the Intern Office of the Chief Investment Officer (Front Office, Investment Operations). This highly competitive internship offers emerging professionals the opportunity to gain hands-on experience within one of the world s leading climate finance institutions. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Hosted by the Green Climate Fund , this internship provides practical exposure to investment operations, project pipeline analysis, and strategic coordination within a global climate investment framework. About the Green Climate Fund The Green Climate Fund (GCF) is the world s largest dedicated climate fund, established to support developing countries in responding to climate change. The Fund plays a critical role in financing high-impact projects that promote low-emission and climate-resilient development. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Interning with GCF provides direct insight into global climate finance mechanisms and international development processes. Internship Overview Position: Intern Office of the Chief Investment Officer Division: Front Office, Investment Operations Institution: Green Climate Fund (GCF) ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); This internship places you at the center of climate investment operations, supporting key functions that drive high-impact climate financing worldwide. Key Responsibilities Interns will support the Office of the Chief Investment Officer by assisting with: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Project pipeline monitoring and analysis Strategic planning and performance reporting Project-specific accreditation processes Coordination of investment committees Cross-team collaboration across departments The role combines analytical work, operational coordination, and strategic support, offering a comprehensive introduction to climate investment management. What You Will Gain This internship provides: Hands-on experience in global climate finance Exposure to high-level investment operations Practical skills in data analysis and reporting Insight into accreditation and governance processes Professional development within an international institution ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Interns will work closely with experienced professionals and contribute meaningfully to the investment decision-making ecosystem. Who Should Apply? The position is ideal for students or early-career professionals with interests in: Climate finance Investment operations Sustainable development International development Public policy or economics Data analysis ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Applicants should carefully review the official vacancy notice to confirm academic and professional eligibility requirements. Application Deadline No specific deadline is stated in the announcement. Applicants are encouraged to apply as early as possible through the official link to avoid missing out on this opportunity. Ensure your CV and supporting documents clearly demonstrate your analytical skills, interest in climate finance, and ability to work in a collaborative international environment. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); How to Apply Interested candidates can learn more and submit their applications here. For more OFY Internship opportunities, click here. The post Green Climate Fund (GCF) Internship 2026: Office of the Chief Investment Officer – Front Office, Investment Operations appeared first on Opportunities for Youth .","tags":["education","Internships","Continent"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T02:35:38Z","updated_at":"2026-02-24T02:35:38Z"}
{"id":"08b2da91a785ab28bfffa186f4d494d6ff642672","title":"Master AI in Just 10 Hours: Google Launches Game-Changing AI Professional Certificate on Coursera","url":"https://opportunitiesforyouth.org/2026/02/23/master-ai-in-just-10-hours-google-launches-game-changing-ai-professional-certificate-on-coursera/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T17:44:50Z","summary":"Google has officially launched its first AI Professional Certificate, expanding its Generative AI catalog on Coursera, which has already attracted nearly three million enrollments globally. This new program is designed to help professionals integrate artificial intelligence into their daily work with practical, job-ready skills that go beyond basic prompting. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); As AI fluency rapidly becomes a baseline expectation across industries, this certificate positions learners to stay competitive in an evolving workforce. According to recent research conducted by Google and IPSOS, more than half of job postings requesting AI skills are now outside traditional IT and computer science roles. However, only 40% of American workers currently use AI at work. This certificate aims to close that gap. What Makes the Google AI Professional Certificate Unique? The Google AI Professional Certificate focuses on universal, transferable skills developed through analysis of hundreds of job descriptions and collaboration with employers. It emphasizes hands-on learning and responsible AI use. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Every learner who enrolls receives: Three months of no-cost access to Google AI Pro Practical experience using Google s advanced AI models A portfolio of real-world AI projects Additionally, Google is offering free access to the certificate for U.S. small businesses, alongside tools such as Google Workspace Business Standard to support AI adoption nationwide. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Program Structure and Courses The certificate can be completed in approximately 10 hours and includes seven short courses plus a hands-on capstone project. Courses include: AI Fundamentals Learn foundational generative AI concepts and responsible evaluation of AI outputs. AI for Brainstorming and Planning Use AI to generate structured project plans. AI for Research and Insights Synthesize information for faster decision-making. AI for Writing and Communication Craft persuasive and audience-specific messaging. AI for Content Creation Develop and critique multimedia assets responsibly. AI for Data Analysis Convert complex datasets into clear, actionable insights. AI for App Building Build a custom AI-powered solution using natural language. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Throughout the program, learners work with tools such as Gemini, NotebookLM, and AI Studio, gaining hands-on experience directly from Google experts. Skills You Will Gain By the end of the certificate, participants will have developed: Reusable AI prompts Data-driven project plans AI-generated research and visual content A custom AI-powered application Strong understanding of responsible AI practices ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); The program is ideal for working professionals seeking to future-proof their careers and organizations aiming to upskill their teams. Deadline No official deadline has been announced. Enrollment is currently open. APPLY HERE For more information on this opportunity , click here. For more opportunities, click here. The post Master AI in Just 10 Hours: Google Launches Game-Changing AI Professional Certificate on Coursera appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Europe","Latin America and the Caribbean","Middle East and North Africa","Short Courses","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T02:35:38Z","updated_at":"2026-02-24T02:35:38Z"}
{"id":"b3df11a30e250ea25a553df187ce332454b27b2b","title":"Launch Your Career in Civic Engagement: Apply for the CIVICUS Communications & Network Engagement Internship","url":"https://opportunitiesforyouth.org/2026/02/23/launch-your-career-in-civic-engagement-apply-for-the-civicus-communications-network-engagement-internship/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T17:27:59Z","summary":"Are you passionate about civil society, citizen activism, and positive social change? CIVICUS, a global alliance of over 15,000 members across 189 countries, is looking for a Communications and Network Engagement Intern to join their team. This internship offers a unique opportunity to contribute to a worldwide mission defending people power and amplifying excluded voices, especially from the Global South. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); As a Communications and Network Engagement Intern, you will play a vital role in supporting CIVICUS global engagement through digital platforms. Your responsibilities will include creating compelling digital content, engaging with networks and membership, and collaborating with communicators across sectors to foster civic action. This role is perfect for someone who enjoys blending creativity, analytics, and relationship-building in a meaningful context. Key Responsibilities: Develop creative digital content for LinkedIn, X, Facebook, Instagram, and TikTok. Strengthen network engagement with CIVICUS Narratives Network and members. Build relationships with communicators across civil society sectors. Support initiatives that amplify citizen activism and civic participation. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Eligibility Requirements: Degree or equivalent experience in communications, marketing, social media, creative content development, or a related field. Excellent command of English; knowledge of a major Global South language is a plus. Experience in social media content creation, management, and analytics. Commitment to positive social change and civil society work. Strong interest in community engagement and civic action communications. How to Apply: Applications close 5th March 2026 at 11:59 PM SAST. Your application should include: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); A detailed CV including education, professional qualifications, significant positions, responsibilities, and achievements. A one-page cover note explaining your motivation for applying. Shortlisted candidates will be contacted within two weeks of the closing date. All applicants will be updated once the position has been filled. CIVICUS reserves the right to withdraw any vacancy at any time. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); This internship is an excellent pathway for emerging communicators and social change makers looking to gain hands-on experience in global civic engagement and digital network strategy. Deadline : 5th March,2026. APPLY HERE For more information on this opportunity, click here. For more job opportunities, click here . The post Launch Your Career in Civic Engagement: Apply for the CIVICUS Communications Network Engagement Internship appeared first on Opportunities for Youth .","tags":["education","Internships","Africa","America","Asia","Australia and Oceania","Europe","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T02:35:38Z","updated_at":"2026-02-24T02:35:38Z"}
{"id":"dd9cbc178bfa015e6e8e43cb179f63778b5a95b6","title":"EPIC Launches Brandt Research Fellowship and 2026–27 Pre-Doctoral Research Professional Roles in Climate & Energy Economics","url":"https://opportunitiesforyouth.org/2026/02/23/epic-launches-brandt-research-fellowship-and-2026-27-pre-doctoral-research-professional-roles-in-climate-energy-economics/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T17:12:30Z","summary":"The Energy Policy Institute at the University of Chicago (EPIC) has announced a major expansion of its early-career research opportunities with the launch of the Brandt Research Fellowship , alongside multiple full-time pre-doctoral Research Professional positions for the 2026 27 academic cycle. These opportunities are designed to strengthen global research and policy impact in climate change, energy markets, and environmental economics. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The Brandt Research Fellowship is supported by a generous gift from Ted Brandt, MBA 87, founder and CEO of Marathon Capital, a clean-economy-focused advisory firm. The fellowship operates within EPIC s highly regarded Pre-Doctoral Fellows Program, which serves as a bridge between undergraduate or master s education and doctoral study. Brandt emphasized the importance of rigorous energy research in today s global economy, noting that energy economics and geopolitics influence nearly every sector. Through this fellowship, EPIC continues to ask critical policy questions and deliver evidence-based solutions that shape decision-making worldwide. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); About the EPIC Pre-Doctoral Fellows Program Brandt Research Fellows join EPIC for one or two years, working closely with EPIC-affiliated faculty and researchers. Fellows gain hands-on experience across all stages of the research process, including project management, data collection and analysis, manuscript preparation, and policy engagement. Research spans energy markets, climate impacts, environmental externalities, and public policy, often using quasi-experimental and experimental methods with large-scale global datasets. EPIC pre-doctoral alumni have gone on to top PhD programs worldwide, and several have received highly competitive National Science Foundation grants. Fellows leave the program with advanced technical skills, strong professional networks, and deep exposure to policy-relevant research. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Research Focus and Methodology Research projects typically involve environmental and energy data from the United States, India, China, and other regions. Fellows apply advanced quantitative methods, computational modeling of energy markets, and policy evaluation techniques. In addition to research responsibilities, fellows participate in seminars and classes at EPIC, the University of Chicago , and partner institutions. Open Positions for the 2026 27 Academic Cycle EPIC is currently recruiting for multiple full-time, benefits-eligible Research Professional (Pre-Doctoral Fellow) roles beginning in Spring Summer 2026: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Research Professional Climate Impact Lab (Michael Greenstone) Fellows will work under the direction of Michael Greenstone , contributing to globally influential research that quantifies climate change impacts across sectors such as health, agriculture, labor, energy, conflict, migration, and coastal systems. This work supports the development of empirically derived estimates of the social cost of carbon. Salary range: $55,000 $62,000 annually Additional $2,000 professional development fund Duration: 1 2 years Expected start date: Spring Summer 2026 Applications reviewed on a rolling basis Research Professional Fiona Burlig, Erin Kelley Greg Lane This role focuses on experimental and data-intensive research in developing-country agriculture, climate adaptation, insurance markets, and climate risk forecasting, including randomized controlled trials in India. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Salary range: $55,000 $62,000 annually Additional $2,000 professional development fund Expected start date: July 1, 2026 Duration: 1 2 years APPLY HERE . For more information about this apportunity, click here . Discover more research fellowship opportunities here . Application Timeline and Deadlines Fall application cycle: Mid-November, with final decisions in mid-December Winter application cycle: Early March, with final decisions by late March ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Applicants must have completed a Bachelor s or Master s degree by June of the year of application and demonstrate strong quantitative and programming skills. EPIC offers a competitive salary, comprehensive benefits, and an exceptional research environment that prepares fellows for top-tier doctoral programs. The post EPIC Launches Brandt Research Fellowship and 2026–27 Pre-Doctoral Research Professional Roles in Climate Energy Economics appeared first on Opportunities for Youth .","tags":["education","Fellowship","Africa","America","Asia","Australia and Oceania","Continent","Europe","Jobs","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T02:35:38Z","updated_at":"2026-02-24T02:35:38Z"}
{"id":"0c656b4be6f9d9c2a9d781cee16dbdee0199418e","title":"Leadership Academy 2026 for African Youth: 10-Week Virtual & In-Person Leadership Program Empowering the Next Generation of African Leaders","url":"https://opportunitiesforyouth.org/2026/02/23/leadership-academy-2026-for-african-youth-10-week-virtual-in-person-leadership-program-empowering-the-next-generation-of-african-leaders/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T17:05:37Z","summary":"The Leadership Academy 2026 is now officially open for applications from February 1st, 2026. Designed to equip young Africans with transformative leadership, personal development, and professional skills, this comprehensive program empowers the next generation of ethical, community-driven leaders across the continent. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Organized by Leading Change Africa, the Leadership Academy is delivered through multiple formats virtual (English French) and select in-person cohorts in Burkina Faso and Mali ensuring accessibility across diverse African contexts. Application Windows: Virtual Leadership Academy (English French): February 1 28, 2026 In-Person Leadership Academy (Burkina Faso Mali): February 1 April 12, 2026 ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The 10-week virtual program runs from April to June 2026. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); What Is the Leadership Academy? The Leadership Academy is a structured leadership development initiative designed to strengthen African youth by building foundational and advanced leadership capabilities. It combines digital learning, facilitated discussions, mentorship, applied projects, and peer collaboration. The program is rooted in the belief that Africa s transformation depends on values-driven, socially responsible leaders equipped with modern professional and digital skills. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Through a blended learning approach, participants gain practical tools to: Lead themselves with clarity and integrity Influence others effectively Develop strategic thinking capabilities Build collaborative networks Apply leadership knowledge to real community challenges Program Formats: Choose Your Leadership Academy Track The Leadership Academy is structured to accommodate diverse learning needs and geographic realities. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 1. Virtual Leadership Academy (English French) The Virtual Leadership Academy is a 10-week online experience delivered via the YAM.edu platform. It includes: Self-paced learning modules Facilitated live virtual sessions Assignments and reflective exercises Group projects Personalized mentorship Peer-to-peer collaboration Access to guest speakers through the Inspiring Journeys Series This format allows African youth across the continent to participate regardless of location. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Application Window: February 1 28, 2026 Program Period: April June 2026 2. In-Person Leadership Academy (Burkina Faso Mali) The in-person track provides hands-on leadership development through: Physical workshops Community engagement projects Direct mentorship Experiential leadership activities These cohorts are location-based and subject to availability and selection criteria. Application Window: February 1 April 12, 2026 Program Objectives The Leadership Academy aims to: Develop transformative leadership capacity among African youth Strengthen self-awareness, integrity, communication, and ethical decision-making Bridge theory and practice through real-life case studies and applied group projects ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Strengthen digital and professional skills needed in modern African and global contexts Foster strong mentorship networks and peer collaboration Equip participants to create sustainable impact within their communities The program is built around the belief that leadership is both personal and societal requiring reflection, responsibility, and action. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Core Learning Areas Participants engage in structured modules covering: Foundations of Transformative Leadership Participants develop the ability to inspire trust, navigate complexity, and drive change through reflective practice and applied learning. Visionary Thinking Strategic Planning Learners build skills to craft compelling visions and convert them into strategic, actionable plans for long-term success. Collaboration Networking Participants learn how to build professional networks, manage diverse perspectives, and cultivate partnerships that enhance personal and organizational growth. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Ethical Leadership Integrity Strong emphasis is placed on values-driven leadership and responsible decision-making within African contexts. Program Structure Weekly Commitment The 10-week virtual program blends: Self-paced modules Weekly virtual sessions Assignments Group collaboration Reflection exercises Mentor feedback Participants are expected to fully engage in the learning journey, committing consistent weekly time to sessions, coursework, and collaboration. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); What Makes the Leadership Academy Unique? The Leadership Academy stands out because of: A blended virtual and in-person delivery model Africa-focused leadership curriculum Practical, application-oriented learning Strong mentorship and alumni network Emphasis on community-driven leadership Exposure to real-world leaders through the Inspiring Journeys Series The program does not focus on abstract theory alone it prioritizes actionable leadership development. Eligibility Criteria Applicants must: Be African youth aged 18 35 years Hold citizenship of an African nation Be passionate about leadership and personal development Be able to fully participate in the 10-week virtual program (April June 2026) ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Be proficient in English (for English track) or French (for French track) Have access to an internet-enabled device and stable internet connection ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Eligibility requirements may vary slightly by program track. Applicants are encouraged to review the specific track requirements before applying. Technical Requirements For virtual participants: Laptop or smartphone Stable internet connection Ability to access the YAM.edu platform Availability for live virtual sessions Program Outcomes After completing the Leadership Academy, participants gain: Enhanced leadership and professional skills Increased self-awareness and emotional intelligence Expanded pan-African network Access to mentors and alumni community Practical leadership project experience Stronger strategic planning abilities Exposure to cross-sector leadership insights ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); The Academy aims to create long-term leadership pipelines across Africa. Application Process Applications are open starting February 1, 2026. Applicants must select their preferred track: English Virtual Leadership Academy French Virtual Leadership Academy Burkina Faso In-Person Academy Mali In-Person Academy (subject to confirmation) Applicants are advised to apply early within the application window. ezstandalone.cmd.push(function () { ezstandalone.showAds(139); }); Why You Should Apply If you are an African youth committed to leadership, personal growth, and community impact, the Leadership Academy provides: Structured leadership development Real-world learning experiences Mentorship from experienced leaders Cross-border networking opportunities Exposure to African leadership ecosystems Practical skills applicable in careers, entrepreneurship, and public service This is more than a program it is a leadership transformation journey. ezstandalone.cmd.push(function () { ezstandalone.showAds(140); }); Application Timeline Summary Virtual Leadership Academy: February 1 28, 2026 Program runs April June 2026 In-Person Leadership Academy: February 1 April 12, 2026 Learn more about the Virtual Leadership Academy 2026 HERE . Submit your application HERE . Visit here for more global opportunities on OFY. The post Leadership Academy 2026 for African Youth: 10-Week Virtual In-Person Leadership Program Empowering the Next Generation of African Leaders appeared first on Opportunities for Youth .","tags":["education","Conferences","Africa"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T02:35:38Z","updated_at":"2026-02-24T02:35:38Z"}
{"id":"bd6a335dd5164eacdbe57d707b31c124eaf55a17","title":"Alstom Foundation 2026 Call for Projects: Funding for NGOs Advancing Sustainable Development, Energy, Mobility & Environmental Protection","url":"https://opportunitiesforyouth.org/2026/02/23/alstom-foundation-2026-call-for-projects-funding-for-ngos-advancing-sustainable-development-energy-mobility-environmental-protection/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T17:03:15Z","summary":"The Alstom Foundation has officially announced the opening of its 2026 project cycle, providing funding opportunities for impactful NGO-led initiatives across key development sectors. The online submission portal opens on February 16, 2026, with a final submission deadline of April 10, 2026 (11:59 PM CET). This annual funding opportunity supports projects that drive meaningful change in communities where Alstom operates. NGOs partnering with an Alstom employee as Project Promoter are invited to submit proposals aligned with the Foundation s strategic priorities. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Key Dates for the 2026 Cycle February 10 March 13, 2026: Project definition and preparation with partners March 13, 2026: Deadline to request assistance in identifying an Alstom Promoter February 16, 2026: Online submission portal opens April 10, 2026 (11:59 PM CET): Final deadline for project submission Mid-September 2026: Board selection of funded projects Implementation: Ongoing monitoring throughout the year Focus Areas of the Alstom Foundation The Alstom Foundation concentrates on four key axes of intervention: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); 1. Economic and Social Development Projects under this axis should promote sustainable livelihoods and inclusive growth. Priority is given to: Skills development and employability programs for disadvantaged youth and women Support initiatives for street children, orphans, and foster children ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); 2. Environmental Protection The Foundation funds projects that enhance environmental awareness, safeguard biodiversity, protect natural habitats, and strengthen community resilience to natural disasters. 3. Access to Mobility Proposals should facilitate safe and inclusive movement of people and goods, especially in remote or underserved communities, enabling better access to markets, healthcare, and education. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); 4. Access to Energy and Water Projects that improve access to electricity and safe drinking water are strongly encouraged. With millions globally lacking these essential services, the Foundation aims to raise living standards in vulnerable communities through sustainable solutions. Selection Criteria To be considered for funding, each project must: Align with at least one of the Foundation s key focus areas Serve the general interest Be located in a country where Alstom has a presence Demonstrate measurable outcomes and community impact Be realistic and feasible within budget and timeline Involve local stakeholders and local management Be implemented by a competent partner organization Comply with the Foundation s Ethics Charter Be submitted in the same country where the Alstom employee promoter is based Each NGO may submit only one project per cycle. The Role of the Alstom Promoter Every submission must be jointly prepared by an NGO and an Alstom employee serving as Project Promoter. The promoter must be based in the same country where the project will be implemented. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); The promoter collaborates in preparing and validating the project file and, if selected, assists in monitoring implementation. If an NGO does not know an Alstom employee, it may request support from the Foundation Secretariat to identify a potential promoter. However, requests must be submitted no later than March 13, 2026. The Secretariat does not guarantee that a promoter will be identified, as promoters participate on a voluntary basis. How to Submit The online submission tool opens on February 16, 2026. Applicants complete structured, preformatted forms designed to optimize proposal clarity. A help function is available within each form. Drafts can be saved and edited before final submission. Once submitted, the selection process begins automatically. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Applicants will receive a confirmation email upon successful submission. Interested NGOs should begin early preparation to ensure compliance with all guidelines and partnership requirements before the April 10, 2026 deadline. Deadline : April 10 ,2026 APPLY HERE For more information on this funding opportunity, click here . For more grant opportunities, click here . The post Alstom Foundation 2026 Call for Projects: Funding for NGOs Advancing Sustainable Development, Energy, Mobility Environmental Protection appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Europe","Grants","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T02:35:38Z","updated_at":"2026-02-24T02:35:38Z"}
{"id":"c216b79025744e4a6a549fdc1ade8842a44beb55","title":"Youth, Peace and Security Online Course 2026: UN-Certified Training to Implement the YPS Agenda","url":"https://opportunitiesforyouth.org/2026/02/23/youth-peace-and-security-online-course-2026-un-certified-training-to-implement-the-yps-agenda/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T16:00:30Z","summary":"Build Practical Skills to Advance Youth Participation in Peace and Security Young people are increasingly recognized as powerful agents of change in preventing conflict, sustaining peace, and shaping inclusive security policies. To translate global commitments into real-world impact, practitioners need the right skills, frameworks, and tools. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Realizing the Youth, Peace and Security Agenda is a comprehensive, practitioner-focused online course jointly developed by United Nations System Staff College and the Folke Bernadotte Academy . The programme equips professionals working in peace and security with the knowledge and applied competencies needed to effectively implement the Youth, Peace and Security (YPS) agenda while working with and for young people. Why This Course Matters The adoption of landmark UN Security Council resolutions 2250 (2015), 2419 (2018), and 2535 (2020) elevated youth participation in peace and security from aspiration to international obligation. Despite progress, implementation remains uneven across local, national, and global levels. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); This course responds directly to that gap by offering a structured, skills-based learning journey that strengthens institutional capacity and supports young women and men as contributors to peaceful and just societies. Course Overview Language: English Format: Fully online Duration: Approximately 2 months of active learning (spread across 2026) ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Weekly workload: 3 4 hours Course fee: USD 1,250 Enrollment Deadline: 10 April 2026 APPLY HERE. For more information about this apportunity, click here . The programme blends self-paced modules, live expert-led webinars, peer exchange, and written assignments. Participants enjoy flexible access via the UNSSC online learning platform, enabling learning from anywhere in the world. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Course Structure and Timeline Part I YPS Foundational Skills 13 April 22 May 2026 Module 1: Introduction to the Youth, Peace and Security Agenda Module 2: Enabling meaningful youth participation Module 3: Conducting youth-sensitive conflict analysis ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Includes one mandatory written assignment. Part II YPS Applied Skills (Elective Modules) 14 September 30 October 2026 Module 4: Serving as a YPS adviser or focal point Module 5: Youth-responsive and YPS-focused programming Module 6: In-country implementation of the YPS Agenda ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Includes at least one written assignment. Successful completion requires finishing all foundational modules and at least one elective module with assignments. Learning Methodology Participants engage in: Guided self-study modules Live interactive webinars (six in total) Peer learning and experience sharing Individual feedback and one-to-one facilitator support This approach ensures both conceptual understanding and practical application of YPS principles. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Who Should Apply The course is designed for practitioners and representatives from: The UN system International and regional security organizations Non-governmental organizations Civil society organizations working on youth, peace, and security Selection Process Selection is competitive and based on: Quality of motivation statement Relevant experience and knowledge Commitment and availability Diversity across gender, geography, and sector Willingness to actively contribute to peer learning UN applicants must also submit a supervisor s endorsement as part of the online application. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Discover more learning opportunities here . The post Youth, Peace and Security Online Course 2026: UN-Certified Training to Implement the YPS Agenda appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Continent","Europe","Latin America and the Caribbean","Middle East and North Africa","Short Courses","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T02:35:38Z","updated_at":"2026-02-24T02:35:38Z"}
{"id":"a44867099d1c549d219655defb25dc49808a3023","title":"Transform Your Institution with the FATE Foundation AI Upskilling Programme 2026 — Empower Students and Lecturers for the AI Revolution","url":"https://opportunitiesforyouth.org/2026/02/23/transform-your-institution-with-the-fate-foundation-ai-upskilling-programme-2026-empower-students-and-lecturers-for-the-ai-revolution/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T15:31:29Z","summary":"https://wp.me/p23f03-jtXAs Artificial Intelligence reshapes global industries, African universities must lead, not follow. The FATE Foundation AI Upskilling Programme is a high-impact, continent-wide initiative designed to equip accredited Higher Education Institutions (HEIs) with world-class AI teaching capacity, research frameworks, and student readiness skills all at no cost to your institution. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); What Is the FATE Foundation AI Upskilling Programme? The AI Upskilling Programme is a multi-country initiative led by the FATE Foundation in partnership with the African Institute for Mathematical Sciences (AIMS) and supported by Google.org with a strategic $4 million investment to build a sustainable AI education ecosystem across Africa. The programme empowers institutions in: Kenya Nigeria Ghana South Africa to integrate advanced AI competencies into teaching, research, and curriculum design enabling them to produce graduates ready for tomorrow s AI-powered economy . ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Who Should Apply? (Eligibility Criteria) To qualify for the 2026 intake, institutions must: 1. Be an accredited Higher Education Institution (HEI) 2. Offer STEM-related programmes (science, tech, engineering, math) 3. Demonstrate technical infrastructure readiness 4. Commit to integrating AI modules into curricula 5. Support participation from lecturers, teaching assistants, and senior STEM students 6. Participate in monitoring evaluation and capstone projects Note: Individual lecturers and students apply through their nominated institution there is no direct individual application. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Benefits for Institutions Participants 1.World-Class AI Training Participating institutions receive: Free AI training for at least four lecturers per institution. Certification for trained faculty. Localized curriculum resources for institutional use. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); 2.Curriculum Teaching Resources Curriculum modules are based on the Google DeepMind AI Research Foundation framework , covering: Small language model creation Neural network design and training Transformer architectures Model fine-tuning and alignment Real-world capstone projects This curriculum is adapted with local context to ensure relevance in African higher education systems. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 3.Student Empowerment Students benefit from: Advanced AI competencies aligned with global industry needs. Opportunities to build AI solutions for real-world problems. Mentorship and exposure to applied AI research. 4.Institutional Recognition Institutions gain: Visibility as innovators in AI education. Potential networking with African institutions and ecosystem partners. Contribution to Africa s developing AI ecosystem. Who Can Participate Internally? Lecturers Become certified AI Champions capable of leading instruction. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Teaching Assistants (TAs) Support AI learning and curriculum delivery. Penultimate Final-Year STEM Students Gain cutting-edge, industry-relevant AI skills. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); How to Apply Step by Step Apply here Complete the online registration form with accurate institutional and contact details. Submit before March 31 2026 (recommended). Await confirmation and further onboarding instructions. Prepare lecturers and materials for training and curriculum integration. Review eligibility guidelines and participation commitments. For questions or technical support, check the contact information on the official page or email the programme team as listed. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Key Deadlines Application Timeline Milestone Date / Status Applications Open Now Ongoing Suggested Submission Deadline 31st March 2026 (for priority review) Ongoing Review Selection Rolling basis Notifications to Selected Institutions Following review cycle Programme Implementation Window 2026 academic year Applications are reviewed periodically, and early submissions are highly recommended to secure institutional onboarding. AI skills are rapidly becoming critical in education, research, and industry. Programs like this enable African universities to lead technological innovation rather than be late adopters . This initiative is strategically positioned to: Build local expertise in AI research and teaching competencies. Strengthen technology ecosystems across multiple African nations. Advance employability and innovation capacity for students. For more information visit here For more global opportunities click here The post Transform Your Institution with the FATE Foundation AI Upskilling Programme 2026 — Empower Students and Lecturers for the AI Revolution appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","Short Courses"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T02:35:38Z","updated_at":"2026-02-24T02:35:38Z"}
{"id":"da61880c08d2093f7159ac99c70d95adcc488429","title":"WFPG Summer 2026 Internship in Washington, D.C.: Programming, Communications, and Operations Roles Now Open","url":"https://opportunitiesforyouth.org/2026/02/23/wfpg-summer-2026-internship-in-washington-d-c-programming-communications-and-operations-roles-now-open/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T15:15:27Z","summary":"Applications are now open for the WFPG Summer 2026 Internship Program, offering students and emerging professionals the opportunity to gain hands-on experience in programming, communications, and operations. Hosted fully in person in Washington, D.C., this competitive internship provides practical exposure within a leading organization focused on global policy and leadership. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The program is organized by the Women s Foreign Policy Group (WFPG), a respected nonprofit dedicated to advancing women s leadership in international affairs. About the WFPG Summer Internship Program The WFPG Summer 2026 Internship offers three distinct tracks: Programming Internship Communications Internship Operations Internship Applicants may apply for one or more internship tracks depending on their interests and qualifications. The program is designed to provide immersive, real-world experience in nonprofit operations and global policy engagement. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); All internships are conducted fully in person at WFPG s Washington, D.C. location, allowing interns to work closely with professionals in the field of foreign policy and international leadership. Internship Tracks Overview Programming Internship Interns support event planning, research, and coordination of high-level discussions, panels, and leadership initiatives. This track is ideal for candidates interested in international affairs, public policy, and event management. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Communications Internship Interns assist with content creation, social media management, writing, and digital outreach. This role is suitable for individuals interested in communications strategy, media engagement, and policy messaging. Operations Internship Interns contribute to administrative processes, organizational management, and internal coordination. This track is valuable for those looking to build experience in nonprofit management and operations. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Why Apply? The WFPG internship program offers: Hands-on experience in a respected foreign policy nonprofit Direct exposure to international affairs programming Networking opportunities in Washington, D.C. Practical skill development in communications, operations, and policy engagement A professional in-person work environment Interns gain valuable experience that strengthens graduate school applications, policy careers, nonprofit leadership pathways, and communications roles. Location and Format Location: Washington, D.C. Format: Fully in-person Term: Summer 2026 ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Candidates must be able to work on-site in Washington, D.C. for the duration of the internship. Application Deadline Applications will be reviewed on a rolling basis until March 6th at 11:59 PM ET, or until 100 applications are received, whichever comes first. Early applications are strongly encouraged due to the application cap. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Applicants should prepare their resume, cover letter, and any additional required materials before applying. How to Apply To learn more and submit your application, click here For more OFY Internship Opportunities, visit here The post WFPG Summer 2026 Internship in Washington, D.C.: Programming, Communications, and Operations Roles Now Open appeared first on Opportunities for Youth .","tags":["education","Continent","Internships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T02:35:38Z","updated_at":"2026-02-24T02:35:38Z"}
{"id":"07d1d57c9ee9066739d107261f48256018d6bc17","title":"WWF Innovation Project Coordinator & Team Support (Remote, March–December 2026)","url":"https://opportunitiesforyouth.org/2026/02/23/wwf-innovation-project-coordinator-team-support-remote-march-december-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T15:10:06Z","summary":"The World Wide Fund for Nature (WWF) is hiring an Innovation Project Coordinator Team Support professional to help drive global conservation impact through innovation. This is a remote, independent contractor mandate running from March 2026 to December 2026 , with flexible working hours (30 36 hours per week). ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); If you are a highly organized professional with at least five years of project coordination experience and a passion for sustainability, climate action, and biodiversity, this role places you at the heart of WWF s global innovation portfolio. Application Deadline: 1 March 2026 (End of Day). About WWF and the Innovation Team WWF is one of the world s leading conservation organizations, operating in over 100 countries with more than 8,000 staff globally. Its mission is to stop environmental degradation and build a future where humans live in harmony with nature. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The Innovation @ WWF team enables conservation breakthroughs by: Supporting teams across the global network Scaling impactful ideas Building strategic partnerships Applying innovation tools to conservation and operational challenges As Innovation Project Coordinator, you will ensure these moving parts align smoothly. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Role Overview: Innovation Project Coordinator Team Support This is a hands-on coordination role that keeps WWF s innovation engine running efficiently. You will work closely with: The Global Innovation Lead Scaling and Incubation Leads Internal and external partners ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); You won t need deep technical conservation expertise. Instead, your strength lies in structure, organization, and execution. Key Responsibilities 1. Strategic Workstream Coordination Coordinate WWF s global innovation programs Align schedules and timelines across multiple projects Maintain momentum across innovation initiatives 2. Agile Sprint Workshop Support Organize virtual agile sprints across multiple time zones Provide technical and logistical support Capture meeting minutes and track action points Ensure follow-up and accountability ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 3. Academic AI Partnership Coordination Support collaboration with the Technical University of Munich (TUM) on exploring AI for conservation project design: Schedule and coordinate meetings Manage internal communication Track next steps and deliverables 4. Stakeholder Network Management Maintain WWF s innovation network database (Airtable) Coordinate stakeholder engagement Ensure alignment with key conservation partners ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); 5. Operational Backbone Organize knowledge and documentation Oversee invoices and reporting Support overall team administration Required Qualifications To succeed in this role, you should have: At least 5 years of experience in project coordination Background in management, business, entrepreneurship, or related fields Strong organizational and multitasking abilities Experience with agile methodologies (Scrum Master experience is a plus) Excellent written and verbal English skills Proficiency with tools like Asana, Trello, Slack, Airtable, Microsoft Office ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Ability to work independently in a fast-paced, remote environment What You ll Gain Impactful Global Work Contribute directly to scaling WWF s conservation impact worldwide. Collaborative Environment Work within a human-centered, supportive innovation team. Professional Growth Develop advanced skills in agile coordination, innovation management, and global stakeholder engagement. Flexible Remote Structure Location-independent Must accommodate CET time zones Applications from Asia, Latin America, and Africa strongly encouraged ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Contract Details Title: WWF Innovation Project Coordinator Team Support Legal Form: Independent Contractor via WWF Switzerland Working Hours: 30 36 hours per week Contract Length: Until December 2026 (possible extension) Location: Remote (CET-compatible time zones preferred) Salary: 1900 2400 per month (adjusted for cost of living and experience) Start Date: As soon as possible Application Process Deadline: 1 March 2026 (EOD) Applicants must submit: CV or Resume A 2-minute phone video explaining: Why you re excited about the role How your experience fits ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Completed application form (where you upload CV and video) Shortlisted candidates will attend a group interview on 9 March 2026 (2 3 PM CET). Click here for more information discover more opportunities here The post WWF Innovation Project Coordinator Team Support (Remote, March–December 2026) appeared first on Opportunities for Youth .","tags":["education","Jobs"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T02:35:38Z","updated_at":"2026-02-24T02:35:38Z"}
