{"id":"7d508aa572f78a863edf35d8da35bb542c7182c1","title":"Communications Design Lead at YLabs: A Senior Role Shaping Global Youth-Focused Impact","url":"https://opportunitiesforyouth.org/2026/02/23/communications-design-lead-at-ylabs-a-senior-role-shaping-global-youth-focused-impact/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T01:08:39Z","summary":"YLabs, a global design and research organization dedicated to improving health and economic opportunities for young people, is seeking a Communications Design Lead . This senior consulting role is ideal for design professionals who excel at transforming complexity into clarity, and who are eager to contribute to projects impacting young people across Africa, Asia, and Latin America. With a strong foundation in human-centered design and experience working in diverse global contexts, the successful candidate will help shape high-quality communication and design outputs that support strategic decision-making, research translation, and global development initiatives. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); YLabs works with young people aged 10 24 to co-create solutions in areas such as sexual and reproductive health, HIV/AIDS, mental health, climate resilience, and financial inclusion. The organization maintains teams across the United States and Rwanda, operating in hybrid and remote formats within the GMT+0 to GMT+4 time zones. About the Role at YLabs The Communications Design Lead will play a central role in converting research insights, system maps, stakeholder feedback, and program strategies into compelling, high-fidelity visual frameworks. This is a full-time consultancy position at 40 hours per week, with an expected start date of March 1, 2026 . The contract runs for three months with the possibility of extension depending on performance and project needs. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Candidates ideally based in East Africa or elsewhere within GMT+0 to GMT+4 are encouraged to apply. YLabs is looking for someone who combines visual design mastery with strong systems thinking, UI/UX fluency, and interdisciplinary communication skills. Core Responsibilities The Communications Design Lead will collaborate closely with multidisciplinary teams, partners, and funders to produce contextualized, relevant, and actionable design outputs. Responsibilities include: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Designing high-fidelity frameworks, toolkits, and visual assets that support alignment across teams. Translating complex research and abstract concepts into intuitive visual communication. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Applying strong design fundamentals, including accessibility, hierarchy, layout, and typography. Conducting sensemaking from user insights and incorporating them into design decisions. Maintaining and extending YLabs existing visual identity through coherent, thoughtful design. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Creating front-end UI/UX concepts and digital visual experiences aligned with project needs. This role requires the ability to communicate clearly across diverse audiences from local community members to C-suite leaders. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Expected Deliverables Depending on ongoing project needs, deliverables may include: Comprehensive toolkits and reusable templates Visual syntheses of research findings and insights Service design blueprints and journey maps Advanced systems maps Data visualizations and infographics Any additional outputs formally delegated by project leadership These materials will support strategic learning, program design, partner alignment, and broader communication goals. Who Should Apply YLabs is seeking candidates who bring: Strong professional experience in communication design and systems visualization A portfolio demonstrating high-fidelity frameworks and strategic design outputs Proficiency in Adobe Creative Suite, Figma, Mural, and other collaborative design tools ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Experience working with global development, innovation labs, or social impact organizations Demonstrated understanding of design for diverse and low-resource contexts, particularly within African communities Knowledge of accessibility and inclusive design principles Confidence collaborating with multidisciplinary teams ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Compensation YLabs follows Project Fair s pay equity standards to ensure fair and competitive compensation. The pay range for this senior-level consultancy is: 161,538 RWF 186,538 RWF per day (equivalent to USD 111 127 per day), tax inclusive , commensurate with experience. Application Deadline Applications are reviewed on a rolling basis until the position is filled. However, YLabs expects the successful candidate to begin on March 1, 2026 . Early applications are strongly encouraged to ensure timely review by the Hiring Committee. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Final Notes All applicant information is handled confidentially, and hiring is contingent on background checks and clearances. Only shortlisted candidates will be contacted due to the volume of applications. If you are a design professional passionate about youth empowerment, global impact, and translating complex ideas into compelling visual communication, this role offers a unique opportunity to contribute your skills at a global scale. Application can be accessed from here . To know more about such opportunities, click here . The post Communications Design Lead at YLabs: A Senior Role Shaping Global Youth-Focused Impact appeared first on Opportunities for Youth .","tags":["education","Africa","America","East Africa Consultancy Opportunities","Global Design Jobs","Human-Centered Design Africa","Social Impact Design Roles","Visual Communication Jobs","YLabs Communications Design Lead","Youth Development Careers"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"294931f42317a4c599935fb4884a6a73be5337f5","title":"Presidency Youth Climate Champion (PYCC) – COP31: A National Call for Young Climate Leaders","url":"https://opportunitiesforyouth.org/2026/02/23/presidency-youth-climate-champion-pycc-cop31-a-national-call-for-young-climate-leaders/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T01:00:53Z","summary":"The Australian Government is calling for Expressions of Interest (EOIs) from young Australians ready to shape global climate action. The Presidency Youth Climate Champion (PYCC) for COP31 will play a central role in ensuring that children and young people are not only represented, but meaningfully included, in climate decision-making at the world s most significant climate summit. This prestigious role offers a rare opportunity to influence international climate governance at the highest level. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Application Deadline: 1 March 2026, 11:30 pm AEDT About the Presidency Youth Climate Champion Role The PYCC is a non-statutory, full-time appointment for up to 20 months, created under UNFCCC Decision 16/CP.28. The position is embedded within the COP31 Presidency, enabling the selected candidate to bring youth perspectives into the heart of climate negotiations. With COP31 hosted by T rkiye and Australia serving as President of Negotiations, the PYCC will contribute to a process that directly influences climate policies shaping the futures of young people for decades to come. The role is designed to create space, voice, and influence for youth without placing responsibility for negotiating outcomes on young people themselves. The PYCC will be supported by the COP31 Presidency team and collaborate with national, regional, and international partners. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Key Responsibilities 1. Meaningful Youth Participation The PYCC will use their position to ensure children and youth can participate fully and safely across COP31-related processes. This includes supporting opportunities at events such as COY, Pre-COP, COP, and Subsidiary Body meetings. The aim is to create structured pathways for youth to contribute policy ideas and generate tangible outcomes. 2. Amplifying Youth Voices A major function of the role is to elevate the priorities of diverse youth communities including First Nations and Pacific youth within the Presidency and broader UNFCCC discussions. This may include presenting youth-led statements, sharing stocktake insights, and convening dialogues with global decision-makers. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); 3. Systems, Access, and Support The PYCC will advocate for proper safeguarding, accessibility, logistics, and resourcing to enable inclusive participation. This includes supporting COP work programs relevant to children and youth and ensuring youth-focused spaces are appropriately structured and resourced. 4. Capacity-Building The PYCC will help expand access to climate education, negotiation skills, and UNFCCC learning tools. This includes coordinating capacity-building efforts across domestic, regional, and international networks to strengthen long-term youth engagement in climate governance. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Eligibility Requirements Applicants must: Be aged 18 35 throughout the full duration of the appointment (until December 2027) Be an Australian citizen Demonstrate strong English writing and communication skills Have experience in youth engagement and climate-related work Be available for full-time commitment , including domestic and international travel, for the entire COP31 Presidency period ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Cultural capability, policy fluency, and trust-based leadership especially regarding First Nations and Pacific youth perspectives are key qualities sought in the ideal candidate. About the Opportunity This is a high-profile leadership position that requires deep collaboration with the COP31 Presidency, the UNFCCC Secretariat, YOUNGO, civil society partners, and youth networks globally. The role demands professionalism, diplomacy, and the ability to navigate complex international spaces with clarity and credibility. The PYCC will travel domestically and internationally, attend key climate meetings, and engage youth communities across Australia and beyond. Remuneration will be negotiated based on skills, experience, and institutional approvals. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Why This Role Matters The decisions made at COP31 will directly shape climate policies impacting the lives of young people. By appointing a PYCC, Australia ensures that the voices of youth are not peripheral but integrated into the climate processes that determine global pathways for adaptation, mitigation, and resilience. For young Australians seeking to contribute to global climate solutions, the PYCC role represents a landmark opportunity to drive action, amplify voices, and influence the future. Application can be accessed from here . To know about more such opportunities, click here . The post Presidency Youth Climate Champion (PYCC) – COP31: A National Call for Young Climate Leaders appeared first on Opportunities for Youth .","tags":["education","unknown","Australian Government Opportunities","Climate Governance","Climate Leadership Programs","COP31 Australia","UNFCCC Opportunities","Youth Climate Champion","youth engagement climate action"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"e94715ba4f9e650f9df12e885cf2b0cfd3fb2c26","title":"Paul D. Coverdell Fellows Program: Graduate Funding for Returned Peace Corps Volunteers","url":"https://opportunitiesforyouth.org/2026/02/23/paul-d-coverdell-fellows-program-graduate-funding-for-returned-peace-corps-volunteers/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T00:34:47Z","summary":"The Paul D. Coverdell Fellows Program offers Returned Peace Corps Volunteers (RPCVs) a unique pathway to continue their service while pursuing graduate degrees, professional certificates, and advanced training across the United States. Designed to recognise the global experience, adaptability, and community-driven skills that Volunteers gain abroad, the program provides financial assistance and hands-on professional opportunities that strengthen careers and support underserved communities. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the Paul D. Coverdell Fellows Program The Coverdell Fellows Program is an educational fellowship that supports RPCVs seeking to deepen their impact through further study. Fellows receive a combination of tuition reductions, scholarships, stipends, assistantships, or other forms of financial aid. Beyond academic support, the program keeps RPCVs connected to the Peace Corps mission by placing them in internships in the United States that address locally identified needs. This blend of education, service, and professional advancement makes the program one of the most valuable benefits available to Volunteers after returning home. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Why Become a Coverdell Fellow? Financial Support Partner universities offer fellows a range of benefits, from partial tuition reductions to full scholarships and paid assistantships. This makes advanced education more affordable and accessible for RPCVs across different fields. Hands-On Service Each Fellow completes an internship with a U.S.-based organisation, strengthening their applied skills while serving local communities. These internships align with Peace Corps values, ensuring that participants continue to support community priorities. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Professional Development Fellows build leadership skills, gain practical workplace experience, and expand their networks. Many institutions integrate internships with coursework, offering meaningful opportunities to connect learning with real-world problem-solving. Extending the Peace Corps Mission By sharing their international experiences in classrooms and local communities, Fellows help fulfil the Peace Corps third goal: to promote a better understanding of other peoples among Americans. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Choice and Flexibility With more than 150 partner universities across the United States, RPCVs can pursue degrees in social work, public health, education, international affairs, environmental studies, and many more disciplines. Federal Hiring Advantage RPCVs may qualify for extended noncompetitive eligibility for federal jobs up to three years after service, depending on agency discretion if they enrol soon after returning. Eligibility Criteria RPCVs maintain lifetime eligibility for the Coverdell Fellows Program if they meet one of the following: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Completed a full Peace Corps tour or received completion of service status. Were medically separated. Received interrupted service due to circumstances beyond their control. Completed at least 12 months of Peace Corps Response or Advancing Health Professionals service within a 24-month period. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Volunteers who resigned or were administratively separated are not eligible unless they previously earned eligibility through earlier service. Questions about eligibility can be directed to the Peace Corps Office of University Programs. How to Apply Applications to the Coverdell Fellows Program are handled directly by partner universities. The Peace Corps does not manage or decide individual admissions. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Prospective applicants should: Contact coordinators at participating universities. Request detailed program and application information. Follow each school s deadlines, requirements, and instructions carefully. Prepare necessary materials such as transcripts, test scores (if required), and a signed Description of Service (DOS). Many universities allow RPCVs to apply online, even while still abroad. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application Deadline Because each partner institution manages its own application cycle, deadlines vary by program . RPCVs should check the specific due dates for every university they plan to apply to. Why This Program Matters For RPCVs, the Coverdell Fellows Program is more than an academic opportunity it is a chance to build on global service, strengthen local communities, and gain meaningful professional experience. Whether through public health work, educational initiatives, or community development, Fellows continue to advance the core principles of the Peace Corps while preparing for impactful careers. Application can be accessed from here . To know more about such opportunities, click here . The post Paul D. Coverdell Fellows Program: Graduate Funding for Returned Peace Corps Volunteers appeared first on Opportunities for Youth .","tags":["education","America","Fellowship","Community Service Internships","Coverdell Fellows Program","Graduate Fellowships USA","Peace Corps Benefits","Returned Peace Corps Volunteers","RPCV Education Funding","University Partnerships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"b715494676bbc30cd132cc56aab89d34fa9efdf2","title":"RiseUp with ServiceNow x The Diana Award: A Free 10-Week Tech Career Accelerator for Young People in Africa","url":"https://opportunitiesforyouth.org/2026/02/23/riseup-with-servicenow-x-the-diana-award-a-free-10-week-tech-career-accelerator-for-young-people-in-africa/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-23T00:18:34Z","summary":"The Diana Award, in partnership with ServiceNow, has opened applications for RiseUp: Advanced Foundations a fully funded, 10-week programme designed to help young people launch careers in the fast-growing ServiceNow technology ecosystem. Through hands-on training, mentoring, and a globally recognised certification pathway, the programme equips participants with the practical and professional skills needed to succeed in tech. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the RiseUp: Advanced Foundations RiseUp: Advanced Foundations is a full-time, intensive learning experience aimed at democratising access to technology careers. Delivered entirely online, the programme runs from 13 April to 19 June 2026 , Monday to Friday, 9:00 17:00 SAST. It is open to young people aged 18 30 based in Kenya, Nigeria, and South Africa , and offers free training to ensure that financial barriers do not limit potential. The initiative forms part of The Diana Award s mission to create meaningful opportunities for young people, while ServiceNow contributes its expertise to open pathways into one of the world s most in-demand digital platforms. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Who Can Apply? The programme is ideal for individuals who are motivated to begin a career in tech, regardless of whether they have prior experience or formal qualifications. Applications are open to: Young people aged 18 30 Residents of Kenya, Nigeria, or South Africa Individuals not currently employed by ServiceNow, a ServiceNow customer, or a ServiceNow partner ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The programme especially encourages participation from groups underrepresented in the tech industry. The ideal learner is: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Proficient in English Curious and eager to learn Able to think through problems logically Comfortable collaborating with others and explaining ideas Ready to commit full-time for the entire 10-week duration Programme Benefits Participants will gain comprehensive training in the ServiceNow ecosystem, building both technical knowledge and professional confidence. The programme offers: Technical Skills Learners will develop hands-on experience in: Application design, development, and management Using Flow Designer, Service Catalog, and JavaScript User interface design and process automation Analytical and communication skills relevant to IT environments Foundations of artificial intelligence and responsible AI usage ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); By the end of the programme, participants will be equipped to support digital workflows, automate tasks, and contribute effectively in tech roles. Employability and Career Skills The programme includes: Personalised one-to-one mentoring Group networking opportunities with professionals Industry-recognised certification (after examination) Ongoing job placement and career support These elements together provide a strong foundation for employment and long-term career growth. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Career Pathways After Completion Graduates of RiseUp: Advanced Foundations can pursue a wide range of entry-level tech roles across companies that use ServiceNow. Potential career paths include: Platform Developer or Application Specialist Junior Technical Consultant Software Developer Analyst or Operations Specialist The programme prepares participants with the skills, confidence, and credentials needed to enter the tech workforce immediately. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Additional Programme Features Mentorship Participants may opt for one-on-one guidance from experienced mentors who provide personalised advice, help navigate challenges, and support learners in identifying their strengths. Mental Fitness Workshops Led by The Diana Award, these sessions focus on wellbeing, confidence, and resilience key elements for navigating the professional world. Networking Opportunities Throughout the programme, participants will connect with peers, alumni, industry experts, and employer partners, building community and expanding professional networks. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application Process The application journey includes: Submitting an Expression of Interest form Attending an introductory webinar Completing ServiceNow onboarding Receiving a conditional offer Completing pre-work on the ServiceNow platform Starting the programme Application can be accessed from here . To know more about such opportunities, click here . The post RiseUp with ServiceNow x The Diana Award: A Free 10-Week Tech Career Accelerator for Young People in Africa appeared first on Opportunities for Youth .","tags":["education","Short Courses","Africa","Free Tech Programme","Kenya Nigeria South Africa Opportunities","RiseUp with ServiceNow","ServiceNow Certification","Tech Training Africa","The Diana Award","Youth Career Development"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"bd1003ebd09821bafff7ba9b866057d5e6fe0eeb","title":"Massive Global Funding Opportunity: Submit Your Expression of Interest for the GPE Education Out Loud Grant Agent","url":"https://opportunitiesforyouth.org/2026/02/22/massive-global-funding-opportunity-submit-your-expression-of-interest-for-the-gpe-education-out-loud-grant-agent/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T18:16:52Z","summary":"If your organization works to transform education systems through civil society engagement, transparency, and accountability, this is a career-defining global opportunity you can t afford to miss. The Request for Expression of Interest: GPE Education Out Loud Grant Agent is now officially open. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); What Is Education Out Loud (EOL)? Education Out Loud (EOL) is the largest global fund exclusively dedicated to supporting civil society engagement in education policy, public accountability, and transparency financed by the Global Partnership for Education (GPE) and implemented globally. EOL empowers civil society organizations to influence education planning, strengthen accountability mechanisms, and shape policies to improve learning outcomes for millions, especially the most marginalized. About GPE EOL The Global Partnership for Education (GPE) is the world s largest global fund dedicated to transforming education in low- and middle-income countries. GPE provides strategic finances, policy support, and advocacy leadership to help countries achieve equitable learning outcomes. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); As the manager of one of GPE s key advocacy instruments, Education Out Loud supports civil society organizations to: Increase transparency and monitoring of public education Influence national and regional policy reforms Build accountability mechanisms Strengthen data, research, and evidence-generating capacities ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Purpose of the Grant Agent Role GPE is seeking qualified organizations or consortia to serve as the next phase Grant Agent for Education Out Loud. The selected agent will: Oversee and manage the EOL fund portfolio across GPE partner countries. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Provide fiduciary and operational oversight of grants. Drive strategic support for civil society engagement in education advocacy . Strengthen learning, monitoring, evaluation, and communication across the portfolio. Work closely with GPE, civil society partners, and key stakeholders globally. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); This role influences how education advocacy and accountability are supported at scale across regions and political contexts. Who Can Apply? This call is open to: Not-for-profit organizations, international NGOs, multilaterals, civil society organizations Consortia / partnerships of organizations Entities with proven capacity to manage large, complex global grant portfolios Indirect cost recovery is capped (e.g. at 7% per some public posts shared about eligibility). In practice, eligible applicants will have: Strong financial management, transparency, and accountability systems Experience working across diverse regions and contexts Experience supporting civil society and advocacy networks Technical expertise in education policy, civic engagement, and civil sector development ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Capacity to manage complex, multi-stakeholder global grant portfolios (Exact eligibility criteria are detailed in the official EOI docs linked above) What to Submit Your Expression of Interest should demonstrate: Organizational capacity systems, staffing, and financial controls Experience in civil society and advocacy funding Global or multi-regional reach and language capabilities Potential to manage fiduciary compliance, learning, and accountability frameworks Proposed consortium arrangements (if applicable) ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Applications usually require: Cover letter / EOI statement Organizational profile and legal status Financial documents and audit reports Team CVs / resumes Proposed approach to managing EOL portfolio (Refer to the official call document for the exact template) Benefits of Becoming the Grant Agent Serving as the Education Out Loud Grant Agent provides: 1. Global leadership platform steward one of the world s largest civil society education funds 2. Influence on education advocacy policy processes worldwide 3. Strengthen institutional reputation in education systems transformation 4. Strategic partnerships with GPE, governments, NGOs, and civil society 5. Opportunity for organizational growth and learning in complex program management ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Start early deadlines are strict. Register for the webinar to clarify expectations. Prepare a comprehensive EOI narrative demonstrating impact, capacity, and accountability . Strengthen your consortium with partners that bring regional depth and technical expertise. Key Deadlines Timeline Milestone Date Call published January 2026 Information Webinar 23 February 2026 (07:00 ET) Register submit questions in advance by 16 February 2026 . EOI Submission Deadline 27 March 2026 Review / Selection Through June December 2026 Expected Start of Next Phase January 2027 Note: Webinar Q A and FAQ documents will be published after the webinar to support applicants. Apply here For more information visit here For more global opportunities click here The post Massive Global Funding Opportunity: Submit Your Expression of Interest for the GPE Education Out Loud Grant Agent appeared first on Opportunities for Youth .","tags":["education","Grants","Africa","America","Asia","Australia and Oceania","Continent","Europe","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"69ada12d1572f1a3dac56008f539658d2c2082bb","title":"PG&E Grants and Scholarships 2026 – STEM Funding, Financial Aid and How to Apply","url":"https://opportunitiesforyouth.org/2026/02/22/pge-grants-and-scholarships-2026-stem-funding-financial-aid-and-how-to-apply/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T18:15:08Z","summary":"If you re a student aiming for college funding, scholarships , or STEM support , this is the most complete guide you need packed with deadlines, requirements, links, qualifications, benefits, and expert tips to help you apply successfully. Based on the official PG E scholarship programs, here s everything you must know before time runs out. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); What Are PG E Scholarships? Pacific Gas and Electric Company (PG E) offers high-impact scholarships to help students across Northern and Central California pursue undergraduate degrees, especially in STEM (Science, Technology, Engineering Math) or community-focused initiatives. These awards ranging from $1,000 to $10,000 are designed to reduce the burden of college costs and reward academic excellence, leadership, financial need, and community impact. In 2025 alone, PG E awarded nearly 150 scholarships across these programs. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Who Should Apply: This program is ideal for students pursuing degrees in STEM fields particularly in engineering, computer science, environmental or biological sciences, physics, and math. Key Scholarship Programs Deadlines (2026) 1. PG E Better Together STEM Scholarships Application Opens: 12th January, 2026 Deadline: 12th March, 2026 Award Amounts: $2,500 $10,000 (varies by award) ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); 2. PG E ERG ENG Scholarships (Community Cause-Based) Application Opens: January 12, 2026 Deadline: February 28, 2026 Award Amounts: Typically $1,000 $6,000 (varies per scholarship) These scholarships are funded by PG E s Employee Resource Groups (ERGs) and Engineering Network Groups (ENGs) to support students connected to specific communities, causes, or industry goals. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Who Is Eligible? (Qualifications) For Both Scholarship Programs: Must be one of the following: High school senior or graduate Student with a GED Current college undergraduate Non-traditional student (e.g., adult learner, returning student, veteran) Must reside in PG E s service territory or be a dependent of someone who does. Must plan to enroll full-time in an accredited college or university in the fall semester. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); For STEM Scholarships: Must be pursuing your first undergraduate degree Must be enrolled or planning to enroll at: A 4-year college/university in California, OR A U.S. Historical Black College or University (HBCU) Scholarship Benefits What You Get 1. Financial Support Awards typically range from $1,000 to $10,000 Paid directly to your school in most cases ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); 2. Career Academic Recognition Scholarship awardees receive recognition for their accomplishments and may enhance resumes, internship and job applications. 3. Networking Community Support ERG and ENG participants connect with mentors, industry professionals, and student leaders expanding career opportunities. 4. No Discrimination on Race or Gender The community-driven scholarships are open to all students , with encouragement to apply to multiple awards for which you qualify. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); What You ll Need to Apply Most PG E scholarship applications require: Academic records (transcripts) Personal statement or essays Proof of residency in PG E service territory College enrollment plans or acceptance letter Letters of recommendation (for many ERG/ENG awards) Financial need and leadership examples (for merit-based STEM awards) Apply here Tips to Maximize Your Chances 1. Apply to multiple scholarships available under the ERG ENG umbrella your chances of winning improve significantly. 2. Start early: some supplemental essay requirements are unique to each scholarship. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); 3. Tailor essays to reflect community impact, leadership roles, career goals, and alignment with PG E s mission. 4. Recommend getting recommendations from teachers, mentors, or employers who can speak to your achievements. These PG E scholarships represent an exceptional opportunity to secure funding before most other scholarships open especially for students committed to STEM, leadership, community engagement, and academic success. With limited award slots and strong competition, preparedness and early action are key to your success. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); For more information visit here For more global opportunities click here The post PG E Grants and Scholarships 2026 – STEM Funding, Financial Aid and How to Apply appeared first on Opportunities for Youth .","tags":["education","Continent","America","Grants","Scholarships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"db4a291edb70dee87641f6b0a9a6a1c67051cf76","title":"CAMHRA Masters Scholarships 2026/2027 at SOAS: Full Tuition Funding for Mental Health Anthropology Studies","url":"https://opportunitiesforyouth.org/2026/02/22/camhra-masters-scholarships-2026-2027-at-soas-full-tuition-funding-for-mental-health-anthropology-studies/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T15:35:02Z","summary":"The Centre for Anthropology and Mental Health Research in Action (CAMHRA) is pleased to announce the CAMHRA Masters Scholarships 2026/2027 at SOAS University of London. These prestigious scholarships cover full tuition fees for eligible students pursuing postgraduate study in the anthropology of mental health. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); With funding available for both UK and overseas applicants, this opportunity supports outstanding candidates committed to advancing research and practice at the intersection of anthropology and mental health. Application Deadline: 30 April 2026 (11:59pm UK local time) About CAMHRA CAMHRA is a UKRI-funded research centre based in the SOAS Department of Anthropology and Sociology. It serves as a globally oriented, locally connected hub for innovative anthropological research, education, and public engagement on mental health. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Working with academic institutions, healthcare providers, policymakers, and service users, CAMHRA contributes anthropological perspectives to global conversations on mental distress, systems of care, and healing practices. Eligible Programmes Scholarships are available for the following programmes beginning in 2026/27: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); MA Medical Anthropology and Mental Health (Full-time: 1 year | Part-time: 2 years) MRes Social Anthropology (Full-time: 1 year | Part-time: 2 years) ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); The MA programme integrates social, cultural, medical, and psychological anthropology, while the MRes is research-focused and typically undertaken in preparation for PhD study. Scholarship Benefits Full tuition fee coverage for 2026/27 For part-time students, tuition fees covered for 2026/27 and 2027/28 ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Approximately three overseas fee places and four home fee places awarded annually One additional international scholarship with a living stipend for applicants from Afghanistan, Iran, or Iraq (subject to annual regional designation) ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Please note: Standard scholarships cover tuition fees only and do not include accommodation or living costs. Exceptional Circumstances Stipend For 2026/27, one additional scholarship including a living stipend (in line with UKRI studentships) is available for students who are resident in, or citizens of, Afghanistan, Iran, or Iraq. The stipend in 2025/26 was 22,780 for the academic year (inclusive of London weighting). Eligible applicants must indicate this in their scholarship application. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Eligibility Criteria Applicants must: For MA Medical Anthropology and Mental Health: Hold a minimum 2:1 bachelor s degree in social sciences or humanities; OR Hold a degree in health sciences such as medicine, psychology, nursing, or social work ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); For MRes Social Anthropology: Hold a minimum 2:1 bachelor s or master s degree Applicants without an anthropology background must hold a master s degree in another field All applicants must: Propose a strong research project using ethnographic methods related to mental health ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Submit a separate application to the relevant SOAS master s programme Demonstrate academic merit and research potential Application Process Step 1: Apply to your chosen programme (MA or MRes). ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Step 2: Submit your scholarship application via the SOAS admissions portal by 30 April 2026 (11:59pm UK time). Step 3: Shortlisted candidates will be invited for an online interview in June 2026. Final offers are expected by July 2026. In the previous cycle, approximately 150 applications were received, making this a highly competitive award. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Important Information for International Students Successful international applicants must apply for a UK Student visa and demonstrate sufficient funds to meet living requirements in London (minimum 13,761 as per UK government guidance). Why Apply? The CAMHRA Masters Scholarships are designed to support individuals who may otherwise be unable to pursue postgraduate study in anthropology due to financial, social, or time constraints. The programme particularly welcomes: Applicants working in mental health services Individuals with lived experience of mental health services Candidates from underrepresented groups in anthropology ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); This scholarship offers an exceptional opportunity to develop ethnographic research expertise, contribute to global mental health debates, and prepare for advanced doctoral study or professional leadership. How to Apply Applying for the CAMHRA Masters Scholarships 2026/27 is a two-step process: Step 1 Apply to your chosen programme: For the MA in Medical Anthropology and Mental Health , submit your application via the Taught Masters applications portal . ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); For the MRes in Social Anthropology , apply through the SOAS Doctoral School portal . Ensure you meet the programme-specific eligibility criteria before applying. Step 2 Apply for the CAMHRA Scholarship: Once your programme application is submitted, access the scholarship application through the SOAS admissions portal . ezstandalone.cmd.push(function () { ezstandalone.showAds(139); }); Complete the application by 30 April 2026, 11:59pm UK local time . You will be asked to outline your motivation, proposed research project, and how your studies will make a positive impact in the field of mental health. Shortlisted candidates will be invited to an online interview in June 2026. Final scholarship offers will be made by July 2026. ezstandalone.cmd.push(function () { ezstandalone.showAds(140); }); Important: You must submit a programme application to access the scholarship application, but you do not need to have received an offer of admission before the scholarship deadline. For queries, contact scholarships@soas.ac.uk . This process ensures that your scholarship application is considered alongside your programme application, so prepare both carefully to showcase your research potential and commitment to the anthropology of mental health. ezstandalone.cmd.push(function () { ezstandalone.showAds(141); }); For further information: Programme enquiries: mastersadmissions@soas.ac.uk Centre enquiries: camhra@soas.ac.uk For more scholarships: Click Here The post CAMHRA Masters Scholarships 2026/2027 at SOAS: Full Tuition Funding for Mental Health Anthropology Studies appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Latin America and the Caribbean","Master","Middle East and North Africa","Scholarships","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"34993e08068d8c0fa78519033d2ff09776dc2372","title":"Open Call for Knowledge Transfer: €25,000 Grants for Digital Training in Sustainable Food Systems","url":"https://opportunitiesforyouth.org/2026/02/22/open-call-for-knowledge-transfer-e25000-grants-for-digital-training-in-sustainable-food-systems/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T15:28:47Z","summary":"The STREAMING initiative has officially launched its Open Call for Knowledge Transfer , inviting organizations across Africa and Europe to design and implement innovative digital training programs that strengthen sustainable food trade systems. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); With 25,000 awarded per project and a total of 11 grants available , this call presents a significant opportunity for institutions committed to advancing food system innovation, women s empowerment, and cross-continental collaboration. At least 60% of the funding will support African Third Parties , with special encouragement for women-led organizations and female innovators. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); About the Open Call This Open Call supports the development of interactive, practice-oriented digital courses that bridge the gap between research and real-world application. The goal is to connect researchers with: Farmers Food producers Start-ups Public health actors Entrepreneurs and processors ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Projects must focus on equipping these groups with practical skills to enhance sustainability, innovation, and resilience in food systems. A central priority of the program is women s empowerment , ensuring that women farmers, entrepreneurs, processors, and innovators are actively targeted and supported. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Grant Details Funding Amount: 25,000 per project Total Projects Funded: 11 Geographic Focus: Africa and Europe Funding Allocation: Minimum 60% to African Third Parties Applicants may come from any country , not limited to STREAMING partner nations. Thematic Areas Proposed training programs should address innovations in one or more of the following areas: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Traceability in the food supply chain Life cycle assessment Nutritional requirements Reducing micronutrient deficiencies Food waste reduction Sustainable farming systems Food safety Scaling innovations in food supply chains Programs should be practical, interactive, and focused on real-world application. Who Can Apply Eligible Third Parties include: Research institutions and universities NGOs and industry partners Innovation hubs Business schools Vocational colleges Consortia across Africa and Europe ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Consortium applications are welcome, and women-led organizations are strongly encouraged to apply. Application Documents Applicants must carefully review and submit the required documentation included in the Open Call Kit: Official Open Call for Proposals publication notice Knowledge Transfer Call text Proposal template (to be submitted as a PDF) Declaration of Honour (mandatory) Consortium Agreement (mandatory for consortia) Declaration on double funding (signed at submission and project completion) ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Applicants are strongly advised to review all materials thoroughly before submission. Deadline Applicants should consult the official Open Call documentation for the final submission deadline and ensure timely submission of all required documents. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Contact Information For administrative questions related to the application process, applicants may contact: Email: STREAMING@bayfor.org Additional resources available: Click Here Appendices: Appendix 1 Open Call for Proposals Appendix 2 Knowledge Transfer Call Document Appendix 3 Proposal Template Appendix 4 Declaration of Honour Absence of Conflict of Interest Appendix 5 Consortium Agreement Appendix 6 Declaration on Double Funding for Recipients This Open Call represents a powerful opportunity to strengthen sustainable food systems, promote innovation, and empower women across Africa and Europe through digital knowledge transfer initiatives. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); For more Grant Opportunities: Click Here The post Open Call for Knowledge Transfer: €25,000 Grants for Digital Training in Sustainable Food Systems appeared first on Opportunities for Youth .","tags":["education","Grants","Africa","Europe"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"3061e5a338a167fbc52b3f6f15aa5564da81edb6","title":"UniPods AI Solutions for Africa Program 2026 – Fully Funded 12-Month AI Training & Innovation Journey","url":"https://opportunitiesforyouth.org/2026/02/22/unipods-ai-solutions-for-africa-program-2026-fully-funded-12-month-ai-training-innovation-journey/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-22T05:50:02Z","summary":"Africa Needs AI Built by Africans Applications Open for Phase 1 Applications are now open for the UniPods AI Solutions for Africa Program , a 12-month pan-African initiative designed to equip university students with practical artificial intelligence (AI) skills and support them in developing, prototyping, and launching impactful AI-powered solutions for Africa. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The program combines foundational training, advanced product development, incubation, and market launch support giving participants a full pathway from learning AI to building real-world solutions. What is the UniPods AI Solutions for Africa Program? The UniPods AI Solutions for Africa Program is a multi-stage learning and innovation journey that helps students transition from AI beginners to solution builders. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The program focuses on: Practical AI and data science skills Building solutions that address African challenges Product development and innovation Entrepreneurship and market readiness Participants progress through structured phases that move from training to implementation. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Program Structure 4 Phases Phase 1: Online Foundational AI Skilling Participants gain core AI skills through a certified online program delivered in collaboration with the University of Tokyo (GCI World course). This phase covers: Data science foundations Python programming Machine learning fundamentals Practical business applications of data ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); This phase serves as the entry point into the program. Phase 2: Advanced Hybrid Training Product Development Participants advance their technical skills while beginning to design and build real AI solutions with UniPod support. Key focus areas include: Applied AI development Problem-solving for African contexts Product prototyping Team collaboration ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Phase 3: In-Person Incubation Residency Selected participants join an intensive residency at the Addis Ababa AI UniPod , where they refine their solutions with mentorship and technical guidance. Phase 4: Market Take-Off Participants test, refine, and prepare their AI solutions for launch with continued UniPod support. This phase emphasizes: Market readiness Solution validation Scaling strategies Who Should Apply? The program is designed for: University students across Africa Beginners interested in AI and data science Students passionate about solving African challenges through technology Aspiring AI innovators and entrepreneurs ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); No advanced programming experience is required to start Phase 1. Why This Program Matters Africa s digital future depends on locally built solutions. This initiative aims to empower young African innovators to: Build AI solutions relevant to African realities Gain globally recognized technical skills Work on real-world innovation projects Move from learning to launching impactful products ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Phase 1 Foundational AI Training (University of Tokyo) The first phase is delivered online through the Global Consumer Intelligence (GCI World) course developed by the Matsuo-Iwasawa Lab at the University of Tokyo. Participants will learn: Introduction to data science Data cleaning and visualization Machine learning concepts SQL and feature engineering Time series analysis Real-world data applications The course includes weekly lectures, assignments, competitions, and final projects. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Program Benefits Participants will gain: Certified foundational AI training Practical hands-on experience Access to mentorship and incubation Opportunity to develop real AI products Potential pathway to launch solutions in African markets Important Deadline Phase 1 Application Deadline: March 2, 2026 Early application is strongly recommended. How to Apply Interested students can register for Phase 1 (Foundational AI Skilling) through the official application portal. Applicants will be guided through: Email registration Platform ID creation Verification of student status Enrollment in the GCI World course ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Final Thoughts The UniPods AI Solutions for Africa Program is more than an online course it is a complete innovation pathway designed to help African students move from learning AI to building real solutions that address local challenges. If you are a student passionate about technology, innovation, and Africa s future, this is a strong opportunity to begin your AI journey. Interested students can register for Phase 1 (Foundational AI Skilling) through the official application portal. The post UniPods AI Solutions for Africa Program 2026 – Fully Funded 12-Month AI Training Innovation Journey appeared first on Opportunities for Youth .","tags":["education","Africa","Short Courses"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
{"id":"731dfe75d82becb05e4cd2544377a5d63c4dd2a5","title":"TaRL Africa Is Hiring: Country Regional Manager (Programs) – Kaduna, Nigeria | Apply by 3 March 2026","url":"https://opportunitiesforyouth.org/2026/02/21/tarl-africa-is-hiring-country-regional-manager-programs-kaduna-nigeria-apply-by-3-march-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-21T14:05:44Z","summary":"TaRL Africa is expanding its leadership team in Nigeria and is now hiring a Country Regional Manager (Programs) to drive regional scale, government partnership, and high-quality implementation of the Teaching at the Right Level (TaRL) approach. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); If you are an experienced program leader with a strong background in education systems reform, government engagement, and multi-state program management, this is an opportunity to lead transformative change at scale. Position: Country Regional Manager, Programs Location: Kaduna, Nigeria Reports to: Country Director, TaRL Africa Nigeria About TaRL Africa TaRL Africa is hosted by Empower Learning Africa, a not-for-profit organization headquartered in Nairobi, Kenya, with teams across C te d Ivoire, Nigeria, and Zambia. The initiative was launched in 2019 as a joint venture between Pratham and J- PAL. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); TaRL Africa partners with governments and organizations across more than 15 Sub-Saharan African countries to accelerate children s foundational skill acquisition using the evidence-based Teaching at the Right Level methodology. Together with partners, the initiative has reached over five million children. Our vision is for every child across Africa to have strong foundational skills that unlock lifelong opportunity. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); About the Role: Country Regional Manager (CRM) The Country Regional Manager (CRM) will lead and expand TaRL programming within a defined region in Nigeria. This role oversees implementation across multiple states, manages regional teams, strengthens partnerships with state governments, and ensures program delivery with fidelity, scale, and sustainability. As a key member of the Country Management Team, you will shape regional strategy, drive operational excellence, oversee budgets, and lead continuous program improvement. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); This position requires extensive travel within the region and occasional travel across Nigeria and Africa. Key Responsibilities 1. Program Leadership Partnership Management (40%) Strengthen technical implementation of the Teaching at the Right Level model. Ensure high-quality program delivery through data-informed decision-making. Provide oversight to state teams to maintain financial health and operational efficiency. Guide annual planning cycles and conduct periodic program reviews. Build strong, productive relationships with government stakeholders and community partners. Drive contextual program design aligned with regional needs. 2. Regional Strategy Scale (30%) Identify and execute strategic expansion opportunities across states. Promote government ownership and long-term sustainability. Translate regional priorities into coordinated work plans and budgets. Use needs assessments, stakeholder insights, and program data to refine strategy. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 3. Strengthening the TaRL Ecosystem (15%) Improve operational tools, systems, and accountability frameworks. Lead special innovation projects in collaboration with Programme Design, Pedagogy, and Monitoring, Learning Evaluation teams. Contribute to cross-state learning and organizational knowledge sharing. 4. Team Leadership Performance Management (15%) Build, mentor, and manage high-performing regional teams. Set clear performance goals and monitor progress. Foster accountability, ownership, and continuous professional development. Cultivate a collaborative and impact-driven team culture. Who We Are Looking For We are seeking a results-oriented leader with: Proven experience managing medium to large-scale education or development programs Strong stakeholder engagement experience with governments and donors Demonstrated ability to lead multi-state implementation Strategic planning and expansion expertise Budget oversight and financial management capability Strong analytical and data-driven decision-making skills Excellent written and verbal communication skills ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Minimum Qualifications Bachelor s degree in Public Policy, International Development, Education, or related field (Master s degree such as MPA or MPP preferred). At least six (6) years of experience managing medium to large-scale programs. Experience working with donors, policymakers, researchers, and government agencies. Strong proficiency in Excel, Word, PowerPoint, and Google Suite. Excellent communication skills. Why Join TaRL Africa? This is more than a job. It is a leadership opportunity to shape foundational learning outcomes for millions of children across Nigeria. You will: Influence education reform at scale Strengthen government systems for sustainable impact Lead high-performing teams across multiple states Contribute to a growing, mission-driven organization operating across Africa Play a key role in evidence-based education transformation ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); If you are ready to lead with purpose and deliver measurable impact, we encourage you to apply. Application Deadline: 3rd March 2026 APPLY HERE For more information on this job opportunity, click here . For more opportunities on jobs , click here . The post TaRL Africa Is Hiring: Country Regional Manager (Programs) – Kaduna, Nigeria | Apply by 3 March 2026 appeared first on Opportunities for Youth .","tags":["education","Africa","Jobs"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-23T02:39:10Z","updated_at":"2026-02-23T02:39:10Z"}
