{"id":"51106868473ccfc5d6e81a6d4343012bfc5f693b","title":"UNFPA Adolescents and Youth Fellow 2026 in Egypt: International UN Youth Volunteer Role with $2,012 Monthly Allowance + $4,000 Entry Lump Sum","url":"https://opportunitiesforyouth.org/2026/02/25/unfpa-adolescents-and-youth-fellow-2026-in-egypt-international-un-youth-volunteer-role-with-2012-monthly-allowance-4000-entry-lump-sum/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T12:25:05Z","summary":"The United Nations Population Fund (UNFPA), through the United Nations Volunteers (UNV) programme, is recruiting an International Adolescents and Youth Fellow to be based in Cairo, Egypt for a 12-month full-time assignment (with the possibility of extension). ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This international onsite UN Youth Volunteer opportunity places young professionals at the heart of regional programming on adolescent sexual and reproductive health and rights (SRHR), Comprehensive Sexuality Education (CSE), gender equality, and youth empowerment across the Arab region. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Advertisement End Date: 03 May 2026 Expected Start Date: 26 March 2026 Duty Station: Cairo, Egypt Duration: 12 Months (possible extension) Modality: Onsite Volunteer Category: International Youth UN Volunteer ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); About UNFPA UNFPA is the United Nations sexual and reproductive health agency. Its mission is to ensure: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Every pregnancy is wanted Every childbirth is safe Every young person s potential is fulfilled UNFPA works to advance Sustainable Development Goal 3 (Good Health and Well-being) and is guided by three transformative results: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Ending unmet need for family planning Ending preventable maternal death Ending gender-based violence and harmful practices Innovation, youth participation, and partnerships are central pillars of UNFPA s regional strategy. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Context of the Role The Arab region has a youthful demographic profile, with approximately 40% of the population under 20 years old. While this represents enormous development potential, it also presents challenges including: Adolescent pregnancy Unmet need for family planning Gender-based violence Limited access to youth-responsive health services The Adolescents and Youth Fellow will support regional programming on: Comprehensive Sexuality Education (CSE) Youth-responsive health services Adolescent Sexual and Reproductive Health (ASRH) Youth policy engagement Innovation and partnerships Key Responsibilities 1. Programme Development and Knowledge Management The Fellow will: Develop and disseminate knowledge products on adolescent SRHR trends Adapt Global CSE Academy modules for the Arab region Document innovative practices from country offices and youth-led organisations Support the Adolescents and Youth Community of Practice Assist in developing adolescent pregnancy profiles for Palestine and Egypt Contribute to multi-country proposals 2. Regional Partnership and Coordination The Fellow will: Support partnerships with the League of Arab States (LAS) Collaborate with UN agencies and youth-led organisations Explore research on Artificial Intelligence and adolescent health Support development of a Regional Healthy Lifestyles Framework Coordinate regional ASRH and CSE Ideathon Labs Support humanitarian integration of youth-focused responses 3. Monitoring, Evaluation and Advocacy The Fellow will: Compile monitoring data on youth programmes Draft advocacy materials and human interest stories Map regional and global policy events Support UN Volunteer engagement initiatives ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Required Qualifications Education Bachelor s degree in: Development studies Public health Social sciences International affairs Or related fields Experience Minimum 2 years of relevant professional experience. Language Requirements Arabic (Fluent Required) English (Fluent Required) French (Working knowledge Desirable) Nationality Requirement Candidates must be nationals of a country other than Egypt. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Desired Skills Programme/project management support Youth-led programming experience Knowledge of ASRH and SRHR Results-Based Management (RBM) understanding Strong communication skills Ability to work in multicultural environments Benefits and UN Volunteer Entitlements Selected International UN Youth Volunteers receive: Volunteer Living Allowance: USD 2,012.45 per month Entry Lump Sum: USD 4,000 (one-time payment) Exit Lump Sum upon completion 100% medical and life insurance coverage Access to UNV E-Campus and LinkedIn Learning Training and professional development opportunities Full conditions of service available via the UNV platform. Living Conditions in Cairo Cairo is a family duty station offering: Quality healthcare and education Cultural and historical richness Strong connectivity to Africa, Europe, and the Middle East Access to modern infrastructure and services ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Why Apply? This role provides: Hands-on UN experience Regional policy exposure Youth-focused programming leadership International development networking Financial support package It is an ideal stepping stone for careers in: International development Public health Gender and youth policy UN and multilateral institutions Application Deadline 03 May 2026 START YOUR APPLICATION NOW Learn more about the UNFPA Adolescents and Youth Fellow HERE . ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); For more other global fellowship opportunities, subscribe to OFY HERE . The post UNFPA Adolescents and Youth Fellow 2026 in Egypt: International UN Youth Volunteer Role with $2,012 Monthly Allowance + $4,000 Entry Lump Sum appeared first on Opportunities for Youth .","tags":["education","Africa","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T13:17:04Z","updated_at":"2026-02-25T13:17:04Z"}
{"id":"8bcd47a7f5818bab049db5b00496807fac49483e","title":"Seeds of Democracy 2026: Call for Proposals for ALDA Member Organisations","url":"https://opportunitiesforyouth.org/2026/02/25/seeds-of-democracy-2026-call-for-proposals-for-alda-member-organisations/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T11:09:55Z","summary":"ALDA the European Association for Local Democracy has launched its 2026 Call for Proposals under the Seeds of Democracy: Connecting People and Communities initiative . This opportunity supports local organisations in developing projects that strengthen democracy, community engagement, and European values through participatory, inclusive, and citizen-led actions. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); As part of ALDA s Operating Grant under the CERV programme, the call will fund 12 projects , each receiving 15,000 EUR , with the grant covering 100% of eligible costs . The deadline to apply is 1 April 2026 at 23:59 CET . ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Who Can Apply for Seeds of Democracy This call is open exclusively to legal, non-profit entities established in an EU Member State , and only ALDA members are eligible at the time of the grant contract signature. Eligible organisations may be local associations, foundations, civic groups, community organisations, or NGOs committed to democratic participation and local development. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); All activities funded under this call must be implemented within the European Union . ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Purpose of the Call The Seeds of Democracy initiative aims to support projects that: Strengthen local democracy and civic participation Engage citizens in community-led processes Promote European values at the local level Foster inclusive and participatory decision-making Build a stronger sense of belonging and shared responsibility ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Projects should demonstrate how they will empower local actors, encourage collaboration with decision-makers, and translate EU rights and values into tangible local practices. ALDA s Thematic Hubs Applicants must design their proposals within one of ALDA s five Thematic Hubs. Each proposal must clearly identify the chosen hub and demonstrate how the action contributes to its priorities. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Environment Climate Hub Projects addressing climate change, circular economy, green skills, and inclusive environmental transitions. Priority themes: Inclusive green transition Local community engagement in climate action Digital Innovation Hub Projects using digital tools to support democracy, combat disinformation, or promote e-governance. Priority themes: Online participation and transparent decision-making Media and information literacy Gender Inclusion Human Rights Hub Actions promoting gender equality, human rights education, anti-discrimination, and protection of marginalised groups. Priority themes: Representation of women and marginalised communities Countering hate speech and gender-based violence Migration Hub Projects strengthening the participation and inclusion of migrants, refugees, and diaspora communities. Priority themes: Community-led inclusion initiatives Combatting misinformation and promoting positive narratives ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Youth Empowerment Education Hub Projects supporting youth participation, political education, and youth-led democratic action. Priority themes: Strengthening young people s capabilities Supporting local actors working with youth Territorial Local Development Hub Actions focusing on sustainable cities, SDG localisation (especially SDG 11), urban regeneration, cultural heritage, and community-led territorial development. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Funding Details Each selected project will receive a 15,000 EUR grant , covering the full cost of eligible activities. A total of 12 projects will be funded in 2026. How to Apply Applicants must complete the official application form and attach all required documents, including the budget and declaration templates. ALDA will provide guidance throughout the process and will host an online information webinar on 4 March 2026 at 12:00 CET to support applicants. For additional clarification or support, organisations can contact ALDA s regranting team. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); A Strong Opportunity for Local Democracy The Seeds of Democracy Call for Proposals empowers local organisations to lead meaningful, community-rooted initiatives that strengthen democratic values across Europe. With full funding support, a clear thematic structure, and opportunities for collaboration, the call invites ALDA members to champion local actions that reflect the principles of participation, inclusion, and shared European identity. Application Deadline: 1 April 2026 at 23:59 CET Application can be accessed from here . To know more about such opportunities, click here . The post Seeds of Democracy 2026: Call for Proposals for ALDA Member Organisations appeared first on Opportunities for Youth .","tags":["education","Europe","Grants","ALDA call for proposals","CERV programme","community engagement grants","EU civic participation","European values initiatives","local democracy projects","Seeds of Democracy 2026"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T13:17:04Z","updated_at":"2026-02-25T13:17:04Z"}
{"id":"c8beb0960e745551505d192ccb5e6866376a053a","title":"Changemakers for Equality 2026 Program for Social Entrepreneurs in Asia","url":"https://opportunitiesforyouth.org/2026/02/25/changemakers-for-equality/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T11:06:40Z","summary":"The Changemakers for Equality 2026 program is now accepting applications from young social entrepreneurs in Asia who are developing innovative solutions to tackle structural inequality in their communities. Supported by the Julius Baer Foundation, the Changemakers initiative aims to empower social innovators working across areas such as education, economic inclusion, and community infrastructure. The Changemakers program deadline is 29 March 2026 at 23:59 GMT, and eligible applicants are encouraged to submit their applications before the deadline. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the Changemakers for Equality Program The Changemakers for Equality initiative is designed to identify and support emerging social entrepreneurs who are addressing systemic inequalities across Asia. The program focuses on supporting innovators who are not only responding to immediate challenges but are also tackling the deeper structural causes of inequality within their societies. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Through the Changemakers program, selected participants gain access to mentorship, funding opportunities, and a network of global leaders and innovators committed to building more equitable communities. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Structural inequality remains a significant challenge across many parts of the world, including Asia. Issues such as unequal access to education, limited economic opportunities, and infrastructure gaps continue to affect millions of people. The Changemakers program aims to support individuals who are actively working to create sustainable solutions to these challenges. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); By connecting social entrepreneurs with international networks and resources, the program helps participants scale their initiatives and amplify their impact. Benefits of the Changemakers for Equality Program The Changemakers for Equality program provides a range of benefits designed to strengthen the capacity of social entrepreneurs and help them expand their impact. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Participants in the Changemakers program will receive: Access to a global community of social entrepreneurs and changemakers Tailored capacity-building programs designed to strengthen leadership and project implementation Opportunities to collaborate with innovators across different regions Seed funding to support cross-border collaboration and project expansion Mentorship from experienced leaders and experts in social innovation These benefits are designed to help social entrepreneurs transform their ideas into scalable initiatives that address structural inequality. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Focus Areas of the Changemakers Program The Changemakers for Equality initiative supports projects that tackle inequality across a wide range of sectors. Applicants are encouraged to propose innovative solutions that address systemic challenges in their communities. Key focus areas include: Education access and quality improvement Economic inclusion and livelihood development Community infrastructure and development Social innovation addressing inequality Programs that empower marginalized communities Projects that address the root causes of inequality and demonstrate potential for long-term impact are particularly encouraged. Who Should Apply to the Changemakers Program The Changemakers for Equality program is open to young social entrepreneurs in Asia who are actively developing initiatives to reduce inequality in their communities. Ideal candidates include: Social entrepreneurs addressing structural inequality Innovators working on education and economic empowerment initiatives Community leaders developing solutions for marginalized populations Nonprofit founders or startup leaders working on social impact projects Individuals who demonstrate strong leadership and commitment to equality Applicants should demonstrate a clear understanding of the systemic issues they aim to address and provide evidence of their project s potential impact. Capacity Building in the Changemakers Program One of the key components of the Changemakers for Equality program is its focus on capacity building. Participants will receive tailored training and development opportunities designed to strengthen their ability to lead and scale social innovation projects. Capacity-building activities may include: Leadership training and strategic planning Impact measurement and evaluation Cross-border collaboration and partnership development Community engagement strategies Resource mobilization and funding strategies ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); These learning opportunities help participants develop the skills necessary to expand their initiatives and create lasting social change. Duration and Program Format The Changemakers for Equality 2026 program includes several activities designed to support collaboration and knowledge sharing among participants. The program typically includes: Networking with global changemakers and experts Collaborative learning sessions and workshops Opportunities for cross-border partnerships Engagement with leaders in social innovation ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Through these activities, participants become part of a growing network of innovators committed to building more inclusive and equitable societies. How to Apply for the Changemakers for Equality Program Applicants interested in joining the Changemakers for Equality 2026 program must submit their applications through the official application platform. The application process generally involves: Completing the online application form Providing details about the social innovation project Explaining how the initiative addresses structural inequality Submitting supporting documents if required ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Applicants should clearly describe the impact of their project and how participation in the Changemakers program will help expand their initiative. APPLY HERE Deadline Applications for the Changemakers for Equality 2026 program must be submitted before the deadline. Application Deadline: 29 March 2026 (23:59 GMT) Late applications may not be considered, so applicants are encouraged to apply early. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Final Note The Changemakers for Equality program represents an important opportunity for social entrepreneurs in Asia who are committed to tackling inequality and empowering their communities. Through mentorship, capacity building, and funding support, the program helps innovators scale solutions that address the root causes of social and economic inequality. If you are a social entrepreneur working to create more equitable societies, the Changemakers program could provide the resources and networks needed to accelerate your impact. For more global fellowships, scholarships, grants, and social innovation opportunities, here . ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); The post Changemakers for Equality 2026 Program for Social Entrepreneurs in Asia appeared first on Opportunities for Youth .","tags":["education","Fellowship","Asia"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T13:17:04Z","updated_at":"2026-02-25T13:17:04Z"}
{"id":"396dca8497c82b060b8f94958e412f4cbba55c6f","title":"Lab of Tomorrow 2026 Blue Economy Innovation Program in Durban","url":"https://opportunitiesforyouth.org/2026/02/25/lab-of-tomorrow-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T10:54:07Z","summary":"The Lab of Tomorrow 2026 is now accepting applications from African innovators, entrepreneurs, and solution builders who are working to transform the Blue Economy. The Lab of Tomorrow program will take place 23 25 March 2026 in Durban, South Africa, bringing together African innovators and German industry leaders to co-create scalable solutions for ocean sustainability and economic growth. Applications are currently open for innovators who want to develop impactful ventures in the ocean innovation space. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the Lab of Tomorrow The Lab of Tomorrow is an innovation platform designed to support entrepreneurs and innovators who are tackling real-world challenges in the Blue Economy. Organized in collaboration with Deutsche Gesellschaft f r Internationale Zusammenarbeit (GIZ) GmbH, the Southern African-German Chamber of Commerce and Industry, and OceanHub Africa, the Lab of Tomorrow connects innovators with industry partners to develop viable solutions that can scale beyond the workshop environment. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Unlike traditional innovation programs that focus solely on ideation, the Lab of Tomorrow emphasizes practical implementation and venture development. Participants will work closely with international experts, corporate partners, and fellow innovators to refine their ideas and transform them into scalable ventures. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The program aims to strengthen collaboration between African innovators and German companies, creating opportunities for technology transfer, strategic partnerships, and sustainable ocean innovation initiatives. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); By participating in the Lab of Tomorrow, innovators gain access to global networks, mentorship opportunities, and potential pathways toward incubation and business development. Benefits of the Lab of Tomorrow The Lab of Tomorrow offers participants a unique platform to collaborate with global experts, industry leaders, and fellow innovators in the Blue Economy ecosystem. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Key benefits include: Opportunity to collaborate with German industry leaders and corporate partners Access to international networks and partnerships Exposure to venture development strategies and innovation frameworks Opportunity to co-create scalable solutions for ocean sustainability Potential pathway into OceanHub Africa s structured incubation program Networking opportunities with entrepreneurs, investors, and innovation experts The program focuses on turning innovative ideas into real-world solutions that can create economic and environmental impact within the Blue Economy. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Focus Areas of the Lab of Tomorrow The Lab of Tomorrow focuses on addressing key challenges and opportunities within the Blue Economy sector. Participants are encouraged to develop solutions that contribute to sustainable ocean management and economic development. Focus areas may include: Sustainable fisheries and aquaculture Marine conservation and biodiversity protection Ocean-based renewable energy solutions Circular economy solutions for marine environments Sustainable coastal tourism initiatives Ocean technology and digital innovation Innovators are encouraged to propose solutions that combine technology, entrepreneurship, and sustainability. Collaboration in the Lab of Tomorrow A core feature of the Lab of Tomorrow is its collaborative approach to innovation. Participants will work in multidisciplinary teams that bring together entrepreneurs, researchers, corporate experts, and policymakers. This collaborative environment allows participants to: Combine local expertise with international industry knowledge Develop innovative solutions to complex ocean challenges Explore new business models for Blue Economy ventures Build partnerships that can accelerate implementation and growth By fostering collaboration between African innovators and German industry leaders, the Lab of Tomorrow strengthens international cooperation for sustainable development. Who Should Apply to the Lab of Tomorrow The Lab of Tomorrow is designed for innovators and entrepreneurs who are ready to develop practical solutions within the Blue Economy sector. Ideal applicants include: Entrepreneurs working on ocean-related innovations Startups focused on marine sustainability solutions Researchers and scientists developing ocean technologies Environmental innovators working on climate and ocean resilience Community leaders and social entrepreneurs involved in coastal development ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Applicants should demonstrate a strong commitment to developing solutions that create environmental and economic impact. Duration and Location The Lab of Tomorrow 2026 will take place as part of Ocean Innovation Africa 2026 in Durban, South Africa. Program details include: Dates: 23 25 March 2026 Location: Durban, South Africa Format: In-person innovation program ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); During the program, participants will work together to develop venture concepts and explore potential partnerships that can support long-term growth. How to Apply for the Lab of Tomorrow Applicants interested in joining the Lab of Tomorrow must submit their application through the official application platform. The application process typically involves: Completing the online application form Providing information about the innovation or venture concept Demonstrating how the solution contributes to Blue Economy development Submitting the application before the program deadline ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Applicants should clearly explain the impact and scalability of their proposed solutions. APPLY HERE Deadline Applicants are encouraged to apply as soon as possible to secure a place in the Lab of Tomorrow 2026 cohort. Participation in the program is competitive and spaces are limited. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Final Note The Lab of Tomorrow offers an exceptional opportunity for innovators who are passionate about ocean sustainability and entrepreneurship. By connecting African innovators with German industry partners, the program helps transform ideas into scalable ventures that can drive real change within the Blue Economy. If you are ready to build impactful solutions for ocean sustainability, the Lab of Tomorrow 2026 could be the perfect platform to accelerate your innovation journey. For more global fellowships, competitions, grants, and entrepreneurship opportunities, click here . ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); The post Lab of Tomorrow 2026 Blue Economy Innovation Program in Durban appeared first on Opportunities for Youth .","tags":["education","Africa","Competition"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T13:17:04Z","updated_at":"2026-02-25T13:17:04Z"}
{"id":"28135177dacd9bf57da606165c5be0ef70a39014","title":"InteRussia Fellowship 2026 for African Journalists in Moscow","url":"https://opportunitiesforyouth.org/2026/02/25/interussia-fellowship/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T10:36:29Z","summary":"The InteRussia Fellowship 2026 is now open for applications from journalists across Sub-Saharan Africa who are interested in expanding their professional experience in international media. The fellowship offers a unique opportunity for journalists to engage with Russia s media environment, develop professional skills, and collaborate with global media professionals. The InteRussia Fellowship will take place from July 6 to August 1, 2026 in Moscow, Russia, and the application deadline is May 19, 2026. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the InteRussia Fellowship The InteRussia Fellowship is an international journalism program designed to strengthen professional cooperation and knowledge exchange among journalists from different regions of the world. Hosted by the Sputnik International News Agency and Radio under the SputnikPro program, the fellowship provides hands-on training and exposure to modern media practices. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Through the InteRussia Fellowship, selected participants will have the opportunity to learn from experienced journalists, editors, and media experts working within one of Russia s major international media organizations. The program focuses on practical journalism training, discussions on global media trends, and professional networking opportunities. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Participants in the InteRussia Fellowship will also engage in a variety of professional activities, including seminars, workshops, and meetings with prominent media professionals and policy experts. These sessions aim to broaden participants understanding of global media systems and provide insights into contemporary journalism challenges. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); By bringing together journalists from different countries, the InteRussia Fellowship encourages collaboration, cultural exchange, and professional dialogue within the international journalism community. Benefits of the InteRussia Fellowship The InteRussia Fellowship provides several benefits designed to support participants throughout the program and enhance their professional development. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Key benefits include: Round-trip travel from the participant s place of residence to Moscow Accommodation in hotel double rooms during the fellowship period A scholarship of 30,000 rubles for the duration of the program Opportunities to network with international journalists and media experts Participation in workshops, seminars, and practical journalism training Visits to major educational, research, and public platforms in Moscow Through these opportunities, the InteRussia Fellowship helps journalists strengthen their reporting skills, expand their professional networks, and gain insights into global media dynamics. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Activities During the InteRussia Fellowship Participants selected for the InteRussia Fellowship will take part in a structured professional program designed to enhance their understanding of modern journalism and media practices. Key activities include: Journalism Workshops and Training The InteRussia Fellowship includes practical workshops covering different aspects of journalism such as digital reporting, multimedia storytelling, and international media cooperation. Expert Meetings and Discussions Participants will meet leading Russian journalists, media professionals, and experts who will share their insights into global media trends and journalism practices. Visits to Media and Research Institutions The program will include visits to prominent educational, research, and media institutions where participants will learn about media operations and innovation in journalism. Networking with International Journalists One of the main goals of the InteRussia Fellowship is to foster international collaboration among journalists. Participants will have opportunities to connect with peers from different countries and exchange professional experiences. Eligibility for the InteRussia Fellowship The InteRussia Fellowship is specifically designed for professional journalists from Sub-Saharan Africa who are actively engaged in media work. Applicants must meet the following requirements: Citizenship of a Sub-Saharan African country Residence outside the Russian Federation Age between 25 and 40 years Professional experience in print, digital, or audio journalism English proficiency of at least B2 level No academic or employment affiliation with Russian educational institutions or organizations These requirements ensure that participants have the professional background necessary to benefit from the program and contribute meaningfully to discussions and training activities. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Duration and Location The InteRussia Fellowship will run for four weeks and will be hosted in Moscow, Russia. Program details: Program Dates: July 6 August 1, 2026 Location: Moscow, Russia Working Language: English During this period, participants will take part in intensive journalism activities, workshops, and networking events. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); How to Apply for the InteRussia Fellowship Applicants interested in joining the InteRussia Fellowship must complete an online application through the official Gorchakov Fund platform. Application steps include: Register on the English version of the Gorchakov Fund website. Go to the My Projects section and click Create Application. Select the competition titled InteRussia Journalism Africa 2026. Complete all required sections of the application form. Attach a link to your professional portfolio. Submit the application and ensure the status changes to Submitted. Applicants should carefully review all instructions before submitting their application to ensure eligibility. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); APPLY HERE Fellowship Expenses The organizers of the InteRussia Fellowship will cover several costs associated with participation in the program. Covered expenses include: Round-trip travel to Moscow Accommodation during the fellowship Scholarship allowance for the duration of the program However, participants will be responsible for covering the following expenses: ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Medical insurance Visa application fees Meals during the fellowship period Applicants should take these requirements into consideration before applying. Deadline Application Deadline: May 19, 2026 (23:59 Moscow Time) Applicants are encouraged to submit their applications well before the deadline to avoid technical issues or delays. Final Note The InteRussia Fellowship is an excellent opportunity for journalists from Sub-Saharan Africa to gain international media experience, develop professional journalism skills, and expand their global networks. By participating in this fellowship, journalists can deepen their understanding of international media dynamics and strengthen their ability to report on global issues. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); For more fellowships, scholarships, internships, and global opportunities, click here . The post InteRussia Fellowship 2026 for African Journalists in Moscow appeared first on Opportunities for Youth .","tags":["education","Africa","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T13:17:04Z","updated_at":"2026-02-25T13:17:04Z"}
{"id":"c252a1deba2825a8bba7a0388e4c72d708d4d281","title":"West Africa Civil Society Institute (WACSI) Research Fellowship 2026: Fully Funded Six-Month Civil Society & Biodiversity Research Programme for Young West African Scholars","url":"https://opportunitiesforyouth.org/2026/02/25/wacsi-research-fellowship-in-indigenous-studies-apply-now/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T10:20:08Z","summary":"The West Africa Civil Society Institute (WACSI) has officially opened applications for the WACSI Research Fellowship 2026, a six-month fully supported research programme running from May to October 2026. This fellowship is designed to strengthen the research, analytical, and documentation capacities of emerging scholars while contributing to the advancement of civil society across West Africa. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Application Deadline: 13 March 2026 Fellowship Duration: May October 2026 (6 months) ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The programme provides young researchers with the opportunity to work closely with experienced professionals, develop high-quality publishable research, and contribute meaningfully to civil society discourse in the region. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); About WACSI The West Africa Civil Society Institute (WACSI) was established to reinforce institutional, operational, and knowledge capacities of civil society organisations (CSOs) in West Africa. The Institute serves as a regional resource hub for training, research, documentation, policy dialogue, and experience sharing. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Through its research fellowship, WACSI identifies and nurtures young researchers, equipping them with skills that strengthen both academia and civil society ecosystems. Fellowship Focus for 2026 The 2026 fellowship prioritises the documentation of indigenous knowledge within the biodiversity and conservation sector. Fellows will examine how civil society organisations can incorporate traditional knowledge systems to enhance environmental advocacy and climate action. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Indigenous knowledge refers to traditional systems of practices, beliefs, innovations, and experiences developed and transmitted across generations within communities. In the biodiversity and conservation space, such knowledge can provide valuable insight into sustainable environmental management and climate resilience. Fellows will explore intersections between academia and CSOs working in biodiversity and conservation while documenting replicable best practices. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Research Areas of Interest Applicants are encouraged to submit proposals related to biodiversity and conservation, including but not limited to: Leadership and governance in civil society organisations Technology for development Resource mobilisation strategies Civil society sustainability Working practices and internal systems Human resource management Enabling environments for civil society Community engagement strategies Equitable partnerships between West African CSOs and international donors Capacity strengthening for civil society Applicants must demonstrate a strong connection between their topic and biodiversity and conservation. Eligibility Criteria The fellowship is open to young researchers from: Ghana Guinea Conakry Liberia Nigeria Senegal Applicants must: Demonstrate strong analytical and independent research skills Show clear relevance of their proposed topic to biodiversity and conservation Be fluent in English and/or French Be willing to commit to the full six-month fellowship Current staff of organisations participating in biodiversity capacity strengthening programmes are encouraged to apply. Independent researchers are also welcome. Fellowship Benefits Participants will receive: Monthly Stipend Research Allowance Mentorship Dedicated mentors will guide fellows throughout the programme. Publication Opportunities At least one publishable research report or policy paper Opportunity to produce an Issue Paper, Op-Ed, blog article, or WACSeries publication Publication on WACSI s globally recognised platform ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Professional Development Enhanced research and analytical skills Networking opportunities within the civil society ecosystem Exposure to regional and international audiences Access to Resources Free access to WACSI publications Fellowship Deliverables Selected fellows must: Contribute to ongoing or commissioned research by WACSI Produce at least one publishable article on best practices or case studies in biodiversity and conservation Develop at least one WACSeries publication ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Fellowship Timeline 23 February 2026: Applications Open 13 March 2026: Application Deadline 27 March 2026: Shortlisted Applicants Notified 02 April 2026: Interviews 09 April 2026: Final Selection Feedback 04 May 2026: Fellowship Begins Why Apply? The WACSI Research Fellowship offers a unique opportunity to: Strengthen research capabilities Contribute to biodiversity and climate advocacy Gain mentorship from experienced professionals Publish research on a respected regional platform Build a career within civil society and policy research This fellowship bridges academia and civil society, empowering young researchers to influence policy and practice in West Africa. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Application Requirements Applicants must submit: Motivation letter (including duration and theme of interest) Curriculum vitae One-page synopsis outlining proposed research theme and methodology Sample authored article or research paper Evidence of previous publications (if available) Applications must be submitted via email to: research@wacsi.org and recruitment@wacsi.org All applications must be received by 13 March 2026. Testimonials from Past Fellows Previous fellows highlight the programme s transformative impact on their research confidence, mentorship experience, and professional growth. Participants report improved qualitative research skills, policy writing experience, and valuable exposure to new thematic areas such as social impact investment. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Learn more about the WACSI Research Fellowship HERE . Click HERE to discover more global fellowship opportunities on OFY. The post West Africa Civil Society Institute (WACSI) Research Fellowship 2026: Fully Funded Six-Month Civil Society Biodiversity Research Programme for Young West African Scholars appeared first on Opportunities for Youth .","tags":["education","Africa","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T13:17:04Z","updated_at":"2026-02-25T13:17:04Z"}
{"id":"e6990c70cec447db131cc3d74865d6ed723f3c86","title":"Cassagnol Fellowship 2026 for Conservation Leaders Worldwide","url":"https://opportunitiesforyouth.org/2026/02/25/cassagnol-fellowship-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T10:05:57Z","summary":"The Cassagnol Fellowship 2026 is now open for applications from conservation researchers and academic professionals committed to advancing biodiversity conservation and sustainable development worldwide. The fellowship supports individuals working in higher education, conservation research, and outreach initiatives that strengthen global conservation leadership. The application deadline for the Cassagnol Fellowship is April 15, 2026, and eligible applicants are encouraged to submit their proposals before this date. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the Cassagnol Fellowship The Cassagnol Fellowship was established through the Russell E. Train Education for Nature Program (EFN) to strengthen global conservation capacity by supporting researchers and conservation leaders in their home institutions and communities. The fellowship reflects decades of EFN experience demonstrating that investing in individuals and institutions can create lasting conservation impact. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Conservation challenges continue to grow worldwide due to biodiversity loss, environmental degradation, and climate change. Addressing these complex issues requires well-trained conservation professionals capable of bridging scientific research, policy, and community engagement. The Cassagnol Fellowship was designed to help fill this gap by supporting conservation leaders who can train future generations and strengthen conservation institutions. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Through this fellowship, selected scholars will be able to pursue research, teaching, and outreach activities that contribute to sustainable development and biodiversity protection. By supporting researchers within their home countries and institutions, the Cassagnol Fellowship ensures that conservation solutions remain locally relevant while benefiting from global collaboration. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Benefits of the Cassagnol Fellowship The Cassagnol Fellowship offers several important benefits for conservation professionals seeking to advance their research and leadership capacity. Key benefits include: Financial support to conduct conservation research and outreach activities Opportunities to strengthen conservation leadership and training programs Support for developing new knowledge and conservation practices Collaboration with mentors and research institutions Networking opportunities within the global conservation community Opportunities to build institutional capacity for conservation programs ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); By providing resources and mentorship, the Cassagnol Fellowship helps conservation leaders develop innovative approaches to biodiversity protection while strengthening their professional impact. Focus Areas of the Cassagnol Fellowship Research proposals submitted for the Cassagnol Fellowship should engage diverse communities and address key conservation challenges. Applicants are encouraged to design projects that strengthen collaboration, knowledge sharing, and sustainable development outcomes. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Priority focus areas include: Developing Conservation Skills and Best Practices The Cassagnol Fellowship encourages projects that develop skills, tools, and standards for conservation professionals. This includes practical training activities, case studies, and initiatives that improve environmental management practices and sustainability outcomes. Stakeholder Engagement and Inclusive Conservation Projects should demonstrate meaningful engagement with diverse stakeholders, including local communities, indigenous peoples, and gender-focused initiatives. The Cassagnol Fellowship values inclusive approaches that integrate local knowledge with scientific expertise. Professional Networking and Collaboration Applicants are encouraged to propose initiatives that strengthen collaboration among conservation professionals, academic institutions, and regional organizations. Partnerships with environmental lawyers, journalists, planners, and other specialists are particularly encouraged. Strengthening Institutional Capacity The Cassagnol Fellowship supports initiatives that enhance institutional capacity to address conservation challenges and promote sustainable development. Projects should contribute to building knowledge and expertise within institutions and communities. Eligibility Criteria Applicants for the Cassagnol Fellowship must meet specific academic and professional requirements. Eligibility requirements include: Applicants must hold a PhD or Master s degree in a discipline related to conservation. Preference is given to applicants who completed their degrees within the past five years. Applicants must have an academic or research appointment that will remain active during the fellowship period. Applicants must identify a primary mentor to support their research activities. Applicants must also identify a second mentor at their home institution. Both mentors must submit letters of recommendation as part of the application process. Applicants must provide a letter of support from their institution confirming their appointment and support for the fellowship. Candidates who have completed academic requirements but have not yet received their formal degree may apply if they provide evidence of completion before the fellowship begins. Selection Criteria The Cassagnol Fellowship is awarded through a competitive selection process. Applications will be evaluated based on several key criteria. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); These include: Academic achievement and research experience Strength and originality of the proposed project Potential impact of the research and outreach activities Demonstrated leadership and commitment to conservation Feasibility of the proposed work plan and budget Strength of partnerships and collaborations Quality of recommendation letters and mentorship support The selection committee will prioritize projects that demonstrate measurable conservation impact and strong collaboration with institutions and communities. Duration and Fellowship Timeline The Cassagnol Fellowship follows a structured timeline for application review and fellowship implementation. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Important dates include: April 15, 2026 Application Deadline April June 2026 Application review and selection process July 2026 Successful applicants notified August September 2026 Fellowship contracts issued and funding distributed Applicants should carefully prepare their proposals and submit them before the deadline to ensure consideration. How to Apply Applications for the Cassagnol Fellowship must be submitted through the official application portal. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Applicants should ensure that all required materials are submitted before the deadline, including: Completed fellowship application form Research proposal Letters of recommendation from mentors Letter of institutional support Applicants should carefully review the application guidelines before submitting their materials. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); APPLY HERE Deadline Application Deadline: April 15, 2026 Late applications may not be considered, so applicants are strongly encouraged to apply early. Final Note The Cassagnol Fellowship represents an important opportunity for conservation researchers and educators to advance their work while strengthening global conservation leadership. By supporting scholars and practitioners in their home institutions, the fellowship helps build long-term conservation capacity and sustainable development outcomes. For more fellowships, scholarships, internships, and global opportunities, click here . ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); The post Cassagnol Fellowship 2026 for Conservation Leaders Worldwide appeared first on Opportunities for Youth .","tags":["education","Fellowship","Africa","America","Asia","Australia and Oceania","Continent","Europe","Grants","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T13:17:04Z","updated_at":"2026-02-25T13:17:04Z"}
{"id":"b941e3934b316835f325f357f947fda226b7f3e8","title":"Copenhagen Fellowship 2026 in Denmark for Students and Graduates","url":"https://opportunitiesforyouth.org/2026/02/25/copenhagen-fellowship/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T09:32:04Z","summary":"The Copenhagen Fellowship 2026 is now accepting applications from students and recent graduates interested in democracy, human rights, and global policy discussions. The fellowship will take place June 16 July 2, 2026 in Copenhagen, Denmark, bringing together young leaders from across Europe to explore solutions to today s global challenges. The application deadline is March 1, 2026, so interested applicants are encouraged to prepare and submit their applications early. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the Copenhagen Fellowship The Copenhagen Fellowship is an in-person international program designed to empower emerging leaders to think critically about the future of democracy, governance, and human rights in an increasingly complex world. Hosted in Denmark, the program provides a collaborative space where participants can learn from experts, debate global issues, and develop practical ideas for positive change. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); In 2026, the fellowship theme focuses on Facing the World as It Is: Nordic Responses to Global Upheaval. Participants will explore how democratic values and human rights can be defended and strengthened in the face of climate change, geopolitical tensions, economic inequality, and democratic backsliding. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The program aims to bring together individuals who are passionate about global affairs and committed to shaping a more just and inclusive world. Through lectures, workshops, discussions, and collaborative projects, fellows will gain new insights and skills that will support their leadership journeys. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Benefits of the Copenhagen Fellowship Participants selected for the Copenhagen Fellowship will receive several benefits that support learning, networking, and leadership development. These benefits include: Participation in an international fellowship program in Copenhagen Engagement with leading experts in democracy, policy, and human rights Opportunities to collaborate with peers from different countries and disciplines Access to policy discussions, lectures, and interactive workshops Development of a personal Action Project focused on real-world impact Exposure to Nordic approaches to global governance and international cooperation Long-term connections within a network of emerging leaders ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); The fellowship experience is designed to encourage dialogue, collaboration, and innovation among participants who are motivated to address pressing global challenges. Fellowship Themes and Focus Areas The Copenhagen Fellowship will explore a range of themes related to democracy and global governance. Participants will examine issues from a Nordic perspective while considering the broader international context. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Key discussion areas include: Democracy and democratic resilience Human rights protection and advocacy Climate change and environmental governance Global inequality and social justice Geopolitical tensions and security challenges The Arctic region and global cooperation Transatlantic partnerships and international relations Through these discussions, fellows will gain a deeper understanding of how democratic institutions and societies can respond to complex global issues. Eligibility The Copenhagen Fellowship is open to motivated individuals who want to engage in discussions about democracy, governance, and human rights. Applicants must meet the following criteria: Be a student or recent graduate Be from or based in one of the following countries: Bosnia and Herzegovina Denmark Germany Poland Netherlands Demonstrate a strong interest in democracy, policy, or international affairs Be willing to actively participate in discussions and collaborative activities Commit to developing an Action Project that will be implemented in their community after the fellowship The fellowship welcomes applicants from diverse academic and professional backgrounds who are eager to contribute their ideas and perspectives. Duration and Location The Copenhagen Fellowship 2026 will take place June 16 July 2, 2026 in Copenhagen, Denmark. This in-person experience will allow fellows to interact directly with experts, policymakers, and fellow participants while experiencing Denmark s academic and policy environment. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); The program combines lectures, collaborative discussions, workshops, and networking activities throughout the fellowship period. Action Project A key component of the Copenhagen Fellowship is the development of an Action Project. During the program, fellows will design a project that addresses a real issue related to democracy, human rights, or social change. After the fellowship ends, participants will implement this project within their communities. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); The Action Project encourages participants to transform ideas and knowledge into practical initiatives that create positive social impact. How to Apply Interested applicants should submit their applications through the official fellowship application portal. Applicants should carefully review the application requirements and ensure that all requested documents are included before submission. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Applicants can learn more and apply through the official application link. APPLY HERE Deadline Application Deadline: March 1, 2026 Applications submitted after this date may not be considered, so candidates are encouraged to apply early. Final Note The Copenhagen Fellowship is an excellent opportunity for students and young professionals who want to deepen their understanding of democracy, human rights, and international cooperation. By participating in this program, fellows will gain valuable knowledge, build global networks, and develop practical ideas to strengthen democratic values in their communities. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); For more global fellowships, scholarships, internships, and funding opportunities, click here . The post Copenhagen Fellowship 2026 in Denmark for Students and Graduates appeared first on Opportunities for Youth .","tags":["education","Europe","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T13:17:04Z","updated_at":"2026-02-25T13:17:04Z"}
{"id":"a11e83b3cea1352a4daae811556f535a52ee280a","title":"OHCHR Humanitarian Funds Fellowship Programme 20262027 (Fully Funded)  Apply for UN Human Rights Experience in Geneva","url":"https://opportunitiesforyouth.org/2026/02/25/ohchr-humanitarian-funds-fellowship-programme-2026-2027-fully-funded-apply-for-un-human-rights-experience-in-geneva/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T07:39:48Z","summary":"The Fellowship Programme of the OHCHR Humanitarian Funds offers young professionals working in human rights a valuable opportunity to gain practical experience within the United Nations system while supporting global efforts to assist survivors of torture and contemporary forms of slavery. Based at the United Nations Human Rights Office (OHCHR) in Geneva, Switzerland, this fully funded fellowship provides hands-on exposure to human rights programming, research, grant evaluation, and policy processes. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the OHCHR Humanitarian Funds Fellowship Programme The United Nations Human Rights Office manages two humanitarian funds: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); United Nations Voluntary Trust Fund on Contemporary Forms of Slavery ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); United Nations Voluntary Fund for Victims of Torture ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); These funds channel voluntary contributions toward direct assistance for survivors through grants to civil society organizations worldwide. The fellowship programme aims to: Provide young professionals with working-level exposure to the UN human rights system ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Strengthen knowledge and skills in addressing slavery and torture-related issues Build practical experience in grant evaluation and management Support survivor-centered human rights programming ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Call for Applications (2026 Intake) Applications are open from 20 February to 15 April 2026 for two fellowship positions within the Humanitarian Funds Secretariat at the United Nations Human Rights Office in Geneva. Fellowship timelines: 01 August 2026 to 31 July 2027 01 January 2027 to 31 December 2027 Additional details: Two-month probationary period applies Possible extension of up to one additional year, subject to funding availability Key Responsibilities of Fellows Selected fellows will contribute to the work of the Humanitarian Funds through activities such as: Evaluating and analysing project applications Liaising with applicant organizations and providing technical support Conducting research and analysis on contemporary forms of slavery and torture Reviewing and compiling best practices and lessons learned from grantees Supporting outreach and visibility activities (website updates, brochures, social media content, impact stories) ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Assisting in organizing annual sessions of the Boards of Trustees, including policy discussions and public events Contributing to other OHCHR activities as required Fellowship Benefits Selected candidates will receive: Monthly stipend covering basic living expenses in Geneva Return airfare to and from country of residence Basic health insurance coverage ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Eligibility Requirements Experience Applicants must have: At least two years of experience in human rights issues related to contemporary forms of slavery and/or torture Desirable experience: Supporting survivors of slavery and/or torture Project management ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Languages Required: Working-level spoken and written English Desirable: Fluency in French or Spanish Knowledge of another UN language (Arabic, Chinese, or Russian) Additional Criteria Knowledge of the United Nations system is an advantage Survivors supporting other survivors are strongly encouraged to apply Priority may be given to candidates with experience in organizations funded by the Humanitarian Funds Applicants must be available for the full fellowship duration ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); The United Nations is committed to diversity and inclusion and welcomes applications from all backgrounds. Reasonable accommodation may be provided during the application process when requested. Application Process Application deadline: 15 April 2026 Submission details: Send complete application by email to: ohchr-unvfvt@un.org Only successful applicants will be contacted Shortlisted candidates may be invited for a written exam and interview ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Required documents: Fully completed and signed application form. Application form fully completed and signed Curriculum Vitae (maximum two pages) The Terms of Reference cover two fellowship positions, applicants should confirm their availability to one or both of the start-end dates in the application form. ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Why You Should Apply This fellowship offers a strong career opportunity for human rights professionals seeking UN experience. Fellows will: Gain direct exposure to the UN human rights system Build expertise in grant evaluation and humanitarian funding mechanisms Strengthen research, policy, and programme management skills Work on initiatives that directly support survivors of serious human rights violations Expand international professional networks ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); Related Human Rights Resources Applicants may also explore: United Nations Voluntary Fund for Victims of Torture United Nations Voluntary Trust Fund on Contemporary Forms of Slavery OHCHR work on trafficking in persons Special Rapporteur on contemporary forms of slavery Special Rapporteur on the sale and sexual exploitation of children ezstandalone.cmd.push(function () { ezstandalone.showAds(139); }); Final Application Tip Strong applications typically: Demonstrate practical experience supporting survivors Show clear understanding of human rights challenges Present concrete examples of impact Explain how the fellowship aligns with long-term professional goals Tailored, evidence-based applications are generally more competitive than generic submissions. Application and selection process Interested candidates should send their complete application by e-mail to ohchr-unvfvt@un.org not later than 15 April 2026 (only successful applicants will receive a reply). Shortlisted candidates may be contacted for a written exam and an interview following application. The Terms of Reference cover two fellowship positions, applicants should confirm their availability to one or both of the start-end dates in the application form. ezstandalone.cmd.push(function () { ezstandalone.showAds(140); }); Required documentation: Application form fully completed and signed Curriculum Vitae (max 2 pages) Source: https://www.ohchr.org/en/about-us/fellowship-programmes/humanitarian-funds-fellowship The post OHCHR Humanitarian Funds Fellowship Programme 20262027 (Fully Funded)  Apply for UN Human Rights Experience in Geneva appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Fellowship","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T13:17:04Z","updated_at":"2026-02-25T13:17:04Z"}
{"id":"e8f6369dd8998beeca8742b0d778ea3fef0cf434","title":"Paid NATO SHAPE Internship Programme 2027: Fully Detailed Guide for Students and Recent Graduates","url":"https://opportunitiesforyouth.org/2026/02/25/the-nato-internship-programme-is-now-open-for-applicationsfully-funded/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-25T01:41:56Z","summary":"The NATO SHAPE Internship Programme 2027 is now open offering a paid international internship opportunity for students and recent graduates who want to gain professional experience inside one of the world s leading international organizations. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Based at the Supreme Headquarters Allied Powers Europe (SHAPE) in Mons, Belgium, the programme provides hands-on exposure to international cooperation, policy, communications, technology, and operational support while receiving a monthly stipend. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Application deadline: 28 February 2026 Applications submitted after the deadline will not be considered. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); What Is the NATO SHAPE Internship Programme? The SHAPE Internship Programme (SIP) is designed to give young professionals practical work experience within NATO while supporting the organization with fresh academic knowledge and technical skills. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Each year, approximately 35 interns are selected from NATO member countries to work across different divisions and offices. The programme aims to: Provide real-world experience in an international environment Strengthen understanding of NATO and its operations Promote diversity across member nations Support SHAPE divisions with additional expertise ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Interns gain valuable professional experience while building strong international career credentials. Internship Location and Duration Location: SHAPE Headquarters, Mons, Belgium Duration: 6 months Start Dates: January or September (following year) Application Cycle: One annual call for applications ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Applicants must specify their preferred start month during the application process. Areas of Interest and Academic Backgrounds SHAPE accepts candidates from a broad range of disciplines, including: Policy and International Affairs International Relations Political Science Defence and Security Studies Law Business and Administration Economics and Finance Accounting and Auditing Human Resources Logistics Technology and Engineering Information Technology Cybersecurity Engineering Electronics Aeronautics Communications and Media Media and Journalism Strategic Communications Digital Media Web and Graphic Design Public Relations Additional Specializations Intelligence and Security Library Sciences Languages (Russian, Ukrainian, Arabic) Featured Opportunity: Strategic Communications Internship For the 2027 cycle, SHAPE is particularly seeking candidates who can support strategic communications and employer branding activities. Responsibilities may include: Supporting digital outreach and social media activities Contributing to employer branding initiatives Assisting with podcast development and multimedia projects Expanding presence on emerging social platforms Supporting communication campaigns ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); This area is well suited to candidates in communications, marketing, digital media, human resources, or related fields. Eligibility Criteria To qualify for the NATO SHAPE Internship Programme, applicants must: Be citizens of a NATO member nation Be at least 21 years old at the time of application ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Demonstrate strong English proficiency (primary working language) Have completed a first university degree Be current MA/MSc or PhD students, or recent graduates (within the last 18 months) Normally, candidates should not be over 35 years old unless engaged in a PhD programme relevant to SHAPE. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Only applications meeting all eligibility criteria will be considered. Is the NATO SHAPE Internship Paid? Yes. The internship includes financial support. Internship benefits include: Monthly lump sum: 1,286.09 Travel reimbursement for arrival and departure (according to regulations) Professional experience in a multinational international environment Interns are responsible for: Arranging their accommodation Securing health and accident insurance Completing administrative formalities required by Belgian authorities Typical Responsibilities of Interns Depending on the assigned division, interns may: Draft and prepare official documents Conduct research and analysis Attend and summarize meetings and conferences Support media analysis and public relations activities Assist technical or administrative teams Contribute to communication and digital projects ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Application Process Applications must be submitted electronically through the official application form. Required Documents Applicants must upload one combined file (PDF or Word) containing: Curriculum Vitae (CV) One-page motivation essay explaining interest in SHAPE and expectations from the internship ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); File naming example: JohnBrown.pdf Incomplete or incorrectly submitted applications will be automatically rejected. If you identify an error after submission, you may resubmit your application. The latest version will be considered. Selection Process The selection process includes: Initial screening by SHAPE Civilian Human Resources Management Branch Review by relevant divisions and offices Selection based on skills and organizational needs Final decisions typically made between May and June ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Only selected candidates will be notified. Security Clearance Requirement Depending on the assigned role, selected interns may need security clearance from their national authorities. Processing times vary and may take several weeks to several months. Key Deadline Application Deadline: 28 February 2026 Applications received after this date will not be considered for the 2027 internship cycle. Contact Information For further information: SHAPE Internship Programme Coordinator Supreme Headquarters Allied Powers Europe (SHAPE) Email: SHAPEinternship@shape.nato.int ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); Why Apply for the NATO SHAPE Internship? The SHAPE Internship Programme provides paid international experience in a highly respected global institution. Interns gain practical skills, professional exposure, and insight into multinational cooperation, making it an excellent opportunity for those interested in careers in international organizations, communications, policy, technology, or global affairs. While internships are not directly linked to recruitment, the experience significantly strengthens future career prospects. Application Process Applications must be submitted electronically through the official application form. ezstandalone.cmd.push(function () { ezstandalone.showAds(139); }); FOR MORE DETAILS The post Paid NATO SHAPE Internship Programme 2027: Fully Detailed Guide for Students and Recent Graduates appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Continent","Europe","Internships","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-25T13:17:04Z","updated_at":"2026-02-25T13:17:04Z"}
