{"id":"e87542d329df08133b2b49177856c3b50895fad6","title":"Common Good Cyber Fund Grant Program: Strengthening Global Cybersecurity for Civil Society","url":"https://opportunitiesforyouth.org/2026/02/27/common-good-cyber-fund-grant-program-strengthening-global-cybersecurity-for-civil-society/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T12:47:53Z","summary":"As cyberattacks grow in frequency and sophistication, civil society organizations, journalists, human rights defenders, and vulnerable communities are increasingly at risk. The Common Good Cyber Fund (CGCF) has been established to address this challenge by strengthening essential cybersecurity infrastructure and supporting high-risk actors. The Fund was launched by the Internet Society in collaboration with the Common Good Cyber Ecosystem Committee and a Strategic Advisory Committee. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); What the CGCF Supports The Common Good Cyber Fund provides grants to nonprofit organizations that: Deliver critical services underpinning the Internet s core infrastructure Provide cybersecurity protection to high-risk civil society actors Strengthen digital security ecosystems globally Address gaps caused by chronic underfunding of essential cybersecurity capabilities The program focuses on systemic impact supporting infrastructure and services that protect broader communities, not just individual organizations. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Who the Fund Aims to Protect The initiative prioritizes efforts that support: Civil society organizations Journalists Human rights defenders Dissidents Vulnerable and at-risk communities The goal is to reinforce digital resilience and ensure that those working in the public interest can operate safely online. Funding Structure CGCF is supported by a mix of: Government donors Philanthropic partners The Internet Society This collaborative funding model enables sustainable investment in cybersecurity as a public good. Key Dates Open Call Launch: June 2026 (Exact deadlines will be announced during the call.) Organizations are encouraged to review eligibility criteria early and prepare required documentation in advance. Following a successful pilot cycle in 2025, the next open call for applications will launch in June 2026 . ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Learn more and prepare for the open call . The post Common Good Cyber Fund Grant Program: Strengthening Global Cybersecurity for Civil Society appeared first on Opportunities for Youth .","tags":["education","Continent"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T13:09:30Z","updated_at":"2026-02-27T13:09:30Z"}
{"id":"31061e3a8ca836e1334f2e924731d60f3883aa9a","title":"Youth Co:Lab National Innovation Challenge 2026 (India): Seed Grants up to INR 3.5 Lakhs for Youth-Led Startups Driving Responsible Consumption","url":"https://opportunitiesforyouth.org/2026/02/27/youth-colab-national-innovation-challenge-by-undp-india-and-atal-innovation-mission-for-indian-startups/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T12:05:24Z","summary":"The Youth Co:Lab National Innovation Challenge 2026 in India is now open for applications. Organized by UNDP in collaboration with Atal Innovation Mission (AIM), NITI Aayog, and implemented with T-Hub Foundation, this flagship youth entrepreneurship challenge focuses on Responsible Consumption aligned with the Government of India s Mission LiFE (Lifestyle for Environment). Under the 8th edition of the Youth Co:Lab National Innovation Challenge, young innovators and entrepreneurs across India are invited to present scalable solutions in Sustainable Textiles and Fashion, Circular Economy Innovations, and Sustainable Food Systems and Water Conservation. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Application Deadline: Before midnight on 3rd March 2026. This national-level innovation challenge provides mentorship, ecosystem exposure, incubation, and seed grants of INR 2.2 3.5 lakhs for top startups. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); About Youth Co:Lab Youth Co:Lab was co-created in 2017 by the United Nations Development Programme (UNDP) and Citi Foundation to empower young people across the Asia-Pacific region to accelerate the Sustainable Development Goals (SDGs) through leadership, social innovation, and entrepreneurship. Launched in India in 2019 in collaboration with Atal Innovation Mission (AIM), Youth Co:Lab has conducted seven national innovation challenges to date. These initiatives include: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); National dialogues Workshops and panel discussions Capacity-building sessions Seed funding opportunities Mentor and investor matchmaking Youth Co:Lab provides young founders with tools to transform early-stage ideas into viable ventures that create measurable environmental and social impact. 2026 Focus Theme: Responsible Consumption The 2026 National Innovation Challenge centers on Responsible Consumption in alignment with Mission LiFE. The challenge encourages innovations that nudge individual and collective behavioral shifts toward sustainable lifestyles. The sub-themes include: 1. Sustainable Textiles and Fashion Innovations that reduce environmental and social impacts in fashion and textile industries, including: Low-impact fibres and eco-friendly dyeing processes Circular garment design and repair models Transparent and ethical supply chains Textile waste reduction solutions 2. Circular Economy Innovations Solutions that extend material use cycles and reduce waste across sectors, such as: Electronic waste solutions Plastic alternatives Composting and zero-waste products Product-as-a-service models Remanufacturing systems Waste-to-value innovations 3. Sustainable Food Systems and Water Conservation Innovations that enhance sustainability and efficiency in agriculture and water systems, including: Water-saving technologies Resource-efficient production Post-harvest management improvements Watershed management Supply chain optimization Eligibility Criteria Applicants must meet the following conditions: Youth-led startups with founders aged 15 to 29 years Age extended to 35 years for: Women Persons with Disabilities (PwDs) LGBTIQA+ individuals Tribal entrepreneurs Entrepreneurs from minority communities NGOs meeting these criteria are also eligible The solution must align with Responsible Consumption sub-themes Youth Co:Lab strongly encourages participation from marginalized communities, including: Women-led teams LGBTIQA+ founders Persons with disabilities Tribal youth Dalit youth Religious minorities Programme Benefits 1. National Springboard Programme Up to 40 50 startups will participate in a structured virtual capacity-building journey that includes: Expert-led workshops Mentor connect sessions Peer learning Business fundamentals training Design thinking modules ESG readiness and impact measurement Fundraising and pitching preparation 2. National Innovation Dialogue (NID) The Springboard Programme culminates in a national convening where startups pitch to: Investors Policymakers Ecosystem leaders Subject matter experts 3. Regional Immersion Programme at T-Hub The Top 20 startups will attend a 5-day in-person immersion bootcamp in Hyderabad at T-Hub, the world s largest startup incubator. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Focus areas include: Business model refinement Investor readiness Impact alignment Scaling strategies Market access 4. Seed Grants The Top 6 startups will receive seed support ranging from INR 2.2 to 3.5 lakhs to accelerate solution development and scaling. 5. Ecosystem Exposure and National Recognition Selected startups gain: National visibility Access to T-Hub s innovation ecosystem Continued mentorship opportunities Networking with corporates and investors Programme Timeline Application Deadline: 3rd March 2026 (Before Midnight) Springboard Programme: 6 8 Weeks Virtual National Innovation Dialogue: Post Springboard Regional Immersion: 5 Days at T-Hub Finale Seed Grant Awards: Post Immersion Frequently Asked Questions (FAQs) What is Youth Co:Lab? Youth Co:Lab is a UNDP and Citi Foundation initiative, implemented in India with AIM and T-Hub, empowering youth to accelerate the SDGs through entrepreneurship and innovation. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); How do I apply? Applications must be submitted through the official Youth Co:Lab application portal before midnight on 3rd March 2026. Is my information confidential? Yes. All information submitted is treated as confidential and will not be shared without consent. Can unregistered startups apply? Yes. However, selected startups may need to complete formal registration to participate fully. Is there a template for the pitch deck? No. Applicants may use their existing pitch decks. How will applications be evaluated? Evaluation criteria include: Problem statement clarity Unique Selling Proposition (USP) Alignment with Responsible Consumption Mission LiFE Scalability potential Environmental and social impact Business model viability What is the National Springboard Programme? It is a structured virtual incubation programme offering mentorship, capacity building, and investor preparation. Is participation free? Yes. There is no participation fee. Is there any equity stake required? No. Youth Co:Lab does not take equity and is not affiliated with any investment agreements. Who can I contact for queries? For inquiries, email: czarina.arora@t-hub.co APPLY HERE Visit HERE for more information about the Youth Co:Lab National Innovation Challenge 2026. To discover more global opportunities, visit OFY HERE . The post Youth Co:Lab National Innovation Challenge 2026 (India): Seed Grants up to INR 3.5 Lakhs for Youth-Led Startups Driving Responsible Consumption appeared first on Opportunities for Youth .","tags":["education","Asia","Competition","Grants"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T13:09:30Z","updated_at":"2026-02-27T13:09:30Z"}
{"id":"c48d057bf9ba00e857e4281e5c0f98e46fd2f120","title":"Ed Bradley Journalism Fellowship 2026 at NYU: Fully Funded Summer Workshop for U.S. College Journalists (June 8–14, 2026)","url":"https://opportunitiesforyouth.org/2026/02/27/ed-bradley-journalism-fellowship-2026-intensive-summer-workshop-at-nyu/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T11:00:30Z","summary":"The Ed Bradley Journalism Fellowship 2026 at New York University s Arthur L. Carter Journalism Institute is now accepting applications for its prestigious summer workshop taking place from June 8 14, 2026 in New York City. Organized in partnership with the Dow Jones News Fund, this fully funded, one-week intensive journalism training program brings together 20 outstanding U.S. college students for immersive mentorship, newsroom exposure, and hands-on multimedia reporting experience. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The deadline to apply is March 15, 2026. This fellowship is designed to address one of the most pressing equity gaps in American journalism: the under-representation of African-American males in newsrooms across the country. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); About the Ed Bradley Journalism Fellowship Named in honor of legendary journalist Ed Bradley, the fellowship aims to: Identify and address the under-representation of Black men in journalism Strengthen pathways into newsrooms Build equitable representation in media Cultivate diverse allies committed to newsroom equity While the program s mission centers on increasing representation of Black males in journalism, the fellowship welcomes all U.S. college students who appreciate and support this mission, regardless of identity or background. The program emphasizes the importance of diverse allies in effecting meaningful and lasting structural change in media institutions. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Program Dates and Location Fellowship Dates: June 8 14, 2026 Location: New York University Arthur L. Carter Journalism Institute New York City, NY Participants will live in NYU dorms in Manhattan s East Village during the workshop. What Makes This Fellowship Unique? The Ed Bradley Fellowship is not just a workshop it is a gateway into the professional journalism ecosystem. Participants will: Receive intensive training from NYU faculty and visiting professionals Visit prestigious New York newsrooms Engage directly with top journalists and newsroom executives Produce original multimedia reporting Join the Dow Jones News Fund professional network In previous cohorts, students met professionals from: The New York Times CNN Dow Jones The Wall Street Journal ESPN Slate CBS New York ProPublica MSNBC NBC News Why Apply to the Ed Bradley Journalism Fellowship? This fellowship is ideal for students who: Aspire to work in journalism or media Want hands-on newsroom exposure Seek mentorship from leading journalists Care about representation and equity in media Want fully funded access to professional journalism training It provides early-career acceleration and a powerful professional network. Fully Funded Program Benefits The Ed Bradley Journalism Fellowship 2026 is fully funded for all selected participants. Covered Costs Include: Program instruction Housing at NYU Meals Transportation costs to attend the workshop This ensures economic diversity and equal access to opportunity. There are no program fees for admitted students. What Fellows Will Experience 1. Intensive Journalism Training Participants will receive hands-on instruction in: Reporting News writing Multimedia journalism Story pitching Interviewing techniques Editorial development Students will become Backpack Reporters, developing and producing their own stories. 2. Multimedia Publishing Participants will: Produce original multimedia stories Publish their work on the program s website and social media channels Receive professional editorial feedback 3. Industry Networking Students will: Visit leading newsrooms in New York City Build relationships with top journalists Gain mentorship from industry leaders Expand their professional network through the Dow Jones News Fund 4. Immersive Campus Life Experience Participants will: Live in NYU dormitories Experience New York City journalism culture Engage in collaborative learning with a competitive national cohort Eligibility Criteria To apply, candidates must: Be U.S. college students Have completed their freshman year by Summer 2025 Support the mission of increasing representation of Black males in journalism Demonstrate interest in journalism and media The fellowship welcomes applicants from all backgrounds who align with the mission. Application Timeline Application Deadline: March 15, 2026 Decision Notifications: Early April 2026 Fellowship Dates: June 8 14, 2026 APPLY HERE Selection Process Twenty students will be selected from a highly competitive national applicant pool. Selection is based on: Demonstrated interest in journalism Alignment with the fellowship s mission Academic progress Potential for impact in journalism Board of Advisors The fellowship is guided by respected leaders in journalism, including: Topher Sanders Investigative Reporter, ProPublica Marc Lacey Managing Editor, New York Times Robert Samuels National Enterprise Reporter, Washington Post Brent Jones SVP Training, Culture Community, Dow Jones Anzio Williams SVP Diversity, Equity and Inclusion, NBCUniversal Local Eric Deggans TV Critic, NPR Skyler Henry Correspondent, CBS News Chenjerai Kumanyika Professor, NYU Journalism Pierre Thomas Chief Justice Correspondent, ABC News Learn more about the Ed Bradley Journalism Fellowship 2026 HERE . Click HERE to discover more global fellowship opportunities. The post Ed Bradley Journalism Fellowship 2026 at NYU: Fully Funded Summer Workshop for U.S. College Journalists (June 8–14, 2026) appeared first on Opportunities for Youth .","tags":["education","America","Fellowship","Black male journalists","college journalism workshop","Dow Jones News Fund","Ed Bradley Fellowship","journalism mentorship","NYU Journalism 2026","summer journalism program"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T13:09:30Z","updated_at":"2026-02-27T13:09:30Z"}
{"id":"a0813d501eb8fe34be92327e61e1afc97ef0adca","title":"The Bseisu – University of Glasgow Scholarship 2026/27: Applications Now Open","url":"https://opportunitiesforyouth.org/2026/02/27/the-bseisu-university-of-glasgow-scholarship-2026-27-applications-now-open/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T06:43:22Z","summary":"The University of Glasgow has opened applications for The Bseisu University of Glasgow Scholarship for the 2026/27 academic year , offering a transformative opportunity for talented students from the Middle East to pursue world-class postgraduate education. Created in partnership with the Amjad Suha Bseisu Foundation , the scholarship aims to empower exceptional individuals from Lebanon, Jordan, Palestine, and Syria through access to cutting-edge STEM programmes. The Foundation s mission is rooted in supporting civil society, promoting equal opportunity, and expanding educational access for communities across the Middle East. Through this partnership, both institutions continue their shared vision of creating pathways for students whose academic potential deserves global recognition. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Applications for the scholarship close on 1 May 2026 , and applicants will be notified of outcomes by 25 June 2026 . ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); About The Bseisu University of Glasgow Scholarship The scholarship is exclusively available for Postgraduate Taught (PGT) Master s programmes within the University s College of Science and Engineering . With a wide range of eligible STEM degrees from Quantum Technology to Civil Engineering the scholarship supports students pursuing fields critical to technological innovation, scientific advancement, and sustainable global development. Importantly, this funding is not available for PgDip, PgCert, or online distance programmes. Only full-time, on-campus Master s applicants will be considered. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); To qualify, applicants must: Hold a firm conditional or unconditional offer for full-time study at the University of Glasgow for 2026/27 Be a national of Lebanon, Jordan, Palestine, or Syria Domicile can be in any country, as long as nationality meets the criteria. What the Scholarship Covers The Bseisu University of Glasgow Scholarship is one of the University s most generous awards. Each selected scholar receives: A full tuition fee waiver for the entire duration of their Master s programme 12,000 per year to support study-related costs Coverage for visa fees Coverage for the Immigration Health Surcharge (IHS) Return flight expenses With this comprehensive financial support, the scholarship eliminates major barriers that international students often face when pursuing advanced degrees abroad. For the 2026/27 intake , the University will award two scholarships . Eligible Programmes Applicants may apply to any eligible STEM programme within the College of Science and Engineering. The list spans more than 50 specializations, including: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Aerospace Engineering Advanced Functional Materials Computing Science Cybersecurity Robotics AI Medical Devices Engineering Geospatial Data Science AI Mechanical Engineering Nuclear Environmental Physics Human Computer Interaction Quantum Technology Sustainable Energy Statistics and Advanced Statistics Environmental, climate, and Earth sciences programmes This broad academic offering ensures that students interested in research, engineering, data science, environmental sustainability, and emerging technologies have strong options to choose from. How to Apply Applications must be submitted before the 1 May 2026 deadline . Only applicants who already hold an offer from the University will be considered, so prospective students are encouraged to apply to their chosen Master s programme as early as possible. Shortlisted applicants will be reviewed based on academic merit, clarity of purpose, and potential to contribute to their fields of study. Final scholarship decisions will be communicated by 25 June 2026 . ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); A Pathway to Global Opportunity The Bseisu University of Glasgow Scholarship represents not just financial support, but an investment in future leaders from the Middle East. By enabling students to engage with world-leading research and innovation, the scholarship helps bridge global educational gaps and empowers the next generation of scientists, engineers, and innovators. Students from Lebanon, Jordan, Palestine, and Syria who aspire to pursue a Master s degree in STEM are encouraged to apply before 1 May 2026 and take a significant step toward advancing their academic and professional futures. Application can be accessed from here . To know more about such opportunities, click here . The post The Bseisu – University of Glasgow Scholarship 2026/27: Applications Now Open appeared first on Opportunities for Youth .","tags":["education","Europe","Scholarships","Bseisu Scholarship","International Scholarships UK","Middle East Students","Postgraduate Funding","STEM Masters Programmes","Study in Scotland","University of Glasgow 2026"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T13:09:30Z","updated_at":"2026-02-27T13:09:30Z"}
{"id":"75f2ee1dad6b0bfa704db49f302c57e62e0c8ed8","title":"Call for Participation 2026: Sport for Peace and Safer Communities Learning Community","url":"https://opportunitiesforyouth.org/2026/02/27/call-for-participation-2026-sport-for-peace-and-safer-communities-learning-community/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T06:37:30Z","summary":"The Sport for Peace and Safer Communities Initiative has officially opened its 2026 Call for Participation , inviting organizations from Colombia, El Salvador, and Guatemala to join a structured Learning Community focused on Sport for Development (S4D). This initiative, implemented through a collaboration between the International Olympic Committee, the adidas Foundation, and GIZ, aims to strengthen social cohesion, prevent violence, and promote community peace through the power of sport. The deadline to submit applications is March 16, 2026, at 11:59 PM (Colombia time) . Building Peace Through Sport for Peace and Safer Communities Initiative The Learning Community (CoL) provides a platform for organizations to deepen their capacity to integrate Sport for Development and Peace approaches into their programs and organizational strategies. By connecting organizations with varying levels of experience in S4D, peacebuilding, and community development, the CoL promotes peer learning, technical accompaniment, and the exchange of knowledge. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Participants will receive structured guidance, capacity-building workshops, and opportunities to co-design pilot initiatives. These pilots aim to demonstrate how sport can be used to strengthen social bonds, reduce violence, and support transformation in communities affected by conflict. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); How the Learning Community Works The CoL is divided into two major phases : Phase 1: Call and Selection (February March 2026) Organizations with experience in S4D, peacebuilding, or violence prevention may apply. Key milestones include: February 23, 2026: Official launch of the call March 2, 2026: Virtual information session March 16, 2026: Final deadline for submissions April 6, 2026: Announcement of selected organizations A committee composed of representatives from the International Olympic Committee, the adidas Foundation, GIZ, and independent experts will evaluate applications based on technical, administrative, and financial criteria. Phase 2: Pairing, Design, and Implementation (April 2026 December 2027) Selected organizations will participate in matchmaking to form pairs. Together, they will design and implement pilot projects grounded in S4D. Major commitments include: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); April 27 30, 2026: Mandatory in-person workshop for pairing and project co-creation April 29 May 19, 2026: Joint proposal design May 20, 2026: Submission deadline for technical and financial proposals August/September 2026 September 2027: Pilot implementation Each pilot initiative may receive up to EUR 60,000 , depending on the quality and feasibility of the proposed concept. Who Can Apply? Eligible organizations include: Civil society organizations International NGOs Academic institutions Sports clubs Foundations Non-profit organizations Applicants must be legally registered in Colombia, El Salvador, or Guatemala and demonstrate the administrative and financial capacity to manage funds. Experience in S4D, peacebuilding, or community-level interventions will strengthen the application. What the Initiative Prioritizes Proposed initiatives should focus on one or more of the following themes: Social cohesion : strengthening trust, belonging, inclusion, and community participation Violence prevention : reducing risk factors for youth recruitment, substance abuse, or conflict Peacebuilding : promoting dialogue, community governance, reconciliation, and resilience Projects should demonstrate strong technical design, gender and inclusion considerations, community participation mechanisms, and a clear Monitoring, Evaluation, and Learning (MEAL) framework. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Expected Impact Through this Learning Community, organizations will gain: Increased capacity in S4D methodologies Stronger local and regional partnerships Evidence-based insights for scaling community sports programs Tools to support safer, more cohesive communities The initiative ultimately aims to transform sport into a vehicle for peace, resilience, and sustainable community development. Submit Your Application by March 16, 2026 Organizations interested in contributing to safer, more inclusive communities through sport are encouraged to apply before the March 16, 2026 deadline . Participation offers a rare opportunity to access technical guidance, build partnerships, and implement transformative pilot projects across Latin America. Application can be accessed from here . To know more about such opportunities, click here . The post Call for Participation 2026: Sport for Peace and Safer Communities Learning Community appeared first on Opportunities for Youth .","tags":["education","Latin America and the Caribbean","Community Cohesion","GIZ Call for Participation","Latin America Initiatives","Peacebuilding 2026","Sport for Development","Violence Prevention Programs","Youth and Sports Projects"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T13:09:30Z","updated_at":"2026-02-27T13:09:30Z"}
{"id":"fd7fc16b9da0f4738c54562df97d81ef12bb1cf0","title":"International Human Rights Law Summer School 2026 at Oxford: Fully Funded Scholarship Opportunities Available","url":"https://opportunitiesforyouth.org/2026/02/27/international-human-rights-law-summer-school-2026-at-oxford-fully-funded-scholarship-opportunities-available/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T05:23:27Z","summary":"The Bonavero Institute for Human Rights, in partnership with George Washington University Law School, is offering a prestigious 26-day residential Summer School in International Human Rights Law at the University of Oxford Faculty of Law. Taking place at New College, Oxford, this intensive academic programme provides participants with advanced university-level training in international human rights law within one of the world s most historic academic environments. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); With three scholarships worth 6,500 each available for 2026, this programme is an exceptional opportunity for individuals committed to advancing human rights globally. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Programme Overview Hosted by the Bonavero Institute for Human Rights at the University of Oxford Faculty of Law, the Summer School combines academic rigor with practical legal insights. Participants will engage in: An introductory course on the fundamentals of international human rights law An advanced course in human rights lawyering Elective seminars addressing contemporary global human rights challenges Courses are taught by an internationally recognised faculty composed of leading academics and experienced practitioners in the human rights field. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Students will also experience residential life at New College, Oxford, gaining direct exposure to Oxford s collegiate academic tradition. Programme Highlights 26-day residential summer school University-level academic instruction World-renowned faculty Immersive Oxford college experience Networking with international human rights professionals Limited intake of approximately 60 participants Key Facts Dates: 6 31 July 2026 Location: New College, Oxford Fees: 9,500 (includes tuition, ensuite accommodation and meals) Funding: 3 scholarships of 6,500 each covering tuition Available Places: Approximately 60 Applications Open: 2 February 2026 Application Deadline: 1 April 2026 at 12 noon (UK time) or earlier if all places are filled Contact: ihrl-events@law.ox.ac.uk Scholarships Three scholarships of 6,500 each are available for the 2026 Summer School. These awards aim to support talented individuals who: Have an established connection to the human rights field (paid or voluntary) Demonstrate potential to create meaningful change Would be unable to afford the full course fees without financial assistance Priority will be given to applicants who are ordinarily resident in low-income or lower middle-income countries, as defined by the World Bank. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Course application Scholarship application Why Apply? This Summer School offers an unparalleled opportunity to deepen expertise in international human rights law while studying at the University of Oxford. Participants gain both theoretical grounding and practical legal skills, positioning them to advance human rights work in their communities and internationally. With limited places available and competitive scholarships offered, early application is strongly recommended. Find more scholarships here The post International Human Rights Law Summer School 2026 at Oxford: Fully Funded Scholarship Opportunities Available appeared first on Opportunities for Youth .","tags":["education","Scholarships","Africa","America","Asia","Australia and Oceania","Continent","Europe","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T13:09:30Z","updated_at":"2026-02-27T13:09:30Z"}
{"id":"043d7c8fa5c570286f2f90bdcf6fb6c762f6cf93","title":"Open Now: Truist Foundation Grant for Nonprofits Building Career Pathways and Stronger Small Businesses","url":"https://opportunitiesforyouth.org/2026/02/26/open-now-truist-foundation-grant-for-nonprofits-building-career-pathways-and-stronger-small-businesses/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T18:14:49Z","summary":"The Truist Foundation is committed to building stronger communities through strategic philanthropy and partnerships. By investing in innovative nonprofit organisations, the Foundation supports programs and initiatives that create greater opportunity for adults especially in the areas of economic mobility and small business development. If your organisation is working to empower communities through sustainable, high-impact initiatives, the Truist Foundation grant program may be a valuable funding opportunity. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Areas of Focus The Truist Foundation prioritises projects and programs that align with two key pillars: 1. Building Career Pathways to Economic Mobility The Foundation supports initiatives that help adults gain skills, training, and access to opportunities that improve their economic outcomes and long-term financial stability. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); 2. Strengthening Small Businesses Funding is available for programs that help small businesses start, grow, and thrive especially those that contribute to community development and job creation. Types of Projects Funded The Foundation focuses on sustainable, one-time investments rather than ongoing operational expenses. Examples of eligible funding needs include: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Launch of new programs Curriculum development or expansion Equipment required to deliver programs Capital needs that directly support program delivery Capital Campaign Consideration Capital campaign requests may be eligible if: The project aligns with Truist Foundation s mission and priorities At least 60% of the fundraising goal has already been secured through donations and pledges Grant Cycles and Deadlines The Truist Foundation offers three annual grant cycles : March 31 Applicants notified in July July 31 Applicants notified in November November 30 Applicants notified in April Organisations are encouraged to plan their applications accordingly to align with these review periods. Why Apply for a Truist Foundation Grant? By partnering with the Truist Foundation, organisations gain: Funding for impactful, sustainable programs Support for community-driven economic development Strategic partnership with a mission-driven philanthropic institution Access to evaluation and learning resources to strengthen program outcomes How to Apply Nonprofit organisations that serve adults and align with the Foundation s focus areas can apply through the Truist Foundation s online grant portal. Application Steps: Submit your application via the online portal Deadline: 31st March 2026 After You Receive a Grant Successful applicants will be guided through the next steps of the partnership process. These include: Required Actions Sign and return the Grant Agreement via DocuSign Submit payment information through the Benevity secure portal Complete Monitoring, Evaluation, and Learning (MEL) reports on a quarterly, bi-annual, or annual basis depending on grant size Grantees will receive reminders and guidance for each reporting requirement. Additional Resources for Grantees Recipients will have access to a range of support materials, including: Grantee Guidebook Reporting requirements and timelines Grant acknowledgement guidance Payment submission instructions For any additional support, grantees can reach out to the Foundation through the provided contact channels. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Final Thoughts The Truist Foundation grant program represents a powerful opportunity for nonprofits working to improve economic mobility and empower small businesses. If your organisation is developing innovative, sustainable solutions that uplift communities, consider applying in one of the upcoming grant cycles. Start preparing your application today and join a growing network of organisations building a better future for all. For more information about Grant, Visit Here The post Open Now: Truist Foundation Grant for Nonprofits Building Career Pathways and Stronger Small Businesses appeared first on Opportunities for Youth .","tags":["education","Grants","America","Continent"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T13:09:30Z","updated_at":"2026-02-27T13:09:30Z"}
{"id":"05f56c5e2a62d9dbc4808d8e0284ceaf69dfad94","title":"Argentina Internship Program Summer 2026: A Fully Funded Global Experience for STEM Students in Data, AI & Operations","url":"https://opportunitiesforyouth.org/2026/02/26/argentina-internship-program-summer-2026-a-fully-funded-global-experience-for-stem-students-in-data-ai-operations/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T17:47:03Z","summary":"The Argentina Internship Program Summer 2026 is a fully funded, immersive international internship designed for ambitious students who want to turn academic knowledge into real-world, career-ready experience. Running from June 15 to August 14, 2026 , this 9-week summer internship places selected participants inside Argentina s dynamic energy, technology, and industrial ecosystem. With structured projects in Data Analytics, Artificial Intelligence, Process Improvement, Industrial Technology, and Operational Optimization , this program is especially relevant for U.S. STEM students seeking hands-on exposure to complex, high-impact environments beyond the classroom. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Applications are reviewed on a rolling basis , meaning early applications have a stronger chance of selection. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Why the Argentina Internship Program Stands Out This is not a shadowing or observation-based internship. Participants work on real projects, meet real deadlines, and are expected to deliver real results. From day one, interns are immersed in professional teams where ownership, feedback, and accountability matter. The program is fully funded , covering: International flights Accommodation Daily meals Health insurance Immigration and visa support In-country transportation While the internship is unpaid, the value lies in the depth of experience, global exposure, and the ability to leave with measurable, provable skills rather than just a line on a CV. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Areas of Experience Participants may be placed across multiple functional areas, including: Engineering (Upstream and Downstream Operations) Technology, Data Artificial Intelligence Industrial Operations Process Optimization Finance Economics Sales Marketing Energy Transition Placements are carefully matched based on each participant s academic background, interests, and career goals. Meet the Companies Interns will work with leading organizations operating at scale in high-complexity environments, including: Aeropuertos Argentina , managing major airport operations where logistics, safety, and efficiency intersect daily CGC , a key player in Argentina s hydrocarbon exploration and production Honeywell , delivering advanced solutions across aerospace, automation, and industrial systems Tecpetrol , leading energy development across the region Tenaris , a global leader in industrial manufacturing for the energy industry A global commodities trading company connecting vital resources through infrastructure, logistics, and financing These environments demand precision, adaptability, and problem-solving under pressure exactly the skills global employers value. The True Learning Experience Participants learn by doing. Interns work inside professional teams, receive direct feedback, and collaborate across cultures. The experience rapidly builds independence, confidence, and global mindset qualities that differentiate candidates in competitive job markets. In addition to company placements, interns also: Connect with executives and industry leaders Visit universities and innovation hubs Experience Argentina s professional and cultural ecosystem beyond the workplace Life in Argentina Argentina offers far more than its global reputation for soccer. From world-class cities to diverse landscapes, the country combines cultural richness with professional intensity. Most activities are based in Buenos Aires , often called the Europe of Latin America, with additional site visits depending on company placement. How the Application Process Works Apply online by submitting your CV or LinkedIn profile Complete your full application if shortlisted Connect with the program team for guidance Get matched with the company that best fits your profile Complete final interviews with host companies Prepare for departure and begin your international journey Spanish is required to make the most of the experience, and stronger Spanish proficiency is a competitive advantage. Visa requirements vary by nationality, and full guidance is provided if you are selected. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Important Dates Program Dates: June 15 August 14, 2026 Application Deadline: Rolling basis (early application strongly recommended) APPLY HERE For more information about this apportunity, click here . Discover more internship opportunities here . The post Argentina Internship Program Summer 2026: A Fully Funded Global Experience for STEM Students in Data, AI Operations appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Continent","Europe","Internships","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T13:09:30Z","updated_at":"2026-02-27T13:09:30Z"}
{"id":"fac4f3df3fc5638a9f047153a4f79a223b9a9287","title":"LSHTM MSc Scholarships and Funding Opportunities 2026/27","url":"https://opportunitiesforyouth.org/2026/02/26/lshtm-msc-scholarships-and-funding-opportunities-2026-27/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T17:24:46Z","summary":"The London School of Hygiene Tropical Medicine (LSHTM) has opened multiple funding and scholarship opportunities for the 2026/27 academic year , supporting students across key MSc programmes in global health, epidemiology, medical statistics, and related fields. Funding is available for both on-campus and distance learning programmes , with most deadlines falling in March 2026 . Eligibility, fee status, and funding coverage vary by course and scholarship. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); MSc Medical Statistics This programme focuses on statistical methods for medical and public health research, preparing graduates for roles in academia, research institutions, and health agencies. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Available Scholarships: ISEP Postgraduate Training Fellowship (2026/27) Fee Status: Overseas students Deadline: 31 March 2026 MSc Medical Parasitology Entomology Designed for students interested in tropical medicine, vector-borne diseases, and infectious disease control. Available Scholarships: Royal Entomological Society Scholarship (2026/27) Fee Status: Home students Deadline: 25 March 2026 Mansfield Aders and Avebury Memorial Fund (2026/27) Fee Status: Home students Deadline: 25 March 2026 MSc Demography Health This programme explores population dynamics and their impact on health outcomes and policy. Available Scholarships: Basia Zaba Memorial Scholarship (2026/27) Fee Status: Home students Deadline: 25 March 2026 MSc Sexual Reproductive Health Policy and Programming Ideal for professionals aiming to influence sexual and reproductive health policy and programmes globally. Available Scholarships: MSc SRHPP Scholarships (2026/27) Fee Status: Overseas students Deadline: 22 March 2026 Distance Learning MSc Programmes Flexible postgraduate options for professionals balancing study with work or other commitments. Available Scholarships: LSHTM First Generation Scholarship (2026/27) Fee Status: See individual advert Deadline: 27 March 2026 Multiple MSc Programmes (Various Disciplines) These scholarships are not tied to a single course and can be used across several MSc programmes. Available Scholarships: LSHTM Next Generation Scholarships (2026/27) Fee Status: Home students Deadline: 27 March 2026 GSK Scholarships for Future Health Leaders (2026/27) Fee Status: Overseas students Deadline: 4 March 2026 LSHTM Fund Scholarship (2026/27) Fee Status: Overseas students Deadline: 4 March 2026 Important Notes for Applicants Applicants must meet the admission requirements for their chosen MSc programme. Each scholarship has specific eligibility and selection criteria. LSHTM regularly updates its funding list, and new opportunities may be added. Applications from Black, Asian, Ethnic Minority, and first-generation students are particularly encouraged. For more information about this apportunity, click here . Discover more scholarships and fundings opportunities here . The post LSHTM MSc Scholarships and Funding Opportunities 2026/27 appeared first on Opportunities for Youth .","tags":["education","Middle East and North Africa","Africa","America","Asia","Australia and Oceania","Continent","Europe","Latin America and the Caribbean","Scholarships","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T13:09:30Z","updated_at":"2026-02-27T13:09:30Z"}
{"id":"aeda9b28369fde422e0b6aae4dc36c5c7dfd58fc","title":"2026 Funding Opportunities in Europe: BNP Paribas Banlieues Project (France) & ILGA-Europe Fund for Racial Justice Grants up to €25,000","url":"https://opportunitiesforyouth.org/2026/02/26/2026-funding-opportunities-in-europe-bnp-paribas-banlieues-project-france-ilga-europe-fund-for-racial-justice-grants-up-to-e25000/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-26T17:16:20Z","summary":"Two major 2026 funding opportunities are now open in Europe for grassroots organisations and community-led initiatives working on social inclusion, anti-discrimination, education, employment, civic space, and racial justice. The BNP Paribas Banlieues Project 2026 in France supports local associations working in Priority Districts of the City (QPV), while the ILGA-Europe Fund for Racial Justice 2026 provides grants of up to 25,000 to organisations led by racialised LGBTI communities across Europe. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Both calls aim to strengthen civil society, empower marginalised communities, and build long-term structural change. Below is a comprehensive guide covering eligibility, funding scope, timelines, and application processes for both opportunities. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); 1. BNP Paribas Banlieues Project 2026 Support for Local Associations in France Overview of the Banlieues Project Launched in 2006 by BNP Paribas and managed by the BNP Paribas Foundation, the Banlieues Project is a solidarity programme designed to support local associations operating in Priority Districts of the City (QPV) in France. Each year, BNP Paribas launches a call for applications to identify and support grassroots associations that combat exclusion and promote: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Access to education Professional integration and employment Entrepreneurship Social cohesion and living better together The project not only provides financial support but also strengthens visibility, institutional connections, and ecosystem integration for selected associations. Since its inception, the Banlieues Project has helped numerous associations scale their impact and gain national recognition. 2026 Key Dates Submission of Applications: 28 January 9 March 2026 Application Review: March June 2026 Decision Committee: June 2026 Fields of Action Supported Projects must align with the solidarity theme and fall under one or more of the following categories: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Access to Education Academic support Literacy programmes Cultural integration initiatives Digital inclusion Citizenship education Environmental awareness initiatives Access to Employment Professional integration programmes Vocational training Mentorship programmes Entrepreneurship support Improvement of Living Together Intercultural and intergenerational actions Strengthening social bonds Regional planning initiatives Ecological transformation projects Community-based solidarity efforts Who Can Apply? Eligible applicants are local associations operating within Priority Districts of the City (QPV) in France, including overseas territories. Associations must demonstrate: Active engagement in combating exclusion Strong local presence Commitment to education, employment access, or social cohesion Clear impact within priority neighbourhoods What Makes the Banlieues Project Unique? Beyond financial assistance, the programme: Promotes supported organisations within a wider institutional ecosystem Enhances visibility among public stakeholders Connects associations with the general public Strengthens long-term development capacity The programme recognises and amplifies everyday heroes working at the community level. Learn more and apply HERE . 2. ILGA-Europe Fund for Racial Justice 2026 Grants up to 25,000 Overview of the Fund The ILGA-Europe Fund for Racial Justice is the successor to the No One Left Behind Fund and focuses on supporting organisations led by racialised LGBTI communities in Europe. The Fund recognises that advancing LGBTI equality requires addressing racism as a structural force and strengthening racial justice activism within civic and political spaces. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Through this call, ILGA-Europe will support up to 12 organisations with grants of up to 25,000 each for 12 months. Application Deadline 13 April 2026, 23:59 CEST Applicants will be informed of results during the week of 11 May 2026. What the Fund Supports Projects must run from 1 June 2026 to 1 June 2027 and may include: Creating or protecting civic and political space Strengthening community organising and solidarity Challenging oppressive systems and practices Shifting public narratives Organising public campaigns or cultural initiatives Mapping or documenting community needs tied to collective action Building cross-movement alliances The Fund encourages approaches combining: Care practices Direct organising Collective public engagement Funding Details Each selected organisation may receive: Up to 25,000 for 12 months Eligible budget lines include: Personnel costs Travel and event expenses External expertise Interpretation and translation Communication and outreach Administrative/core costs linked to project delivery There is no fixed percentage cap on personnel or consultancy costs if aligned with project objectives. Partnership Structure Selected organisations will participate in: Three online partner meetings One in-person meeting in Dublin (6 7 October 2026) Quarterly progress calls Interim report (November 2026) Final report (June 2027) Who Can Apply? The call is open to registered and non-registered organisations in Europe that: Are led by racialised LGBTI people Work for and with racialised LGBTI communities Non-registered groups must partner with a registered legal entity. Applicants must be ILGA-Europe member organisations by 1 June 2026 (or have membership applications under consideration by 1 April 2026). ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Funding primarily supports EU-based organisations, with potential limited support for non-EU applicants if additional funding is secured. Learn more and apply HERE . Comparison of the Two 2026 Funding Opportunities BNP Paribas Banlieues Project: Focus: Local associations in French QPV areas Themes: Education, employment, social cohesion Geographic Scope: France (including overseas territories) Deadline: 9 March 2026 ILGA-Europe Fund for Racial Justice: Focus: Racialised LGBTI-led organisations Themes: Civic space, racial justice, LGBTI equality Geographic Scope: Europe (primarily EU Member States) Deadline: 13 April 2026 Both programmes strengthen grassroots organising and community-led change. For more global grant opportunities, visit HERE . The post 2026 Funding Opportunities in Europe: BNP Paribas Banlieues Project (France) ILGA-Europe Fund for Racial Justice Grants up to €25,000 appeared first on Opportunities for Youth .","tags":["education","Grants","Europe"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T13:09:30Z","updated_at":"2026-02-27T13:09:30Z"}
