{"id":"a3c9aafeb38aff3e2964838d31e772a71654228d","title":"Mastercard Foundation EdTech Fellowship 2026 (Cohort 3): Equity-Free Grant of Up to $60,000 for Growth-Stage EdTech Startups in Egypt with African Founders","url":"https://opportunitiesforyouth.org/2026/02/24/mastercard-foundation-edtech-fellowship-2026-cohort-3-equity-free-grant-of-up-to-60000-for-growth-stage-edtech-startups-in-egypt-with-african-founders/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T12:48:02Z","summary":"The Mastercard Foundation EdTech Fellowship 2026 (Cohort 3), delivered in partnership with EdVentures, is a transformative acceleration program designed to scale growth-stage EdTech startups in Egypt while driving inclusive, technology-enabled learning across Africa. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This 7 8 month fellowship empowers startups to expand market reach, strengthen business models, and increase access to digital education solutions particularly for women, youth (18 35), refugees, and people with disabilities. The program offers equity-free funding of up to $60,000, expert mentorship, Carnegie Mellon University (CMU) learning sessions, in-kind business services, and two years of post-program support. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Program Overview: Scaling EdTech for Impact Across Africa The Fellowship aims to revolutionize the MENA EdTech ecosystem through: Digital innovation Inclusive education solutions Youth empowerment Sustainable job creation Gender equity African-led entrepreneurship ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); It aligns with the strategic goals of the Mastercard Foundation and EdVentures to drive long-term transformation in education systems while strengthening entrepreneurship in Egypt with an African focus. Key Program Details Duration: 7 8 months Post-Program Support: 2 years Location Requirement: Incorporated in Egypt Eligible Founders: African origin or residing in Africa Funding: Equity-free grant of up to $59,600 $60,000 Stage: Growth-stage EdTech startups ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Who Can Apply? The program is open to: EdTech startups incorporated in Egypt Growth-stage startups operating for at least three years Startups with a developed product and post-revenue status Market-ready and scalable EdTech solutions Founders of African origin or residing in Africa Youth founders aged 18 35 (preferred) Women-led startups (preferred) The program strongly encourages solutions focused on inclusion, particularly those serving: Women and girls Young people Refugees People with disabilities ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Fellowship Benefits Selected startups receive: Mentorship Opportunities Guidance from experienced industry leaders and business experts. Training Sessions Structured growth-focused learning including business scaling strategies. Science of Learning Courses Specialized learning modules to strengthen education technology design. Networking Events Access to investors, partners, and ecosystem leaders. Equity-Free Grant Up to $60,000 in non-dilutive funding. Carnegie Mellon University (CMU) Support Advanced knowledge-sharing sessions and growth advisory. In-Kind Services Marketing services Legal services Cloud services Studio services Fintech solutions Media PR support Partner matchmaking ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Program Structure and Journey The Fellowship journey includes: Application submission Screening and shortlisting Initial interviews Intensive Bootcamp (3 days outside Cairo at a reputed hotel) Final presentations and pitch Official onboarding into the program 7 8 month acceleration phase Two years of post-program support The program incorporates milestone-driven monitoring and evaluation to ensure measurable growth outcomes. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); FREQUENTLY ASKED QUESTIONS (FAQ) What is the selection process like? The selection process includes: Application Screening Initial Interview Bootcamp Phase Final Pitch Presentation Official Program Entry What is EdTech? EdTech refers to technology-based tools, platforms, and solutions designed to enhance education systems, teaching methods, learning experiences, and institutional effectiveness. What criteria are used to evaluate applicants? Applicants are evaluated based on: The problem being solved Innovation and technology uniqueness Market potential Team expertise Scalability Alignment with program goals Social impact ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); What is the objective of the program? The Fellowship aims to empower growth-stage EdTech startups to scale operations and increase access to technology-enabled learning, with emphasis on women, youth, refugees, and people with disabilities. What are the eligibility criteria? Startups must: Be incorporated in Egypt Have operated for at least 3 years Be growth-stage with MVP and post-revenue Offer scalable EdTech solutions Preferably be women-led Preferably have youth founders (18 35) Encourage inclusive education models What resources will participants receive? Participants receive: Mentorship Workshops CMU sessions Networking In-kind services Equity-free grant funding Post-program support ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); How is the program structured? The program includes: Workshops Knowledge-sharing sessions Mentorship Networking Monitoring Evaluation support What is the program duration? 7 8 months, plus two years of post-program support. Where will the Bootcamp take place? Outside Cairo for three days in a reputed hotel. What stage should my startup be in? Growth-stage with developed product and post-revenue. Can I be a solo founder? Solo founders may apply, but teams with at least two co-founders and gender diversity are preferred. Application Deadline No specific deadline is publicly stated. Applications are currently open. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); APPLY HERE For more information about the Mastercard Foundation EdTech Fellowship, click HERE Visit HERE for more fellowship opportunities. The post Mastercard Foundation EdTech Fellowship 2026 (Cohort 3): Equity-Free Grant of Up to $60,000 for Growth-Stage EdTech Startups in Egypt with African Founders appeared first on Opportunities for Youth .","tags":["education","Africa","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T13:17:53Z","updated_at":"2026-02-24T13:17:53Z"}
{"id":"c1f196565b5c5021d1e6063f77ca513823760da9","title":"Realizing the Youth, Peace and Security Agenda: UNSSC Online Course 2026","url":"https://opportunitiesforyouth.org/2026/02/24/realizing-the-youth-peace-and-security-agenda-unssc-online-course-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T12:06:41Z","summary":"The United Nations System Staff College (UNSSC), in collaboration with the Folke Bernadotte Academy (FBA), is offering its flagship programme Realizing the Youth, Peace and Security Agenda in 2026. This comprehensive online learning experience equips practitioners with the skills and knowledge needed to meaningfully engage young people in peace and security efforts. The course runs from 13 April to 30 October 2026 , with enrollment open until 10 April 2026 . ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); About the UNSSC Course Young people are increasingly recognised as agents of positive change in conflict prevention, peacebuilding, and the promotion of just and inclusive societies. UN Security Council Resolutions 2250 (2015), 2419 (2018), and 2535 (2020) emphasize the need for youth participation, leadership, and influence in peace and security initiatives at local, national, and global levels. This course provides participants with a structured pathway to understand the Youth, Peace and Security (YPS) agenda and to apply it effectively within their own organizations, programmes, and communities. It is designed for practitioners across the UN system, NGOs, civil society, regional bodies, and security institutions working in youth engagement or peacebuilding contexts. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Course Format and Structure The programme is delivered fully online and is divided into two distinct learning phases: Part I Foundational Skills (13 April to 22 May 2026) Participants will complete three core modules that introduce the YPS agenda and explore the foundations of youth participation and conflict analysis. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Modules include: Introduction to the Youth, Peace and Security Agenda Enabling Meaningful Youth Participation Conducting Youth-Sensitive Conflict Analysis This phase includes one mandatory written assignment. Part II Applied Skills (14 September to 30 October 2026) Participants will select at least one of the three applied modules, each designed to translate YPS principles into practice. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Elective modules include: Serving as a YPS Adviser or Focal Point Youth-Responsive and YPS-Focused Programming In-Country Implementation of the YPS Agenda This second phase includes at least one written assignment. Across both parts, learners can expect approximately 3 4 hours of weekly study. The programme also includes facilitated webinars, peer exchanges, interactive activities, and ongoing guidance from UNSSC trainers. What Participants Gain By completing the course, participants will: Develop a strong understanding of youth roles in peace and security systems ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Strengthen their ability to design and implement youth-responsive initiatives Learn how to integrate youth perspectives into conflict analysis and programming Enhance their competency in supporting youth-led peacebuilding efforts Engage in a global peer network of practitioners committed to the YPS agenda ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); The course fosters both theoretical grounding and practical skills, preparing participants to champion youth participation in decision-making processes. Target Audience The programme is open to: UN staff members Practitioners in international and regional organisations NGO and civil society representatives Peacebuilding professionals working directly with youth Anyone seeking structured training in the YPS agenda This course is suitable for participants at all levels of experience, and no prior specialization is required. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Cost and Selection Criteria The course fee is 1,250 USD , covering access to all modules, live sessions, materials, and individualized support. Selection is based on motivation, relevant experience, commitment to the agenda, and diversity factors such as regional representation, gender balance, and sector background. UN staff applicants must include a supervisor endorsement. Important Dates Course Dates: 13 April 30 October 2026 Part I: 13 April 22 May 2026 Part II: 14 September 30 October 2026 Enrollment Deadline: 10 April 2026 ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application can be accessed from here . To know more about such opportunities, click here . The post Realizing the Youth, Peace and Security Agenda: UNSSC Online Course 2026 appeared first on Opportunities for Youth .","tags":["education","Short Courses","Europe","conflict analysis skills","online peacebuilding course","peace and security practitioners","UNSSC 2026","youth participation in peace","Youth Peace and Security","YPS agenda training"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T13:17:53Z","updated_at":"2026-02-24T13:17:53Z"}
{"id":"aa56c8ee2f6332c9a1686736488e8cea5eed57e2","title":"Mastercard Foundation FAST Fund 2026: Support for Alumni-Led Start-ups","url":"https://opportunitiesforyouth.org/2026/02/24/mastercard-foundation-fast-fund-2026-support-for-alumni-led-start-ups/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T12:00:26Z","summary":"Applications are now open for the Mastercard Foundation FAST Fund for Alumni Start-ups in Transition (FAST) , a program designed to support emerging and established businesses led by alumni of key leadership and entrepreneurship initiatives across Africa. The FAST program helps founders navigate the transition from idea to growth phase by offering financial support, coaching, and advisory assistance. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); The deadline for all applications is 16:00 GMT on Friday, 20 March . About the Mastercard Foundation FAST Fund The Mastercard Foundation FAST Fund supports businesses that are majority-owned by alumni of one or more of the following programs: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Mastercard Foundation Scholars Program African Leadership Academy (ALA) Anzisha Prize Young African Leaders Initiative (YALI) The program aims to strengthen alumni entrepreneurship ecosystems by providing targeted support for new or existing ventures navigating early-stage challenges. Applicants may apply in Arabic, English, French, Portuguese, or Spanish , ensuring broad accessibility. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); During this cycle, FAST funding is not available to founders over the age of 34 , as the program focuses on young entrepreneurs actively shaping economic opportunities within their countries. Who Can Apply To be eligible, applicants must: Own a for-profit business (nonprofits are not eligible). Be majority-owned by alumni from at least one of the four eligible programs. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Reside in or operate a business in one of the qualifying countries listed in the application form. Be able to participate in coaching and activities in an approved program language. Provide documentation confirming alumni status. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Alumni of the Mastercard Foundation Scholars Program must submit a student ID from their institution to verify their status. Alumni from ALA, YALI, or the Anzisha Prize may provide the FAST Verification Letter or alternative documentation such as a certificate of completion. (Your uploaded verification letter template will be used for this purpose.) Women entrepreneurs, refugees or forcibly displaced applicants, and persons with disabilities are strongly encouraged to apply . What the FAST Program Offers The FAST Fund is designed to support small enterprises at critical transition points. Successful applicants gain access to: ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Financial support to help stabilize or grow their business Tailored coaching delivered in their preferred language Business development guidance from experienced mentors Supportive alumni networks and professional resources The program emphasizes sustainability, inclusion, and leadership, helping founders create ventures that generate income, opportunities, and community impact. Application Requirements Applicants should be prepared to submit: Personal and business information Proof of alumni status Details about the proposed or existing business Information about the business model, target audience, and market need ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Supporting documentation, such as the FAST Verification Letter template you uploaded The application requires approximately 15 30 minutes to complete. Applicants who are based in Rwanda or plan to establish their business in Rwanda must apply through the FAST program s Rwanda-based partner. All other applicants should complete the global form. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Important Deadline All applications must be submitted by 16:00 GMT on Friday, 20 March. Late applications will not be accepted, and only shortlisted candidates will be contacted with next steps. A Valuable Opportunity for Young African Entrepreneurs The Mastercard Foundation FAST Fund offers an important opportunity for young changemakers building impactful businesses across Africa. By supporting alumni-led ventures during key moments of transition, the program strengthens local entrepreneurship ecosystems and empowers founders to scale solutions within their communities. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Whether your business is newly formed or already in operation, the FAST program provides the structure, mentorship, and validation needed to move forward confidently. Application can be accessed from here . To know more about such opportunities, click here . The post Mastercard Foundation FAST Fund 2026: Support for Alumni-Led Start-ups appeared first on Opportunities for Youth .","tags":["education","Africa","Grants","African entrepreneurship","alumni verification","business transition funding","FAST Fund 2026","Mastercard Foundation alumni","young innovators","youth-led start-ups"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T13:17:53Z","updated_at":"2026-02-24T13:17:53Z"}
{"id":"3e1e0b63283c2b94341eaff819384fc2ac53899f","title":"Scowcroft-Nye Fellowship 2026 at the Aspen Institute: Paid Six-Month National Security Fellowship in Washington, DC ($25/Hour)","url":"https://opportunitiesforyouth.org/2026/02/24/fellow-at-the-aspen-institute/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T10:24:37Z","summary":"The Scowcroft-Nye Fellowship 2026 is a prestigious, paid, full-time fellowship hosted by the Aspen Strategy Group (ASG), a leading nonpartisan foreign policy program of the Aspen Institute. Designed as a stepping-stone for young leaders pursuing careers in U.S. foreign policy and national security, this six-month fellowship offers hands-on exposure to high-level strategic dialogue, policy convenings, and global security discussions. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Location: Washington, DC (Hybrid minimum three days per week in office) Compensation: $25 per hour Fellowship Term: April May 2026 through October November 2026 (Six months, with potential extension up to twelve months) Application Review: Rolling basis About the Aspen Institute Founded in 1949, the Aspen Institute is a global nonprofit organization dedicated to fostering a free, just, and equitable society. Headquartered in Washington, DC, with a campus in Aspen, Colorado and an international network of partners, the Institute convenes leaders, policymakers, scholars, and practitioners to address critical global challenges through dialogue, leadership development, and policy innovation. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The Aspen Strategy Group (ASG) serves as one of the Institute s flagship policy programs, focusing specifically on U.S. foreign policy and national security. What Is the Scowcroft-Nye Fellowship? The Scowcroft-Nye Fellowship is a temporary, full-time fellowship aimed at young professionals seeking practical experience in foreign policy and national security. It offers direct involvement in organizing high-level strategic convenings and working alongside prominent leaders in diplomacy, defense, intelligence, and policymaking. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Originally launched in 2003 as the Brent Scowcroft Award Fellowship, the program was renamed in 2025 to honor Joseph S. Nye, Jr., recognizing four decades of leadership within the Aspen Strategy Group. This fellowship places participants at the center of: Strategic foreign policy dialogue High-profile security forums Track II diplomacy initiatives Rising Leaders programs Public and private convenings ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Fellowship Responsibilities Scowcroft-Nye Fellows contribute across three core pillars: Aspen Strategy Group Aspen Security Forum Rising Leaders Program Key responsibilities include: Administrative Logistical Support Preparing for major conferences and strategic convenings Coordinating details for ASG Summer Workshop, Rising Leaders Program, Aspen Security Forum, ASF DC Edition, and Track II dialogues ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Policy Research Work Conducting background research on current foreign affairs Drafting briefings, memos, summaries, grant proposals, and reports Proofreading and editing policy materials Conference Support Attending sessions and taking substantive notes Generating conference materials Drafting communications to speakers, participants, and vendors Digital Communications Support Managing social media content (Twitter/X, LinkedIn, Instagram) Supporting the ASG weekly newsletter Curating strategic messaging ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); This fellowship operates in a fast-paced, small-team environment where fellows are entrusted with significant responsibility. Why Apply? The Scowcroft-Nye Fellowship offers: Direct exposure to senior foreign policy leaders Experience in strategic dialogue and convening Policy research and briefing development skills Networking with national security experts A launchpad into careers in: Government Think tanks Policy institutions Defense and intelligence sectors International organizations ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); This fellowship is particularly valuable for individuals considering graduate studies or careers in foreign policy. Skills and Qualifications Required Applicants must meet the following criteria: Education Bachelor s degree required Master s degree strongly preferred Academic Background Strong academic record in: International Relations Political Science Economics Or related fields Professional Skills Excellent writing and communication skills Meticulous attention to detail Ability to manage multiple priorities Strong problem-solving abilities Comfort working under pressure ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Technical Skills Proficiency or ability to learn tools such as: WordPress Canva Twitter/X Instagram iContact FormAssembly Event registration platforms Preferred Experience Office or events management experience Long-term interest in U.S. foreign policy and national security ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Work Environment and Structure The fellowship is: Full-time Temporary (six months) Hybrid (minimum three days in Washington, DC office) Collaborative and small-team oriented Selected candidates must be located in the Washington, DC area for the full fellowship term. Compensation and Benefits Salary: $25 per hour In addition to compensation, fellows receive access to: Health, dental, vision, and prescription benefits Retirement benefits Paid leave Professional exposure to leading policymakers and thinkers ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Application Process Applicants must submit: One-page cover letter Resume/CV including at least two references Applications are reviewed on a rolling basis. Interested candidates are encouraged to apply early due to competitive selection. Click HERE to submit an application. Equal Opportunity Statement The Aspen Institute is an Equal Opportunity Employer and complies with all District and federal laws. Qualified applicants receive consideration without regard to race, religion, sex, national origin, veteran status, or disability. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Application Deadline Applications are reviewed on a rolling basis. No fixed deadline is specified. Learn more about the Scowcroft-Nye Fellowship 2026 HERE . Click HERE to discover more global fellowship opportunities on OFY. The post Scowcroft-Nye Fellowship 2026 at the Aspen Institute: Paid Six-Month National Security Fellowship in Washington, DC ($25/Hour) appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Fellowship","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T13:17:53Z","updated_at":"2026-02-24T13:17:53Z"}
{"id":"aa9a0e2d872c4706d655f07d9f50e57f8e04c378","title":"British Council MSc TESOL Scholarships 2026 – Fully Funded Study Opportunity for Teachers in South Asia","url":"https://opportunitiesforyouth.org/2026/02/24/tesol-scholarships/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T10:10:49Z","summary":"The British Council English and School Education Scholarships Scheme 2026 is a fully funded opportunity designed to support experienced teachers and teacher educators from Bangladesh, India, and Sri Lanka to pursue advanced study in English language teaching. This initiative aims to strengthen classroom practice, deepen pedagogical expertise, and build education leadership capacity in participating countries. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Why This Opportunity Matters Quality English language teaching remains a critical need in school systems across Bangladesh, India, and Sri Lanka. By supporting teachers to access advanced academic training and global networks, the British Council is fostering a generation of educators equipped to lead instructional improvements and inspire professional learning communities. Who Can Apply This scholarship is open to: Experienced teachers and teacher educators working in government school systems in Bangladesh, India, and Sri Lanka Candidates who are actively employed in school or teacher education settings and are motivated to transform classroom practice and professional development in English language teaching. Eligible applicants should be committed to returning to their home countries and applying their new skills to benefit local educational outcomes. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Successful applicants will be enrolled in the MSc in Teaching English to Speakers of Other Languages (Online) programme delivered by the University of Stirling in partnership with the British Council. This blend of online study and an in-person residency enables teachers to grow academically without compromising their professional commitments. What the Scholarship Covers The British Council s scholarships provide: Full tuition coverage for the online MSc TESOL. An opportunity to participate in a two-week residential study visit in the UK that promotes academic collaboration and global networking. Access to specialist faculty, mentorship, and global peer learning communities. A platform to develop skills in curriculum design, assessment, and teacher training methodologies. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); This combination of online coursework and in-person experience helps teachers integrate global best practices into local contexts and fosters professional networks that extend beyond the programme. Programme Structure The programme begins with online study delivered over approximately 30 months . Participants engage with evidence-based teaching strategies, curriculum design, assessment tools, and emerging trends in English language teaching. The scalable online format allows teachers to stay connected with their schools while advancing their academic credentials. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Mid-way through the programme, participants will travel to the UK for a two-week immersive academic residency . During this period, they will interact with faculty, engage in workshops and seminars, and strengthen connections with international teacher leaders. This residency is an essential component of the learning experience and is fully supported by the scholarship. Graduates of the programme become part of the British Council s global alumni network , a community supporting ongoing professional learning and collaboration across borders. Key Dates Information Session: 5 March 2026 (12:30 13:30 UK time) an opportunity to learn more about eligibility and the application process. Scholarship Application Deadline: 30 April 2026. Online Study Begins: September 2026. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Prospective applicants should begin the process by applying for the MSc TESOL (Online) programme with the University of Stirling. Once they receive an offer of admission, they can complete the scholarship application through the British Council s online portal. Selection Criteria and Tips Applicants will be assessed on: Professional experience in English language teaching. Commitment to educational leadership and improving outcomes in their home education systems. Academic readiness and motivation to complete a postgraduate programme. Potential to act as a change agent within their school or teacher education context. Learn more and apply on the official website here . Looking for more opportunities? Check out the Opportunities for Youth website! ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); The post British Council MSc TESOL Scholarships 2026 – Fully Funded Study Opportunity for Teachers in South Asia appeared first on Opportunities for Youth .","tags":["education","Asia","Master","Scholarships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T13:17:53Z","updated_at":"2026-02-24T13:17:53Z"}
{"id":"94b84799462dcdd7c6b1d7c1af2297977f0920a7","title":"RiseUp with ServiceNow 2026 (Kenya, Nigeria, South Africa): Free 10-Week Intensive Tech Training with Certification & Career Pathways","url":"https://opportunitiesforyouth.org/2026/02/24/riseup-with-servicenow-x-the-diana-award-a-free-10-week-tech-career-accelerator-for-young-people-in-africa/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T10:00:34Z","summary":"The RiseUp: Advanced Foundations programme is a powerful partnership between ServiceNow and The Diana Award , designed to equip young people with the practical skills, technical expertise, and professional readiness needed to launch a career in the ServiceNow technology ecosystem. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This fully funded, 10-week, full-time online programme provides hands-on platform experience, industry-recognised certification preparation, mentoring, employability skills training, and direct access to hiring networks. Programme Dates: April 13 June 19, 2026 Format: Online (Virtual Learning) Location Eligibility: Kenya, Nigeria, South Africa Cost: Free ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); What Is RiseUp: Advanced Foundations? RiseUp with ServiceNow is a structured, immersive learning experience created to widen access to opportunities in the fast-growing ServiceNow technology space. Participants will: Gain practical experience using the ServiceNow platform Complete the RiseUp digital and employability curriculum Develop strong technical and behavioural skills Prepare for a globally recognised ServiceNow certification Access job-matching pathways and alumni networks ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); This initiative directly addresses underrepresentation in the tech industry by removing financial and qualification barriers. Why Apply? The global demand for ServiceNow professionals continues to rise. This programme removes cost barriers and provides direct access to one of the fastest-growing enterprise technology platforms in the world. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Participants graduate with: Platform skills Certification readiness Employer connections Professional networks Real confidence in entering the tech workforce Programme Structure and Schedule Duration: 10 weeks Dates: April 13 June 19, 2026 Days: Monday Friday Hours: 9:00 AM 5:00 PM SAST (GMT+2) Mode: Fully Online Participants must commit full-time for the entire programme duration. Who Is This Programme For? The programme is open to individuals aged 18 30 based in: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Kenya Nigeria South Africa Applicants do not need prior qualifications or work experience in tech. The programme actively encourages applications from groups underrepresented in the technology sector. Applicants must: Be proficient in English (written and verbal) Be eager to launch a tech career Demonstrate a growth mindset Commit full-time for 10 weeks Have access to a computer (no tablets or phones) with reliable internet and camera Not currently be employed by ServiceNow, ServiceNow customers, or ServiceNow partners ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Career Pathways After Completion Graduates of the programme may pursue roles such as: Platform Developer Analyst Operations Specialist Junior Technical Consultant Application Specialist Software Developer The programme provides career transition support and employer connections. What Will You Gain? Participants benefit from: Free industry-aligned tech training Hands-on ServiceNow platform experience Personalised one-on-one mentoring Group networking opportunities Industry-recognised certification (upon passing exams) Ongoing job placement support Mental fitness and resilience training Access to RiseUp alumni networks ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Technical Skills You Will Learn Participants develop foundational and advanced platform knowledge, including: Configuring applications on the ServiceNow platform Using Flow Designer and Service Catalog JavaScript scripting Application design and lifecycle management Process automation Data monitoring and system health management Security configuration and access controls Integration techniques User interface design Analytics and reporting Artificial Intelligence fundamentals Responsible and ethical AI usage Understanding ServiceNow AI Agents and platform capabilities The programme blends hands-on sessions with structured learning modules to ensure real-world readiness. Behavioural and Professional Skills Development In addition to technical mastery, learners receive structured support to build: ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Confidence and resilience Communication and presentation skills Team collaboration skills Adaptability Problem-solving abilities Stress and feedback management techniques Mental fitness sessions are led by The Diana Award facilitators, ensuring holistic development. The Application Process Submit an Expression of Interest form Attend an Introduction Webinar Complete the ServiceNow onboarding form Receive a conditional offer Complete pre-work Begin the programme ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); FREQUENTLY ASKED QUESTIONS (FAQ) What is the Eligibility Criteria? Applicants must: Be aged 18 30 Be based in Kenya, Nigeria, or South Africa Have the legal right to live and work in their country Be available full-time for 10 weeks Communicate clearly in English Not be employed by a ServiceNow customer or partner Have access to a computer with reliable internet and camera Have no prior formal ServiceNow certifications Have not completed a previous NextGen, Rise Up, or ServiceNow academic programme ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); What Industry Skills Will You Learn? Technical Skills: ServiceNow platform configuration Application design and integration Business logic and workflow automation AI tools within ServiceNow Monitoring and instance security Scripting with JavaScript AI Agents functionality Behavioural Skills: Confidence building Professional communication Team collaboration Growth mindset development Adaptability and resilience ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); What Are the Ongoing Benefits? Graduates gain: Membership in the RiseUp alumni community Continued mentorship access Career development resources Exposure to job opportunities through ServiceNow networks Opportunity to promote and support future participants Application Deadline No specific deadline is publicly stated. However, the programme begins April 13, 2026. Early registration of interest is strongly recommended. Apply Here Find more information about the RiseUp with ServiceNow Tech Training HERE . ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Visit here for more global fellowships on OFY. The post RiseUp with ServiceNow 2026 (Kenya, Nigeria, South Africa): Free 10-Week Intensive Tech Training with Certification Career Pathways appeared first on Opportunities for Youth .","tags":["education","Short Courses","Africa","Fellowship","Free Tech Programme","Kenya Nigeria South Africa Opportunities","RiseUp with ServiceNow","ServiceNow Certification","Tech Training Africa","The Diana Award","Youth Career Development"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T13:17:53Z","updated_at":"2026-02-24T13:17:53Z"}
{"id":"f0933f914ba305e7d253d1955b736f9b67e06a36","title":"Apply to the Legislative Youth Advisory Council (LYAC): Washington’s Official Youth Voice in Government","url":"https://opportunitiesforyouth.org/2026/02/24/apply-to-the-legislative-youth-advisory-council-lyac-washingtons-official-youth-voice-in-government/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T09:57:02Z","summary":"The Legislative Youth Advisory Council (LYAC) is the official, nonpartisan youth advisory body to the Washington State Legislature. Designed for students aged 14 18, LYAC offers a unique platform for young people to actively shape public policy, represent their peers, and drive meaningful change across the state. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); With members drawn from diverse geographic, political, and socioeconomic backgrounds, the council ensures that youth voices are heard where it matters most at the heart of government decision-making. What Is LYAC and Why It Matters Established in 2005 by then 12-year-old Alex Jonlin, LYAC stands as proof that young people can influence policy and governance at the highest levels. The council is entirely youth-led and operates with oversight from the Office of the Lieutenant Governor and the Washington State Leadership Board. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); As the only legally recognized youth advisory body to the Washington State Legislature, LYAC serves as the official voice of Washington youth in shaping legislation and policy priorities. What LYAC Members Do Members of LYAC are deeply involved in civic engagement and policymaking. Through their two-year term, students: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Meet with legislators to advocate for youth-focused policies Testify before the state legislature in support of or opposition to legislation Advise government officials, policymakers, and leaders across sectors Collaborate with nearly 200 community organizations statewide Host youth engagement events attended by hundreds of students Work with media outlets such as the Associated Press, Teen Vogue, and KING-5 ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Partner with agencies like the Attorney General s Office and Department of Health Draft and propose real legislation Ensure youth perspectives are represented in key decisions From organizing civic workshops to lobbying policymakers, LYAC members play a hands-on role in shaping Washington s future. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); How LYAC Represents Youth Across Washington LYAC is committed to ensuring it accurately reflects the voices of young people across the state. It achieves this through: Collaborating with hundreds of youth-serving organizations Conducting statewide youth surveys to gather diverse perspectives Hosting events to connect students with policymakers Ensuring equitable access through inclusive recruitment and selection This commitment to representation ensures that policies reflect the real needs and priorities of Washington s youth. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); LYAC s Impact and Legacy LYAC s work has left a lasting mark on civic participation in Washington. Whether hosting large-scale youth events, delivering civic education workshops, or influencing legislation, the council has empowered thousands of young people to engage in governance and advocacy. The program continues to inspire youth to take leadership roles in their communities and beyond. Apply for the LYAC 2028 Cohort Applications are now open for the 2028 LYAC Cohort . Apply HERE ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Key Eligibility Requirements To apply, candidates must: Be in grades 7 10 Reside in and attend school in Washington State Obtain parent or guardian consent Submit a completed application by the deadline Provide a letter of recommendation (optional but strongly encouraged) Application Deadline April 30, 2026, 11:59 PM Pacific Time Why You Should Apply Serving on LYAC offers an unparalleled opportunity to: Influence real legislation Develop leadership and advocacy skills Build networks with policymakers and community leaders Represent youth voices at the state level Create lasting change in your community From testifying at the legislature to organizing statewide events, LYAC members are at the forefront of youth civic leadership. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Final Thoughts The Legislative Youth Advisory Council is more than a program it s a movement that puts young people at the center of policymaking in Washington State. If you re passionate about civic engagement, leadership, and creating meaningful change, LYAC is your opportunity to make an impact. Apply now and become a voice for youth in government. Discover more details about these opportunities Here The post Apply to the Legislative Youth Advisory Council (LYAC): Washington’s Official Youth Voice in Government appeared first on Opportunities for Youth .","tags":["education","America","Continent","Internships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T13:17:53Z","updated_at":"2026-02-24T13:17:53Z"}
{"id":"d08a4e5bbbc4e50a50b9973e5f9de6579e80a567","title":"Whitefish Security Summit Young Professionals Program 2026: National Security, AI, Intelligence & Strategic Leadership Immersion in Montana","url":"https://opportunitiesforyouth.org/2026/02/24/whitefish-security-summit-young-professionals-program-2026-national-security-ai-intelligence-strategic-leadership-immersion-in-montana/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T09:43:48Z","summary":"The Whitefish Security Summit Young Professionals Program 2026 is an immersive, multi-day national security and leadership experience designed specifically for ambitious young professionals aged 21 27 who are ready to explore careers in intelligence, defense, technology, geopolitics, and strategic storytelling. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Taking place April 2 4, 2026 in Whitefish, Montana, this high-impact program runs alongside the broader Whitefish Security Summit and provides curated access to keynote speakers, intelligence veterans, defense innovators, AI experts, storytellers, and strategic policy leaders. The event will be hosted at The Lodge at Whitefish Lake and other select venues in Whitefish, Montana. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Program Dates and Location Event Dates: April 2 4, 2026 Arrival: April 1, 2026 (after 4:00 PM) Departure: April 4, 2026 (by 12:00 PM) Location: Whitefish, Montana, USA Primary Venue: The Lodge at Whitefish Lake Whitefish, MT 59937 Additional venues include: Whitefish Performing Arts Center Great Northern Bar Grill Larch House Firebrand Hotel ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); What Is the Young Professionals Program? The Young Professionals Program is a specialized track within the Whitefish Security Summit designed to: Equip young professionals with real-world insight into national security challenges ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Develop strategic communication and storytelling skills Explore AI and emerging technology in defense and governance Foster meaningful cross-sector networking Provide exposure to intelligence and defense leadership This experience blends physical training, keynote lectures, panel discussions, fireside chats, documentary screenings, and interactive sessions. Participants will gain first-hand insight into how intelligence, AI, geopolitics, Hollywood, and digital influence intersect in shaping global security narratives. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Who Should Attend? The program is designed for individuals aged 21 27 who are: Interested in national security, intelligence, or defense Exploring careers in AI, cybersecurity, or tech policy Curious about geopolitical strategy and storytelling Motivated to build networks within strategic sectors Seeking exposure to leaders in intelligence and special operations Official Summit Agenda Overview Day One Thursday, April 2, 2026 Morning Physical Training (6:30 7:45 AM) Participants begin with PT led by Retired Naval Special Warfare Commander Eric Olly Oehlerich. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Key Sessions Include: Welcome Opening Remarks Jeffrey Caruso Character as Strategy: Leadership for America s Critical Frontiers General Stanley McChrystal (US Army, Ret.) From Langley to Cupertino to the Front Lines of Geopolitics Anthony DeMario Wise Women, Hard Targets: Strategy the Future of U.S. Security ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Action Films and the Intersection of U.S. Intelligence J. Mills Goodloe Intelligence, Influence, and Cultural Acuity David Tinsley Reel vs Real: Espionage Entertainment Evening Documentary Screening Q A featuring Michael Mick Mulroy and Eric Olly Oehlerich. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Day Two Friday, April 3, 2026 Morning PT with Eric Olly Oehlerich. Major Sessions Include: SCRIPTED CRISIS: Turning Real-World Threats into Drama Howard Gordon AI Cubed Artificial Intelligence, Artistic Infringement, Anarchist Impact Bianca Goodloe How Power Shapes the Story: Hollywood s Influence Machinery Tatiana Siegel ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Archetypes for AI Security and Governance Benjamin Harvey, Ph.D. Adversarial Attacks Against Autonomous Drones Robi Sen Building a Defense Startup Lance Cottrell CIA DoD Collaboration in Practice Evening documentary screening hosted by Iron Butterfly Media. Day Three Saturday, April 4, 2026 The Lobo Treasure Hunt An interactive experiential activity coordinated by Michael Mick Mulroy and Eric Olly Oehlerich. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Featured Speakers and Experts The summit brings together distinguished leaders from intelligence, military strategy, AI, entertainment, and policy sectors, including: General Stanley McChrystal Former Commander, U.S. Forces Afghanistan Howard Gordon Showrunner Producer Darrell M. Blocker Former CIA Deputy Director, Counterterrorism Center Carmen Medina Former CIA Deputy Director of Intelligence Benjamin Harvey, Ph.D. Former Chief of Data Science/AI, NSA ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Eric Olly Oehlerich Former DEVGRU Commander Michael Mick Mulroy Former CIA Paramilitary Operations Officer Julia Mossbridge, Ph.D. Neuroscientist Futurist Lance Cottrell Venture Capitalist Defense Entrepreneur These leaders represent the convergence of intelligence, technology, media, and policy. Additional Event Details Conference Attire: Business Casual / Professional Accommodations: Whitefish Riverfront Hotel 920 Spokane Avenue Whitefish, MT 59937 Phone: 1.406.862.7600 Transportation: Shuttle service available with 24-hour notice from Glacier Park International Airport (FCA) and Amtrak ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Shuttle service to and from The Lodge at Whitefish Lake Amenities: Complimentary breakfast (6:00 10:00 AM) Why This Program Matters The Whitefish Security Summit Young Professionals Program is not a traditional academic conference. It is a curated immersion into the future of national security, artificial intelligence, strategic storytelling, and cultural influence. ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); Participants will: Learn from former CIA, NSA, and military leaders Explore AI s role in warfare and governance Understand how media shapes global security narratives Build high-level professional connections Experience hands-on activities including PT and interactive sessions This program is designed to prepare young professionals for careers that intersect policy, security, and technology. How to Apply Interested applicants can apply here . Due to the curated nature of the program and limited spots, early application is recommended. ezstandalone.cmd.push(function () { ezstandalone.showAds(139); }); Click here to learn more about the Whitefish Security Summit Young Professionals Program 2026. Discover more global opportunities, grants, fellowships, scholarships, and so on here . The post Whitefish Security Summit Young Professionals Program 2026: National Security, AI, Intelligence Strategic Leadership Immersion in Montana appeared first on Opportunities for Youth .","tags":["education","Conferences","Africa","America","Asia","Australia and Oceania","Continent","Europe","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T13:17:53Z","updated_at":"2026-02-24T13:17:53Z"}
{"id":"f037bbe30c985f37ab8c56b424ae31dc911f3eba","title":"LEO Foundation Dr Abildgaard Fellowships: 5‑Year Grants for Emerging Skin Research Leaders","url":"https://opportunitiesforyouth.org/2026/02/24/skin-science-fellowship/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T09:19:08Z","summary":"The LEO Foundation Dr Abildgaard Fellowships represent one of the most significant funding opportunities for emerging research leaders in skin science. Offered by the LEO Foundation , a major philanthropic supporter of independent skin research, these fellowships provide substantial five year grants to exceptional researchers aiming to establish or expand their own research groups at Danish institutions . ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); Launched to nurture the next generation of scientific talent, the Dr Abildgaard Fellowships are named in honour of Dr. Knud E. Abildgaard , the founder of the LEO Foundation, and reflect the Foundation s long standing commitment to advancing understanding of skin biology, mechanisms of skin diseases, and innovative treatment approaches. What the Fellowships Offer The Dr Abildgaard Fellowships award grants of DKK 12 million per fellowship over a five year period , providing recipients with the stability and flexibility to build independent research programmes and make significant scientific contributions. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); These funds support a wide range of research activities related to skin and skin diseases, including, but not limited to: Establishing or expanding an independent research group at a non profit Danish research institution. Conducting ambitious and creative research that tackles novel or critical scientific questions within dermatology and skin science. Covering personnel costs, equipment, publications, and other research related expenses necessary for long term project success. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The generous funding model gives fellows the freedom to pursue rigorous research while shaping their academic identities and building teams that can contribute to breakthroughs in skin disease mechanisms and treatments. Why This Fellowship Matters The Dr Abildgaard Fellowship represents more than just financial support it is a career defining opportunity that empowers researchers to: ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Lead ground breaking research in skin science and disease. Build and mentor multidisciplinary research teams. Increase Denmark s role as a global hub for dermatological discovery and innovation. Expand scientific knowledge that could lead to better diagnosis, prevention, and treatment of skin diseases that affect millions worldwide. The success of previous fellows whose work has ranged from inflammatory skin disorders to advanced therapeutic research in dermatology demonstrates the transformative impact this funding can have on both science and society. Who Should Apply The programme targets talented, emerging research leaders both Danish and international who have demonstrated research excellence and the potential to become established group leaders in their field. Eligible applicants are those with two to eight years of research experience since earning their doctoral degree, and who are committed to conducting their main research activities at a Danish university, hospital, or nonprofit research institution . ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); While detailed eligibility criteria and requirements are outlined in the official application guide , the core expectation is that candidates must be ready to propose innovative, high impact research in skin biology or disease. The call is open to applicants whose scientific interests span basic, translational, clinical, or interdisciplinary research as long as the work ultimately contributes to a deeper understanding of skin health and disease . Application Process and Deadline The Dr Abildgaard Fellowships are awarded through an annual open competition , with applications submitted via the LEO Foundation s grant portal. Prospective candidates are encouraged to carefully consult the application guide for detailed submission instructions, eligibility criteria, and evaluation procedures before applying. Application Deadline: 19 March 2026 at 16:00 CEST applicants should prepare their proposals well in advance to ensure a complete package that clearly communicates their research vision and leadership potential. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Learn more and apply here . Looking for more opportunities? Check out the Opportunities for Youth website . The post LEO Foundation Dr Abildgaard Fellowships: 5‑Year Grants for Emerging Skin Research Leaders appeared first on Opportunities for Youth .","tags":["education","Europe","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T13:17:53Z","updated_at":"2026-02-24T13:17:53Z"}
{"id":"b811874c1d036ef7b5f34a3d9995b69fdb946973","title":"Join the Max Planck Institute for Demographic Research: Doctoral Student Position in Migration and Mobility","url":"https://opportunitiesforyouth.org/2026/02/24/demographic-research-doctoral/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-24T09:11:42Z","summary":"Are you a highly motivated graduate ready to pursue cutting edge research in demographic science? The Max Planck Institute for Demographic Research (MPIDR) is inviting applications for a Doctoral Student Position in the Lab of Migration and Mobility within the Department of Digital and Computational Demography. ezstandalone.cmd.push(function () { ezstandalone.showAds(119); }); This opportunity is ideal for students with strong quantitative and programming skills, a passion for research, and academic interests in demography, migration studies, computational social science, or science of science . The doctoral student will be part of an international research community and contribute to innovative projects that redefine how demographic research is conducted and understood. About MPIDR and the Role Founded in 1996, the Max Planck Institute for Demographic Research is part of the prestigious Max Planck Society , a global leader in scientific inquiry. The Rostock based institute attracts researchers from around the world and fosters a collaborative environment focused on high impact demographic research spanning fertility, migration, aging, and population dynamics. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The Doctoral Student Position offers a unique opportunity to join the Lab of Migration and Mobility , led by Director Emilio Zagheni , where you will work on projects exploring the movement and mobility patterns of scientists and skilled populations . These investigations use large scale bibliometric data to measure, model, and forecast scientific mobility, offering fresh insights into global migration processes for highly skilled individuals. Research Focus: Scientific Mobility and Migration The core of this doctoral project lies at the intersection of migration science, bibliometrics, and theoretical demography . Through advanced computational and analytical approaches, you will: ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Contribute to ongoing research on scientific mobility and the Scholarly Migration Database . Help design and analyse a survey addressing the aspirations, motivations, and constraints influencing researchers decisions to move or stay. Investigate gender, disciplinary, and geographical differences in global scientific mobility patterns. The outcomes are expected to deepen theoretical understandings of how and why highly skilled individuals migrate or remain in place , with implications for policy, human capital development, and research network dynamics. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Supervision and Academic Environment This doctoral project will be supervised by an interdisciplinary team that includes Aliakbar Akbaritabar (MPIDR and University of Rostock) alongside Emilio Zagheni. Selected candidates are expected to reside in Rostock and enroll in the doctoral program of the Institute of Sociology and Demography at the University of Rostock . The position also offers support for national and international research visits , enabling scientific exchange with broader academic networks and participation in relevant global conferences. A Supportive, Inclusive Research Culture The Max Planck Society and MPIDR are committed to equal opportunities and diversity , valuing people from a wide range of backgrounds, beliefs, and identities. The institute actively encourages applications from underrepresented groups and is dedicated to fostering an environment that supports career growth and work life integration. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); How to Apply Applications must be submitted online via the MPIDR application survey by the deadline and include the following documents compiled into a single PDF : Curriculum Vitae with a list of scholarly publications. Motivational statement (max. two pages) outlining your research interests, fit with the project, and how the MPIDR environment will support your academic goals. Academic transcripts for undergraduate and master s degrees (candidates should hold a master s or equivalent at the start of the program). Contact details for two academic referees . One writing sample (published or unpublished) demonstrating your scholarly contribution. Application Deadline: 15 April 2026, 23:59 CET . The expected start date is flexible, but should be no later than 1 November 2026 . The successful candidate will be offered a three year contract based on the German public sector salary structure, with an approximate starting gross salary of 40,618 per year. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Learn more and apply here . Looking for more opportunities? Check out the Opportunities for Youth website . The post Join the Max Planck Institute for Demographic Research: Doctoral Student Position in Migration and Mobility appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Europe","Jobs","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-24T13:17:53Z","updated_at":"2026-02-24T13:17:53Z"}
