{"id":"e23b55d9bfdeaf203e509eefb764c40dd43a2ade","title":"Apply Now: 2026 Internships at the U.S. Trade and Development Agency (USTDA)","url":"https://opportunitiesforyouth.org/2026/02/27/apply-now-2026-internships-at-the-u-s-trade-and-development-agency-ustda/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T18:13:10Z","summary":"Are you looking to gain hands-on experience in global development, infrastructure, and international partnerships? The U.S. Trade and Development Agency (USTDA) is offering a range of internship opportunities for motivated students and young professionals eager to contribute to impactful projects in emerging markets. USTDA plays a key role as the U.S. government s first mover on critical infrastructure development , helping to advance shared strategic priorities while fostering sustainable economic growth worldwide. Through its internship program, you can work alongside experienced professionals and gain exposure to international development, trade, and policy implementation. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Available Internship Openings 1. Office of Programs Internship Application Period: February 19, 2026 March 20, 2026 Department: Office of Programs Overview: Interns in this office will support USTDA s core project development activities, contributing to initiatives that drive critical infrastructure development in emerging economies. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); 2. Intern, Office of Administration / Human Resources Application Period: February 19, 2026 March 20, 2026 Department: Office of Administration / HR Overview: This role offers experience in organizational operations, talent management, and HR systems that support the agency s global mission and internal workforce development. 3. Intern, Office of the Chief Information Officer Application Period: February 19, 2026 March 20, 2026 Department: Office of the Chief Information Officer (OCIO) Overview: Interns will assist with IT systems, digital infrastructure, and information management, supporting the technological backbone of USTDA s global operations. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Why Apply? An internship with USTDA offers you the chance to: Gain real-world experience in international development and trade Work on projects that support infrastructure growth in emerging markets Develop professional skills in policy, administration, technology, and project management Build a global professional network within a U.S. government agency Contribute to meaningful initiatives that drive economic development and sustainability Application Deadline All internship applications close on March 20, 2026 . Early applications are strongly encouraged. To apply to any of the internship opportunities, Visit Here Take the Next Step If you are passionate about global development, infrastructure, and international collaboration, these internships at the U.S. Trade and Development Agency provide a valuable platform to launch your career. Prepare your application materials early, tailor your resume to the role you re applying for, and highlight your interest in international development and infrastructure. Start your journey toward a global career today. Discover more Internship opportunities Here. The post Apply Now: 2026 Internships at the U.S. Trade and Development Agency (USTDA) appeared first on Opportunities for Youth .","tags":["education","Continent","America","Internships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T18:52:28Z","updated_at":"2026-02-27T18:52:28Z"}
{"id":"c6909c021f2beac01ad545a8645a9b01f1787d0d","title":"European Ombudsman Traineeships 2026: Paid EU Governance Opportunity for Graduates","url":"https://opportunitiesforyouth.org/2026/02/27/european-ombudsman-traineeships-2026-paid-eu-governance-opportunity-for-graduates/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T18:10:03Z","summary":"If you re an ambitious university graduate or a student in your final year seeking world-class professional experience in European governance, transparency, public administration, or EU affairs this is one of the most sought-after opportunities within EU institutions for career-minded individuals wanting to work at the heart of EU democratic accountability and public service. Hosting Institution European Ombudsman Overview: What Is the European Ombudsman Traineeship? Digital communication Case-handling Traineeship for persons with disabilities Candidates should be nationals of a Member State of the European Union No previous paid traineeship or work contract in a European institution Bachelors degree as minimum, solid training on EU law ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Deadline: 13 and 31 March Location: Brussels or Strasbourg Compensation: approx. 1400/m The European Ombudsman Traineeship Programme is a paid, full-time, one-year internship designed for recent university graduates who want hands-on experience inside a core European Union institution. The programme offers a unique opportunity to work directly on issues related to EU administration, transparency, accountability, citizens rights, and good governance. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Trainees are placed in either Brussels or Strasbourg, depending on the needs of the Office, and work under the direct supervision of senior EU officials, usually a Head of Unit or equivalent. The traineeship combines professional responsibility, structured supervision, mentoring, and exposure to the daily functioning of EU institutions. This programme is particularly attractive for candidates interested in: EU law and policy Public administration Human rights and accountability European governance and institutional relations Transparency and citizens complaints mechanisms Aim of the Traineeship The traineeship is intended to: Provide practical, real-world experience within an EU institution Allow trainees to build on academic knowledge through professional tasks Develop skills in policy analysis, administration, communication, and institutional work Promote understanding of how EU institutions interact with citizens Each trainee works under: A line manager who defines objectives A mentor who supports daily integration and work A structured evaluation system (mid-term and final assessment) Duration of the Traineeship Standard duration: 12 months (1 year) Extension: Not possible Exceptional cases: Shorter traineeships may be offered in the interest of the service Start date is typically 1 September each year. Who Can Apply? (Eligibility Criteria) 1. Nationality Applicants must be: Nationals of an EU Member State, OR Nationals of an EU accession or candidate country Eligible regions: Europe (EU + EU candidate/accession countries) 2. Educational Qualifications Applicants must: Hold a minimum 3-year university degree (Bachelor s level or equivalent) Degree must be in a discipline specified in the relevant traineeship call Fields commonly accepted include (depending on the call): Law Political Science European Studies International Relations Public Administration Social Sciences Communication and related disciplines 3. Language Requirements Applicants must have: Thorough knowledge of one EU official language, and Very good knowledge of another EU official language English is mandatory, as it is the main working language of the European Ombudsman. 4. Prior EU Experience Restrictions Applicants must NOT have: Completed more than 8 consecutive weeks (or 2 months) of paid traineeship in any EU institution ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Held any paid employment (temporary, contract, auxiliary, interim agent, SNE, MEP assistant, etc.) in an EU institution This rule ensures fair access for first-time EU trainees. Special Programme: Traineeships for Persons with Disabilities The European Ombudsman runs a dedicated positive-action traineeship programme for candidates with disabilities. Key Features Separate annual call (usually February) Candidates may apply simultaneously to general traineeships if eligible Open to: University graduates, or Students in at least their third year of higher education Additional Support Reasonable accommodation at the workplace Additional financial support of up to 50% of the monthly grant to cover disability-related costs Disability-related income does not reduce the traineeship grant Applicants must provide official proof of disability in an EU official language. Selection Procedure Application Timeline Call published: Normally February Start date: 1 September Final results communicated: By 30th June Required Application Documents All applications must be submitted via the online application system and include: Completed online application form CV in English Copies of diplomas/degrees (no certification or translation required) One-page motivation letter in English (required for some profiles) Incomplete applications are automatically rejected. Selection Stages Eligibility and profile screening Written test (if applicable) Interview (video call or phone) Selection is merit-based, with attention to: Qualifications Skills Motivation When candidates are equally qualified, the Office promotes: Geographical balance Gender equality Inclusion of persons with disabilities Financial Benefits and Allowances Monthly Grant Equivalent to 25% of the basic salary of an AD6 Step 1 EU official Adjusted by: Country weighting (Brussels or Strasbourg) Household allowance (if applicable) The grant may be: Reduced if the trainee receives other financial support Adjusted due to salary indexation Additional Financial Support Case-by-case lump-sum assistance may be granted Extra disability-related costs covered up to 50% of the monthly grant Travel Cost Reimbursement The Ombudsman reimburses travel costs at the beginning and end of the traineeship if not covered elsewhere. Covered Travel Modes Second-class train Bus or car-sharing Economy-class flight (for journeys over 500 km or sea crossings) Private car (kilometric allowance) Tickets are usually booked by the Office Up to 50 kg of luggage may be reimbursed (with approval) ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Insurance Coverage Full sickness and accident insurance provided Optional insurance for: Spouse Children (at the trainee s expense) Leave and Working Conditions 2 working days of leave per month No cash compensation for unused leave Sick leave: Medical certificate required after 3 days Hybrid work rules apply Strict confidentiality and ethics obligations Supervision, Mentoring, and Evaluation Initial objective-setting meeting Mid-term performance review (6 months) Final evaluation meeting Dedicated mentor throughout the traineeship Exit interview with Human Resources Termination or Suspension Either party may terminate the traineeship One-month notice required for voluntary resignation Grant payments stop during suspension Due process applies in case of early termination Legal Status of Trainees Trainees are not EU officials or staff members No automatic employment rights after completion Data Protection All personal data is processed under Regulation (EU) 2018/1725, ensuring high standards of privacy and data protection. How to Apply Applications must be submitted online via the official European Ombudsman website once the call is published (normally in February). Important: Applicants may reapply in future years if unsuccessful. Apply here Key Deadlines (Typical Cycle) Call opens: February Application deadline: 13 and 31 March Interviews/tests: Spring Final decisions: By 30 June Traineeship starts: 1 September Why This Traineeship Is Highly Valuable Paid, long-term EU institutional experience Direct exposure to EU governance and citizens rights Strong CV value for EU careers, NGOs, public policy, and law Inclusive programme with strong disability support Work in Brussels or Strasbourg, the heart of Europe The European Ombudsman Traineeship is more than just an internship it s a gateway to public service, advancing democratic accountability and citizen rights within the EU. You ll gain practical EU-level work experience, expand your professional network, and earn credentials that can propel careers in governance, policy, law, human rights, and international relations. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); For more information visit here For more global opportunities click here The post European Ombudsman Traineeships 2026: Paid EU Governance Opportunity for Graduates appeared first on Opportunities for Youth .","tags":["education","Europe","Internships","Jobs"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T18:52:28Z","updated_at":"2026-02-27T18:52:28Z"}
{"id":"302e78c59a8f8ccdc1d744aa83eeefd455b13a57","title":"UNOY Internship 2025: Partnerships Officer Opportunity in the Netherlands","url":"https://opportunitiesforyouth.org/2026/02/27/unoy-internship-2025/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T18:05:23Z","summary":"The UNOY Internship 2025 is now open for applications for the Partnerships Officer position at UNOY Peacebuilders in The Hague, Netherlands. This UNOY Internship offers young professionals a valuable opportunity to gain hands-on experience in peacebuilding, fundraising, and partnership development within an international youth-led organization. Applications for the UNOY Internship close on 9 March 2025 at 23:59 CET, and selected candidates will participate in a six-month internship beginning on 28 April 2025. About the UNOY Internship Program The UNOY Internship at UNOY Peacebuilders provides young professionals with practical experience in the field of international peacebuilding and development. UNOY Peacebuilders is a global youth-led network consisting of more than 100 youth organizations across over 70 countries working together to promote peace, inclusion, and youth participation. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Through the UNOY Internship, interns join a dynamic international team and contribute to real projects that support youth-led peacebuilding initiatives worldwide. Interns work alongside experienced professionals while building skills in fundraising, partnerships, research, communications, and project coordination. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The UNOY Internship allows participants to expand their professional networks and gain experience within the international development and peacebuilding sectors. UNOY Internship Responsibilities During the UNOY Internship, the selected Partnerships Officer intern will work closely with the Partnership Coordinator and other team members to support various fundraising and partnership initiatives. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Fundraising and Partnership Development One key component of the UNOY Internship is supporting the organization s fundraising strategy and building relationships with partners and donors. Intern responsibilities include: Supporting the implementation of UNOY s fundraising strategy Researching potential donors and funding opportunities Identifying funding priorities and entry points for new partnerships Assisting in drafting concept notes and grant proposals Supporting relationship management with donors and partner organizations Contributing to reporting and grant management processes These activities provide interns with valuable experience in proposal writing and partnership management within the nonprofit sector. Financial Support to UNOY Members Another important component of the UNOY Internship involves supporting the Financial Support to UNOY Members (FSUM) program. This initiative provides small grants to youth-led organizations within the UNOY network. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Intern responsibilities within this program include: Supporting the management and implementation of the FSUM program Assisting with grant monitoring and reporting processes Preparing fundraising alerts highlighting funding opportunities for UNOY members Supporting monitoring, evaluation, and learning activities Through this work, interns gain insight into grant management and youth funding programs. Communications and Administrative Support The UNOY Internship also includes communications and administrative responsibilities that support the organization s partnership and program activities. Intern tasks may include: Producing and editing content for UNOY s website and social media channels Supporting communications related to partnership initiatives Assisting with planning major meetings such as the Annual Regional Coordinators and International Steering Group meeting Providing general office support where necessary These activities help interns develop strong communication and project coordination skills. Benefits of the UNOY Internship The UNOY Internship provides a range of benefits that support both professional development and practical experience in international development. Benefits include: A monthly stipend of 500 EUR Travel reimbursement for commuting to the office Hybrid work with the possibility of working remotely two days per week Opportunities to gain experience in international development and peacebuilding Access to mentorship and supervision from experienced professionals Networking opportunities with organizations and partners across the world The UNOY Internship also serves as a stepping stone for future careers in international organizations, government institutions, academia, and nonprofit development sectors. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Eligibility for the UNOY Internship To apply for the UNOY Internship, candidates must meet several requirements related to education, location, and experience. Applicants should have: A degree in peace and conflict studies, international relations, or a related field Strong interest in peacebuilding and youth leadership Excellent English speaking and writing skills Experience with data management tools and spreadsheets Strong project management and organizational skills Ability to work independently and within multicultural teams Knowledge of additional languages such as French, Arabic, Spanish, or Dutch is considered an advantage. Applicants must also meet legal requirements for working in the Netherlands, including being a resident of the Netherlands or a citizen of the European Union. Location and Working Conditions The UNOY Internship is based in The Hague, Netherlands, a global hub for international organizations and peace institutions. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); The internship includes: A six-month duration A four-day work week (Monday to Thursday) totaling 32 hours per week Hybrid working arrangements with two remote workdays per week Interns must also have access to a personal computer and secure internet connection. How to Apply for the UNOY Internship Candidates interested in the UNOY Internship must apply through the official online application form provided by UNOY. Applicants will be required to submit: A CV Answers to several short questions about their motivation and skills (maximum 250 words each) Applicants experiencing technical issues with the application form may contact the UNOY team directly via email. APPLY HERE Deadline The UNOY Internship application deadline is March 9, 2025 at 23:59 CET. Because applications are reviewed on a rolling basis, candidates are encouraged to apply as early as possible. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Final Note The UNOY Internship offers a valuable opportunity for young professionals interested in peacebuilding, international development, and youth leadership to gain real-world experience in a global organization. By participating in this internship, candidates can develop critical skills, contribute to meaningful peace initiatives, and build networks across the international development community. For more global fellowships, internships, scholarships, and leadership programs, click here . The post UNOY Internship 2025: Partnerships Officer Opportunity in the Netherlands appeared first on Opportunities for Youth .","tags":["education","Internships","Europe"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T18:52:28Z","updated_at":"2026-02-27T18:52:28Z"}
{"id":"3cb3bdb0b2c5cc4746d54cfa086c89da237a3153","title":"Harper Fellowship 2026–2027 at The 19th for Emerging Journalists","url":"https://opportunitiesforyouth.org/2026/02/27/harper-fellowship-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T17:45:22Z","summary":"The Harper Fellowship 2026 2027 at The 19th is now accepting applications from emerging journalists interested in developing their careers in reporting, audience engagement, news product development, and nonprofit media leadership. The Harper Fellowship application deadline is March 20, 2026 at 5:00 p.m. PST, and the program offers a year-long salaried fellowship with full benefits and extensive professional development opportunities. About the Harper Fellowship Program The Harper Fellowship at The 19th is a prestigious journalism fellowship named after Frances Ellen Watkins Harper, widely recognized as the mother of African-American journalism. The program was launched in 2022 to create meaningful opportunities for graduates and alumni connected to Historically Black Colleges and Universities (HBCUs) to gain experience in nonprofit journalism. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Through the Harper Fellowship program, selected fellows spend a full year working with The 19th s editorial, product, audience engagement, and development teams. Fellows are embedded in their respective departments and contribute to meaningful journalism projects while gaining hands-on newsroom experience. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The Harper Fellowship focuses on strengthening diversity in journalism while providing fellows with mentorship, professional training, and career guidance that supports their long-term success in the media industry. Harper Fellowship Tracks and Learning Areas The Harper Fellowship program includes several fellowship tracks that allow participants to specialize in different areas of journalism and media operations. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); The fellowship tracks include: Reporting Audience engagement News product Development (new track) Reporting Track Fellows in the reporting track gain experience covering stories through in-depth reporting and investigative work. Participants work closely with editors and journalists to produce original reporting that focuses on the intersection of gender, politics, and policy. Reporting fellows are encouraged to develop their own story ideas, collaborate with newsroom teams, and experiment with storytelling across digital platforms. Audience Engagement Track The audience engagement track focuses on helping fellows develop skills in digital storytelling and audience-centered journalism. Participants learn how to distribute journalism across multiple platforms such as websites, social media, newsletters, and search engines. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); This track also involves creating engaging social media content and collaborating with editorial and creative teams to produce compelling headlines, visuals, and storytelling formats. News Product Track The Harper Fellowship news product track introduces fellows to product design and innovation in journalism. Participants learn how to develop features and digital tools that improve audience experience and support newsroom goals. Fellows work with product and technology teams to test ideas, analyze user feedback, and contribute to the development of journalism products such as newsletters, digital platforms, and audience engagement tools. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Development Track The newly introduced Harper Fellowship development track focuses on the business and fundraising side of nonprofit journalism. Fellows gain hands-on experience in donor engagement, membership campaigns, and fundraising strategy. Participants also learn how nonprofit news organizations sustain independent journalism through diversified revenue models and community support. Benefits of the Harper Fellowship The Harper Fellowship provides a comprehensive support system designed to help fellows build long-term careers in journalism. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Key benefits include: A full-time salaried fellowship with benefits One year of mentorship and professional development Career coaching and job placement support Networking opportunities with media professionals Membership in the National Association of Black Journalists Attendance at the NABJ convention and career fair Access to journalism training workshops and seminars A professional development stipend A work-from-home stipend and wellness stipend An Apple MacBook laptop provided for the fellowship year These resources ensure fellows receive both financial and professional support throughout the program. Harper Fellowship Professional Development A major component of the Harper Fellowship program is its strong emphasis on professional growth. Fellows participate in training workshops and development sessions covering topics such as: Networking and career advancement Salary negotiation Resume and portfolio building Mental health and burnout prevention Financial literacy Media industry insights from experienced journalists The program also includes career coaching and mentorship to help fellows transition successfully into long-term journalism careers after completing the fellowship. Harper Fellowship Retreats and Networking The Harper Fellowship experience includes several retreats and networking events designed to connect fellows with media professionals and industry leaders. The fellowship year begins with an opening retreat that introduces new fellows to the program and provides opportunities to connect with previous fellowship cohorts. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Midway through the fellowship, participants attend a career development retreat focused on networking and preparing for future opportunities in journalism. Fellows also attend an annual staff retreat with The 19th team, allowing them to engage in strategic discussions, professional learning sessions, and collaborative activities. These events help fellows build meaningful professional relationships and expand their journalism networks. How to Apply for the Harper Fellowship Applicants interested in the Harper Fellowship 2026 2027 must submit an application through The 19th s official application platform. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); The application typically requires: A cover letter explaining interest in the fellowship and career goals A resume outlining relevant experience Work samples demonstrating journalism or related skills Applicants should clearly describe how the Harper Fellowship aligns with their career aspirations and how they plan to contribute to public-service journalism. APPLY HERE Deadline Applications for the Harper Fellowship 2026 2027 must be submitted before the official deadline. Application Deadline: March 20, 2026 (5:00 p.m. PST) Applicants are encouraged to submit their materials early to avoid last-minute technical issues. Final Note The Harper Fellowship offers a unique opportunity for emerging journalists to gain hands-on newsroom experience while working alongside experienced media professionals. Through mentorship, professional training, and networking opportunities, the program equips fellows with the tools they need to build impactful careers in journalism. For individuals passionate about storytelling, public-service journalism, and media innovation, the Harper Fellowship can serve as a powerful launchpad for a long-term career in the industry. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); For more fellowships, scholarships, internships, and leadership programs, click here . The post Harper Fellowship 2026–2027 at The 19th for Emerging Journalists appeared first on Opportunities for Youth .","tags":["education","America","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T18:52:28Z","updated_at":"2026-02-27T18:52:28Z"}
{"id":"44b3e179b1056a1f156b3b08127fb44b3d4d876a","title":"World Heritage Young Professionals Forum 2026 (Fully Funded) — Call for Applications in South Korea","url":"https://opportunitiesforyouth.org/2026/02/27/world-heritage-young-professionals-forum-2025/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T15:54:21Z","summary":"Overview Applications are now open for the World Heritage Young Professionals Forum 2026 , a fully funded international programme organized within the framework of the UNESCO World Heritage Education Programme . Hosted by the Republic of Korea through the Korea Heritage Service (KHS) and the Korean National Commission for UNESCO (KNCU), the forum will take place from 13 21 July 2026 alongside the 48th Session of the World Heritage Committee . ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Under the theme World Heritage, Communities and Education: Empowering Youth as Agents of Change, the programme will bring together 30 young professionals from around the world to strengthen their knowledge, skills, and engagement in the protection and management of natural and cultural World Heritage sites. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Forum Theme and Objectives The 2026 forum focuses on the relationship between World Heritage, communities, and education, with the goal of empowering youth to play an active role in heritage conservation and governance. Key objectives include: Strengthening the commitment and professional capacity of young practitioners working in heritage-related fields Exploring how community participation can improve conservation and management practices Examining the role of education, research, and learning in informed decision-making Promoting youth leadership and inclusive governance in World Heritage protection Through exchanges with local and international experts, participants will engage in collaborative learning and develop practical perspectives on sustainable heritage management. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Programme Structure The forum combines academic discussions with practical, site-based learning experiences at World Heritage properties in the Republic of Korea. Activities include: Thematic presentations and expert-led discussions Collaborative workshops and group work Site visits and field-based learning Peer exchange with international participants Joint session with the World Heritage Site Managers Forum At the conclusion of the programme, participants will collectively prepare and present a Youth Declaration to the 48th Session of the World Heritage Committee. Provisional Schedule 12 July 2026: Arrival of participants 13 July 2026: Opening of the forum and introductions 14 19 July 2026: Thematic sessions, workshops, and site-based learning 18 July 2026: Joint session with the World Heritage Site Managers Forum 19 July 2026: Drafting of the Youth Declaration 20 July 2026: Finalisation and presentation of the Youth Declaration 21 July 2026: Closing session and departure Eligibility Criteria Applicants must meet the following requirements: Age Between 23 and 32 years old (born between 1994 and 2003 inclusive) Professional Profile Applicants should be young professionals or practitioners engaged in one or more of the following areas: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Education and teaching in formal learning settings World Heritage site management Research and innovation related to World Heritage NGOs or community-level associations focused on heritage Additional Requirements Demonstrated involvement in World Heritage-related activities Strong motivation to contribute to discussions on youth, communities, and education Full availability for the entire duration of the forum Proficiency in English (the working language of the programme) Selection Considerations The selection process aims to ensure: Balanced geographical representation Gender equality Diversity of professional backgrounds Potential for knowledge-sharing and impact after the forum Funding and Benefits The World Heritage Young Professionals Forum 2026 is fully funded. Selected participants will receive: International economy-class travel Accommodation Local transportation Meals during the programme Visa support and related fees where applicable Participants wishing to extend their stay after the programme must cover additional expenses independently. Application Process Interested candidates must apply through the official online application form: Application Link: https://unesco-2023.limesurvey.net/662537 Application Deadline: 15 March 2026 (23:59 CET) Important notes: Only complete applications submitted through the online form will be considered Selection is based solely on the information provided in the application Recommendations or endorsements are not required Selected applicants will be notified via email. Contact Information For questions regarding the application process: Email: For any questions, kindly contact: wh-ypf@unesco.org Why You Should Apply The World Heritage Young Professionals Forum is a flagship initiative of UNESCO s World Heritage Education Programme. It offers young professionals a unique opportunity to: Build international networks with peers and experts Gain practical experience through site-based learning Deepen understanding of the World Heritage Convention Contribute directly to global discussions on heritage conservation Strengthen leadership skills in community-based and sustainable heritage management For professionals working at the intersection of heritage, education, and community engagement, the forum provides both international exposure and long-term professional value. Call for Applications Selection of participants will be carried out solely on the basis of the online applications, in accordance with the criteria specified in the Call for Applications. Recommendations, nominations, or endorsements will therefore not be considered. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Online application Applications must be submitted through the online application form by 15 March 2026 at 23:59 CET Application Link: https://unesco-2023.limesurvey.net/662537 For any questions, kindly contact: wh-ypf@unesco.org For more info please visit: https://whc.unesco.org/en/news/2862/ The post World Heritage Young Professionals Forum 2026 (Fully Funded) — Call for Applications in South Korea appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Conferences","Continent","Europe","Fellowship","Latin America and the Caribbean","Middle East and North Africa","Short Courses","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T18:52:28Z","updated_at":"2026-02-27T18:52:28Z"}
{"id":"04b528e72295f24630ebb4fceafaa6f947b77246","title":"MENA Scholars Fellowship 2026: Fully Funded Two-Year Research Fellowship for Early-Career Economists and Policy Researchers","url":"https://opportunitiesforyouth.org/2026/02/27/mena-scholars-fellowship-2026-fully-funded-two-year-research-fellowship-for-early-career-economists-and-policy-researchers/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T15:28:40Z","summary":"The third cohort of the MENA Scholars Fellowship (MSF) is now open for applications, offering a unique opportunity for early-career economists and researchers from the Middle East and North Africa to gain hands-on experience in rigorous impact evaluation and policy-relevant research. Launched by J-PAL Middle East and North Africa in partnership with Egypt Impact Lab , the fellowship is a prestigious two-year program designed to strengthen local research capacity and deepen evidence-based policymaking across the MENA region. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); About the MENA Scholars Fellowship The MENA Scholars Fellowship creates a structured pathway for researchers to design, implement, and contribute to randomized evaluations addressing poverty reduction and social development challenges. Fellows work closely with J-PAL-affiliated researchers, receive tailored mentorship, and participate in advanced training that blends academic rigor with real-world policy impact. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Each selected fellow receives a USD 15,000 stipend over the two-year period to support active participation in fellowship activities. What Fellows Will Gain Over the course of the fellowship, scholars will benefit from a comprehensive program that includes: Hands-on randomized evaluations alongside J-PAL affiliates, J-PAL MENA staff, and implementing partners One-on-one mentorship from senior researchers and scientific directors Access to regional and global research networks , including other Scholars Fellowship cohorts worldwide Advanced training , including completion of two MIT MicroMasters online courses focused on impact evaluation and econometric analysis ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Capacity-building workshops on proposal writing, technical research skills, and professional development Media and policy engagement support to amplify research findings Participation in regional policy events and presentations with leading academics An independent evaluation design project in the second year, guided by expert mentors Information Webinar To help prospective applicants better understand the fellowship, an information webinar will be held on Thursday, March 05, 2026, from 11:00 am to 12:00 pm Cairo local time . The session will cover eligibility requirements, the application process, and insights from previous fellows. Interested candidates can register via the official webinar registration form. After registration, participants will receive a Google Calendar invitation with the webinar link and event details. Application Timeline Application deadline: March 26, 2026 , at 11:59 pm Cairo Local Time Shortlisting notification: Mid-April 2026 Final interviews: Mid-May 2026 Fellowship start date: By June 2026 APPLY HERE. For more information about this apportunity, click here . Discover more fellowship opportunities here . Applicants must submit an online application form along with a resume and a motivation-focused cover letter. Shortlisted candidates will advance to a second application phase, which includes additional written questions and a short recorded video. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Funding and Institutional Support The fellowship is supported by Community Jameel and the Sawiris Foundation for Social Development , reinforcing a shared commitment to strengthening evidence-based policy research in the MENA region. For complete fellowship details, eligibility criteria, and access to the application form, applicants are encouraged to visit the official MENA Scholars Fellowship webpage. The post MENA Scholars Fellowship 2026: Fully Funded Two-Year Research Fellowship for Early-Career Economists and Policy Researchers appeared first on Opportunities for Youth .","tags":["education","Fellowship","Africa","Continent","Middle East and North Africa"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T18:52:28Z","updated_at":"2026-02-27T18:52:28Z"}
{"id":"d0b4a0e66a29ee0d90afcb35b5f0f3052eef148c","title":"Sounddelivery Media Spokesperson Leadership Programme: Free 7-Month Training for Grassroots Leaders","url":"https://opportunitiesforyouth.org/2026/02/27/sounddelivery-media-spokesperson-leadership-programme-free-7-month-training-for-grassroots-leaders/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T14:29:16Z","summary":"Applications are now open for the Spokesperson Leadership Programme by Sounddelivery Media . The charity is seeking 14 grassroots leaders with lived experience of social injustice to take part in a fully funded, seven-month leadership and media development programme. About the Programme The Spokesperson Leadership Programme is designed to empower leaders directly affected by social injustice to confidently share their lived experiences and influence public conversations. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Over seven months, selected participants will receive structured support to strengthen their leadership voice and media presence. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); What Participants Receive Professional training One-to-one mentoring Peer support network Media engagement opportunities Skills to influence public debate and drive change The programme focuses on equipping leaders with practical communication tools to engage media platforms and decision-makers effectively. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Who They re Looking For Grassroots leaders Individuals with lived experience of social injustice People committed to creating positive social change Those ready to engage with media and public platforms The programme is free of charge. Key Date to Remember Application Deadline: Friday 20th March, 12pm As spaces are limited to 14 participants, early application is strongly encouraged. APPLY HERE FOR MORE OFY opportunites, click here. The post Sounddelivery Media Spokesperson Leadership Programme: Free 7-Month Training for Grassroots Leaders appeared first on Opportunities for Youth .","tags":["education","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T18:52:28Z","updated_at":"2026-02-27T18:52:28Z"}
{"id":"298212eae83ac467b06f7f25c17ad8d10eb472b3","title":"Headstream Accelerator 2026 : $30,000 Non-Dilutive Funding for Digital Youth Mental Health Startups in the U.S.","url":"https://opportunitiesforyouth.org/2026/02/27/headstream-accelerator-2026-30000-non-dilutive-funding-for-digital-youth-mental-health-startups-in-the-u-s/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T13:38:55Z","summary":"Transforming Teen Mental Well-Being Through Technology and Youth Co-Creation The Headstream Accelerator 2026 (Cohort VI) is a four-month, virtual-first startup accelerator designed to help early-stage entrepreneurs scale digital solutions that improve the mental well-being of teens at risk. Focused on the education and healthcare sectors, the program provides funding, coaching, expert mentorship, and direct youth input to ensure solutions are culturally relevant, age-appropriate, and impactful. Headstream supports founders from all backgrounds who are building tech-enabled products that address critical youth mental health challenges across the United States. The accelerator is particularly committed to supporting innovations that reach historically excluded communities and embed youth voices throughout product development. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); If you are developing a digital solution aimed at youth mental well-being and are ready to refine your business model, strengthen your growth strategy, and expand your impact, this program offers both financial support and structured guidance to help you scale responsibly and sustainably. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Program Overview: What Makes the Headstream Accelerator Unique The Headstream Accelerator is not just about funding it is about building resilient, impact-driven companies that can sustainably serve youth mental health needs. The four-month program includes: Virtual cohort-based learning experiences Access to expert advisors and investors Youth co-creation sessions Personalized one-on-one and group coaching A required in-person kickoff event Structured growth planning and scaling support The accelerator runs from July through November 2026 , beginning with a virtual program start in early July and concluding in early November. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); $30,000 Non-Dilutive Stipend and Additional Benefits Selected participants will receive: $30,000 Non-Dilutive Stipend This funding does not require equity, allowing founders to grow their ventures without giving up ownership. The stipend is provided at the end of the 16-week program. Youth Co-Creation Partnership Participants collaborate directly with youth from Headstream s Youth Co-Creator Club. This ensures that products: Reflect cultural relevance Address real youth needs Are age-appropriate Provide an engaging user experience This youth-centered approach strengthens product-market fit and long-term sustainability. Access to Advisors and Investors Founders gain access to: A network of expert advisors A community of fellow founders Potential investors and capital providers Coaching with FounderWell Participants receive one-on-one and group coaching sessions through Headstream s partner, FounderWell, to refine leadership skills, operational strategy, and business sustainability. Participant Expectations Entrepreneurs selected for Cohort VI are expected to: Attend all required virtual cohort sessions Participate in youth co-creation workshops Join advisor calls and office hours Attend the in-person kickoff event from July 28 30, 2026 Commit approximately 2 5 hours per week during the program Embed youth voices into product development This structure ensures accountability, engagement, and measurable progress. Who Should Apply? The Headstream Accelerator supports early-stage digital solutions focused on youth mental well-being, particularly those serving historically excluded communities. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); You are encouraged to apply if you: Have a working prototype Are preparing for launch Are ready to scale Operate within or adjacent to education or healthcare Are building a tech-enabled solution Important: Idea-stage submissions without a functional prototype are not eligible. Eligible applicant types include: Startups Social enterprises Research institutions Non-profits For-profit ventures While non-profits are eligible, all applicants must demonstrate a sustainable funding model. Selection Criteria Applicants must demonstrate: Clear impact on youth mental well-being A focus on U.S.-based youth, particularly ages 13 19 (pre-teen and college-aged solutions are also eligible) A functional prototype A sustainable funding model A clear growth strategy Commitment to inclusivity U.S. market focus (international applicants must have a U.S. presence) Full Timeline for Headstream Accelerator 2026 Applications Open: January 15, 2026 Application Deadline: March 15, 2026 Interviews: May 22 June 4, 2026 Cohort Notification: Week of June 15, 2026 Virtual Program Start: Week of July 6, 2026 In-Person Kickoff: July 28 30, 2026 Program End: Week of November 2, 2026 Applicants may edit submissions until the application deadline. All submissions become final once the deadline passes. Virtual Info Sessions Interested founders can join a virtual information session: January 21 at 1 pm PST February 11 at 1 pm PST March 11 at 1 pm PST Registration links are available through the official Headstream Accelerator webpage. Frequently Asked Questions Do I need to generate revenue? No, but you must have a functional prototype, a sustainable funding model, and a growth plan. Are non-profits eligible? Yes, provided they demonstrate financial sustainability. Can solo founders apply? Yes. Having collaborators or contractors is encouraged but not required. When is the stipend provided? At the end of the 16-week program. What happens after applying? Applicants will be notified during the week of June 15, 2026. Selected candidates will be invited for interviews. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Why This Accelerator Matters in 2026 Youth mental health continues to be one of the most urgent public health challenges in the United States. Digital solutions have the power to scale support, increase accessibility, and reduce stigma especially for teens in historically underserved communities. The Headstream Accelerator provides funding, mentorship, and youth-driven validation to ensure that emerging innovations are both effective and sustainable. If you are building a digital solution for teen mental well-being and are ready to scale your impact in the U.S. market, this accelerator offers a structured pathway to growth. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Application Deadline: March 15, 2026 For more information click here Apply here Discover more opportunities here The post Headstream Accelerator 2026 : $30,000 Non-Dilutive Funding for Digital Youth Mental Health Startups in the U.S. appeared first on Opportunities for Youth .","tags":["education","America","Grants"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T18:52:28Z","updated_at":"2026-02-27T18:52:28Z"}
{"id":"486f9ecba8717390b8b05bee8f04cc42dda3a1aa","title":"Canary Impact 2026 Leadership Opportunities: $10,000 Awards for Justice-Involved Leaders Through the 10-for-10 Program and NextWave Leadership Program (U.S.)","url":"https://opportunitiesforyouth.org/2026/02/27/canary-impact-2026-leadership-opportunities-10000-awards-for-justice-involved-leaders-through-the-10-for-10-program-and-nextwave-leadership-program-u-s/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T13:33:45Z","summary":"Canary Impact is advancing justice reform across the United States through two transformative leadership initiatives: the 10-for-10 Program and the NextWave Leadership Program. Both programs are designed to invest directly in justice-involved leaders who are committed to dismantling systemic inequities in the criminal legal system. Through catalytic $10,000 financial awards, mentorship, structured leadership development, and access to a powerful national network, Canary Impact supports individuals with lived experience of incarceration to transform their ideas into systemic change. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); If you are a justice-involved leader in the United States with an innovative idea for reform, these programs provide a platform, community, and financial support to accelerate your impact. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); 1. The 10-for-10 Program: Catalyzing Systemic Change Through Lived Experience Overview of the 10-for-10 Program The 10-for-10 Program is Canary Impact s flagship initiative designed to uplift justice-involved leaders of all ages. The program is rooted in the belief that those directly impacted by the criminal legal system possess critical expertise and vision needed to dismantle systemic inequities nationwide. By providing financial awards, mentorship, strategic support, and a collaborative peer network, the 10-for-10 Program creates pathways for participants to channel lived experience into actionable solutions that transform communities. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); The program focuses on long-term systemic change rather than short-term interventions. It is structured as a leadership journey that builds confidence, expands networks, and strengthens reform strategies. What Sets 10-for-10 Apart? Betting on Success Canary Impact invests directly in people with lived experience, recognizing that their leadership is essential to building equitable systems. A National Platform Participants become part of a nationwide community of justice reform visionaries working on issues such as: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); LGBTQIA+ advocacy Disability rights Reentry initiatives Sentencing reform Decarceration efforts Community-based justice solutions Driving Long-Term Impact By supporting experimentation and bold ideas, the program fosters ripple effects that extend throughout the United States. Program Benefits $10,000 Catalytic Investment Each selected participant receives a $10,000 financial award to advance their leadership journey and implement transformative initiatives. Collaborative Network Participants join a national community of justice-involved leaders committed to reform and shared learning. Cohort-Based Learning A supportive peer network encourages collaboration, collective action, and knowledge exchange. Tailored Leadership Support Participants receive mentorship and strategic guidance from Canary Impact s nationally recognized coaches and alumni. Eligibility Criteria for 10-for-10 Applicants must: Have a history of incarceration Reside in the United States Focus their work within U.S. communities Have an innovative idea that leads to systemic change Propose work that does not involve lobbying Not have previously received the 10-for-10 Prize Click HERE to learn more and apply for the 10-for-10 Program. 2. NextWave Leadership Program: Empowering Justice-Involved Youth (Ages 18 25) Overview of the NextWave Leadership Program The NextWave Leadership Program is Canary Impact s youth-focused initiative designed for justice-involved leaders aged 18 25. Recognizing that young people are disproportionately impacted by the criminal legal system, NextWave provides tailored mentorship, financial investment, leadership development, and community support to empower youth as change-makers. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); NextWave is structured as a launchpad for emerging leaders to challenge systemic inequities and build long-term advocacy careers. What Makes NextWave Unique? Targeted Youth Support The program addresses challenges specific to young justice-involved individuals, including: Reentry barriers Generational trauma Structural inequities Investing in People, Not Just Projects The program prioritizes personal leadership development alongside project implementation. Catalyzing Systemic Change By supporting youth leaders, NextWave strengthens the movement toward decarceration and justice reform. Program Highlights $10,000 Financial Investment Each participant receives a $10,000 award to support their leadership development, education, advocacy, or community initiatives. Comprehensive Leadership Development Participants engage in structured curriculum covering: Advocacy Justice reform Leadership strategy Communication skills Resilience and systems change Cohort Community Participants join a peer network fostering collaboration and collective action. Capacity Building for Long-Term Success Through mentorship and skill development, participants build sustainable leadership pathways. Eligibility Criteria for NextWave Applicants must: Be 18 25 years old Have a history of incarceration Reside in the United States Focus work within U.S. communities Propose work that does not involve lobbying Not have previously received the 10-for-10 Prize Click HERE to learn more and apply for the NextWave Leadership Program. Program Philosophy: Investing in Lived Expertise Both programs operate on a shared belief: People who have experienced incarceration firsthand are uniquely positioned to lead transformative justice reform. By investing in leaders rather than institutions, Canary Impact builds a movement rooted in lived experience, community accountability, and systemic change. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Application Process Interested candidates should apply through the official Canary Impact website under either: 10-for-10 Program NextWave Leadership Program Applicants are encouraged to present a clear, innovative idea for systemic change and demonstrate readiness to engage in cohort-based leadership development. Application deadlines are not specified on the site. Applicants should consult the official Canary Impact website for current timelines. Discover more Awards on OFY HERE . The post Canary Impact 2026 Leadership Opportunities: $10,000 Awards for Justice-Involved Leaders Through the 10-for-10 Program and NextWave Leadership Program (U.S.) appeared first on Opportunities for Youth .","tags":["education","Awards","America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T18:52:28Z","updated_at":"2026-02-27T18:52:28Z"}
{"id":"be7a39b0dc217545a0ad3adbec38b7e1bcf5841d","title":"George C. Marshall Fellowship 2026: Develop Grand Strategy Skills and Advance U.S. National Security Leadership","url":"https://opportunitiesforyouth.org/2026/02/27/george-c-marshall-fellowship-2026-develop-grand-strategy-skills-and-advance-u-s-national-security-leadership/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T13:18:15Z","summary":"Introduction: A Premier Fellowship in Grand Strategy and Strategic Leadership The George C. Marshall Fellowship is a prestigious leadership development program offered by The Heritage Foundation . Designed for exceptional conservative professionals early in their careers, this fellowship provides a comprehensive foundation in grand strategy theory and practice , strategic leadership, and the integration of national power instruments to advance U.S. national security interests. Inspired by the legacy of George C. Marshall , the program equips fellows with the intellectual framework and practical tools needed to address complex global challenges while preserving the principles of free enterprise, limited government, individual freedom, traditional American values, and a strong national defense. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); The 2025 George C. Marshall Fellowship is structured as an immersive, multi-month experience combining expert-led discussions, hands-on workshops, historical analysis, and real-world strategic exercises. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); About the George C. Marshall Fellowship Mission The mission of the George C. Marshall Fellows program is to provide exceptional conservative professionals with the opportunity to: Apply the principles of grand strategy. Integrate all instruments of national power (diplomatic, informational, military, and economic). Develop practical approaches to achieving U.S. national security objectives. Strengthen leadership capabilities grounded in conservative policy principles. Vision The program offers a comprehensive overview of grand strategy theory and its practical application to today s global challenges. It is designed for individuals early in their careers who are likely to take on significant responsibilities in advancing U.S. national security. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Participants gain: Exposure to leading national security experts. Practical insights into defense and foreign policy. A structured understanding of geopolitical threats. Real-world exercises simulating strategic decision-making. The fellowship emphasizes both theoretical depth and applied leadership training , ensuring participants leave with actionable knowledge. 2026 George C. Marshall Fellowship Program Schedule The 2026 cohort follows a structured curriculum running from April through September. Program Launch April 30 (5 p.m. 7 p.m.) Dinner and discussion with a guest speaker. This opening session introduces fellows to the program s intellectual framework and sets expectations for the months ahead. Defense Budget 101 May 14 (5 p.m. 7 p.m.) Practical briefing and workshop on the Defense Budget. This session provides an in-depth understanding of: The U.S. defense budgeting process. Strategic resource allocation. Budget priorities and trade-offs. How funding decisions reflect national strategy. Participants engage in hands-on analysis to connect policy objectives with fiscal realities. Gettysburg Staff Ride May 29 (All Day) Day trip, lunch, and battlefield tour in Gettysburg, Pennsylvania. This immersive historical experience at Gettysburg Battlefield allows fellows to: Study strategic decision-making in historical context. Analyze leadership under pressure. Evaluate operational successes and failures. Draw modern lessons from Civil War strategy. Staff rides are a traditional military leadership development tool, reinforcing critical thinking and situational analysis. Module 2: Deterring China June 11 (5 p.m. 7 p.m.) Dinner and discussion with a guest speaker. June 25 (5 p.m. 7 p.m.) Practical exercise. This module focuses on: The strategic challenge posed by China. Deterrence theory and application. Military, economic, and diplomatic tools. Scenario-based strategic exercises. Fellows examine current geopolitical tensions and develop policy recommendations within a structured framework. Module 3: Hemispheric Security July 9 (5 p.m. 7 p.m.) Dinner and discussion with a guest speaker. July 23 (5 p.m. 7 p.m.) Dinner and panel discussion. This module addresses: Western Hemisphere security dynamics. U.S. relations with regional partners. Emerging threats in the Americas. Strategic coordination across institutions. Participants engage with policy experts and panelists to explore multidimensional security challenges. Program Graduation September 10 (Time and location TBD) Dinner and happy hour. The program concludes with a formal graduation event recognizing fellows achievements and fostering long-term professional networks. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Why Apply for the George C. Marshall Fellowship? The fellowship provides: Advanced training in grand strategy. Direct engagement with national security experts. Applied policy workshops. Leadership development grounded in conservative principles. Networking with peers committed to advancing U.S. national security. Exposure to real-world policy analysis and strategic planning. A prestigious credential associated with The Heritage Foundation. This is not merely a lecture series. It is an immersive strategic leadership development experience. Application Process Interested candidates are encouraged to apply through the official application portal. For more information click here Apply here Discove more fellowships opportunities here The post George C. Marshall Fellowship 2026: Develop Grand Strategy Skills and Advance U.S. National Security Leadership appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Fellowship","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-27T18:52:28Z","updated_at":"2026-02-27T18:52:28Z"}
