{"id":"02b3890bf31817b6af4efb8b35702a5fe29a81ce","title":"3rd Global MAB Youth Forum 2026 — Fully Funded UNESCO Youth Forum in Italy (Apply Now)","url":"https://opportunitiesforyouth.org/2026/02/28/3rd-global-mab-youth-forum-2026-fully-funded-unesco-youth-forum-in-italy-apply-now/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-28T18:04:06Z","summary":"Key Details Organizer: UNESCO Man and the Biosphere (MAB) Programme Location: Rosolina Mare, Italy Dates: 18 22 May 2026 Format: In-person Age range: 18 35 years Maximum participants: 200 Theme: Committed to the Future We Want Funding: Accommodation and meals covered; limited travel support available Application deadline: 23 March 2026 (23:59 CET) Contact: mab@unesco.org The third Global MAB Youth Forum marks a key milestone for strengthening youth participation in UNESCO s Man and the Biosphere (MAB) Programme. UNESCO 18 May 2026 22 May 2026 Theme Building on the 2017 and 2019 Global MAB Youth Forums, the third forum adopts the theme Committed to the Future We Want. Aligned with the Hangzhou Strategic Action Plan (2026 2035), it reflects MAB Youth s strengthened commitment to addressing biodiversity loss, climate change, and sustainable development. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Objectives The forum aims to: Enable MAB Youth to engage with and contribute to the implementation of the Hangzhou Strategic Action Plan (2026 2035), with particular attention to Action Target 20 on developing the MAB Youth Network. Translate findings from the World MAB Youth Mapping Survey into shared priorities, innovative approaches, and concrete pathways for action. Facilitate the exchange of youth-led practices and initiatives in Biosphere Reserves related to biodiversity conservation, sustainable development, and community well-being. Foster coordination, leadership, and capacity-building among youth actors across the World Network of Biosphere Reserves. Produce concrete youth-led outputs and recommendations that inform MAB governance and future action at national, regional, and global levels. Identify strategies to strengthen the integration of youth within MAB governance structures and decision-making. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Who can apply The Forum is intended for young people aged 18 35 who are actively engaged in or connected to UNESCO Biosphere Reserves (e.g., living, working, studying, volunteering, conducting research, or supporting BR-related activities). The maximum number of participants is 200. The Call for Expression of Interest will close on 23 March 2026 at 23:59 CET. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Two distinct application pathways are available: National MAB Youth Focal Points: Designated National MAB Youth Focal Points are invited to apply as official representatives within the framework of the MAB Programme. In view of their official national designation, National MAB Youth Focal Points who submit the required documentation shall be eligible to participate in the Forum without being subject to a competitive selection process. MAB Youth Participants (Open Call Other than National MAB Youth Focal Points): Eligible young people aged 18 35 who are actively engaged in or connected to UNESCO Biosphere Reserves (e.g., living, working, studying, volunteering, conducting research, or supporting BR-related activities) may apply through an open Expression of Interest process. Selection will be conducted competitively based on merit, geographical balance, gender parity, and relevance to the Forum s objectives. How to apply Applicants should submit an online expression of interest through the application form(s). The application should include basic information and, depending on the category, supporting documents. National MAB Youth Focal Points National MAB Youth Focal Points are requested to submit the following documents: A confirmation letter of designation issued by the MAB Secretariat, confirming their official appointment as National MAB Youth Focal Point. A short description of their experience, initiatives, or engagement related to UNESCO Biosphere Reserves, including their role and key outcomes. (Max. 250 words) A brief statement of contribution (max. 250 words) outlining what they can bring to the 3rd MAB Youth Forum in their role as National MAB Youth Focal Point. A brief statement (max. 250 words) explaining how they plan to follow up at national or regional levels after the Forum. An indication of whether they have confirmed financial support to cover their travel costs. If yes, supporting documentation may be uploaded. APPLY MAB Youth Participants (open call) Applicants are requested to submit the following: A recent Curriculum Vitae (CV). A short description of their experience, initiatives, or engagement related to UNESCO Biosphere Reserves, including their role and key outcomes. (Max. 250 words) A statement outlining the contributions they intend to bring to the Forum and the outcomes they hope to achieve. (Max. 250 words) A brief explanation of how they plan to apply the outcomes of the Forum in their Biosphere Reserve, community, or country after the event. (Max. 250 words) A letter of endorsement or support from a Biosphere Reserve or respective MAB National Committee or National Commission for UNESCO. An indication of whether they have confirmed financial support to cover their travel costs. If yes, supporting documentation may be uploaded. APPLY Travel and financial arrangements Food and accommodation costs in Italy during the Forum will generously be covered by the organizers. Limited financial support may be provided to assist participants with travel expenses, depending on funding availability and eligibility criteria. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Organisers Po Delta Biosphere Reserve Colli Euganei Biosphere Reserve Ministry of the Environment and Energy Security Ministry of Foreign Affairs and International Cooperation Fondazione Cassa di Risparmio di Padova e Rovigo Italian National Commission for UNESCO UNESCO MAB Secretariat UNESCO Regional Bureau for Science and Culture in Europe Veneto Region Contact UNESCO MAB Secretariat: mab@unesco.org Useful links Man and the Biosphere Programme UNESCO Venice Po Delta Biosphere Reserve Colli Euganei Biosphere Reserve Source for more info: https://www.unesco.org/en/articles/3rd-global-mab-youth-forum-2026-committed-future-we-want The post 3rd Global MAB Youth Forum 2026 — Fully Funded UNESCO Youth Forum in Italy (Apply Now) appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Conferences","Europe","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-28T18:39:44Z","updated_at":"2026-02-28T18:39:44Z"}
{"id":"0fd0abbd28149d64f6bfe64f478f99f9a32f94d9","title":"Apply Now: Junior Collaborator – Institutional Engagement and Development Actors (Remote, IIHL)","url":"https://opportunitiesforyouth.org/2026/02/28/apply-now-junior-collaborator-institutional-engagement-and-development-actors-remote-iihl/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-28T10:06:43Z","summary":"Are you passionate about international law, humanitarian protection and advancing sustainable development? The Apply for Junior Collaborator Institutional Engagement Development Actors (IIHL) represents a unique opportunity to join a world-renowned organisation shaping global policy and partnerships in refugee law and migration law. Position Title Junior Collaborator Institutional Engagement Development Actors Department of International Refugee Law and Migration Law International Institute of Humanitarian Law (IIHL), Sanremo, Italy (Remote) ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Application Deadline Applications Close on 5th March 2026 (Rome CET time) Work Location Remote / Home-based (with reliable internet) Travel to Sanremo (Italy), Geneva (Switzerland) or other duty stations may be required and fully covered by IIHL. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Contract Details Contract Type: 6-month collaboration contract Remuneration: ~ 500 per month Scholarships: Complimentary access to Department s online learning courses Hours: Full-time remote role with possible attendance at meetings in Rome CET time zone ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Role Overview Under guidance from the Head of the Institutional Engagement Unit, the Junior Collaborator will: Conduct research on development actors and humanitarian development peace nexus issues Map partnership and funding opportunities with global development institutions Support online and in-person capacity-sharing and learning initiatives Track partnerships and contribute to key strategic work of the Department This role is ideal for early-career professionals seeking first-hand experience with international organisations and a gateway to future roles in humanitarian law and development sectors. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Key Responsibilities 1. Mapping Research Research development actors including governmental, UN, regional, and financial institutions Identify partnership and funding possibilities for capacity building and strategic projects. Analyze trends in protection, displacement, and sustainable responses. 2. Support Outreach Support capacity-sharing initiatives like online courses. Maintain and update the Department s internal partnerships tracker. Assist with documentation and reporting on development engagement activities. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Qualifications Skills Required Mandatory 1. University degree in Social Sciences, International Relations, Political Science, Economics, Development Studies, or related field. 2. Strong organizational, written, and oral communication skills. 3. Fluency in English (other UN languages are a plus). 4. Commitment to humanitarian and protection work in displacement contexts. Desirable 1. Experience with international development projects or institutions. 2. Familiarity with refugee, migration, and statelessness law frameworks. 3. Knowledge of instructional design or online capacity-building platforms. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Why This Opportunity Matters This role is strategically positioned at the intersection of humanitarian action, development, and global partnerships. By focusing on development actors , you ll engage with institutions shaping responses to displacement, resilience, and global cooperation all while enhancing your professional credentials in a globally respected institution. Benefits of the Position Professional experience with an international legal humanitarian organisation Exposure to global development and refugee protection coordination Career development through learning scholarships Remote flexibility with optional travel fully funded by IIHL Priority consideration for future roles within the Department ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); How to Apply Submit the following through the official IIHL Careers Portal: Required Documents: 1. Updated CV 2. Motivation Letter Apply here Tip: The Institute may start interviews before the deadline if strong candidates are identified early. The International Institute of Humanitarian Law embraces diversity and inclusion all qualified applicants are encouraged to apply regardless of gender, nationality, ethnicity, religion, disability, age, sexual orientation, or background. Applications from individuals with forced displacement and statelessness experiences are especially welcome. For more information visit here For more global opportunities click here The post Apply Now: Junior Collaborator – Institutional Engagement and Development Actors (Remote, IIHL) appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Jobs","Latin America and the Caribbean"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-28T18:39:44Z","updated_at":"2026-02-28T18:39:44Z"}
{"id":"aef2730bf2ab9c0e9f0df30813040a8c3a21642b","title":"Apply now for the PhD Programme in Economics at the Cologne Graduate School (CGS), University of Cologne","url":"https://opportunitiesforyouth.org/2026/02/28/apply-now-for-the-phd-programme-in-economics-at-the-cologne-graduate-school-cgs-university-of-cologne/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-28T10:05:51Z","summary":"If you re an ambitious researcher looking to pursue a world-class PhD in Economics , the Cologne Graduate School in Management, Economics and Social Sciences (CGS) at the University of Cologne (UoC) is one of the most competitive and rewarding graduate destinations in Europe. Why This Programme is a Top Global Choice The PhD Programme in Economics at CGS/UoC stands out because it offers: A fully English-taught, research-driven curriculum with international faculty. Rigorous training that prepares you for academic careers and top research jobs worldwide. Structured supervision and research opportunities across economics, econometrics, political economy, behavioral economics, and more. A vibrant research ecosystem with connections to major research centers like the Cluster of Excellence ECONtribute: Markets Public Policy and external partners like the Max Planck Institute. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); No tuition and multiple funding avenues including fully funded PhD positions, scholarships, and research assistant roles. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Funding, Scholarships Benefits 1. Full PhD Funding Fully funded doctoral positions through CGS or partners. Funding typically covers living expenses during the PhD stage. 2. Stipends for M.Sc. Stage A limited number of scholarships available for exceptional M.Sc. students. Who Can Apply: Eligibility Qualifications 1. Applicants with a Bachelor s Degree You can enter the programme via the M.Sc. Economic Research (First Stage), designed to bridge undergraduate preparation to doctoral research. Ideal if: ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Your Bachelor s is in Economics, Econometrics, Finance, or related fields. You rank among the top graduates in your cohort. Outcome:Completing the M.Sc. successfully gives you direct access to the doctoral (PhD) stage. 2. Applicants with a Master s Degree Students holding a master s degree in Economics or a closely related discipline can apply directly to the PhD Stage. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Strong qualification signals include: Proven research interest or thesis evidence. Academic excellence (top GPA/grades). Clear match between your research interests and faculty expertise. Additional Training or Course Work If your Master s does not include sufficient Economics coursework, you may need up to one year of additional courses drawn from the M.Sc. curriculum. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Application Checklist Submission Requirements To build a strong application, prepare the following: Standard Application Materials Certified degree transcripts and diplomas (Bachelor s/Master s) Detailed CV with academic highlights. Research proposal (ideally aligned with faculty research) Recommendation letters (academic) Motivation letter explaining your fit for research. Proof of English proficiency (if not from an English-medium degree). (site may specify requirements when applications open) ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Apply here Application Deadlines Intake Periods PhD Programme (with Integrated M.Sc. Option) 15th March 2026 for PhD 31st March 2026 for Msc Programme starts every October Tip: Mark mid-January to early February in your calendar to check for open application calls. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Strategic Tips to Win Admission Start Preparing Early applications open January; deadlines are strict. Match faculty research show clear alignment between your research vision and CGS strengths. Solid research proposal boosts competitiveness in this highly selective programme. Strong academic record is essential, especially at the master s level. Other Funding Opportunities External fellowships such as EWI Fellowship for Energy Economics (requiring separate application). Some doctoral positions are offered jointly with partner research institutions (e.g Max Planck Institute). Additional Perks Extensive conference funding and research stay support. Opportunities for joint publications and collaborative research. No tuition fees only a nominal semester fee ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); The PhD Programme in Economics at the Cologne Graduate School is a globally respected research destination and for good reason. With no tuition , funded PhD positions , a strong international research network , and excellent post-graduate prospects , it s a transformative step for future economists and academic leaders. For more information visit here For more global opportunities click here The post Apply now for the PhD Programme in Economics at the Cologne Graduate School (CGS), University of Cologne appeared first on Opportunities for Youth .","tags":["education","Continent","Africa","America","Asia","Australia and Oceania","Europe","Latin America and the Caribbean","Master","Middle East and North Africa","PhD","Scholarships","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-28T18:39:44Z","updated_at":"2026-02-28T18:39:44Z"}
{"id":"0780ed1e6ed0231c18fe28f152ff619031df5e82","title":"Carter Center Educational Programs 2026: Paid Internships and Graduate Assistantships (Complete Guide)","url":"https://opportunitiesforyouth.org/2026/02/28/carter-center-internship/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-28T01:32:05Z","summary":"Key Details Organization: The Carter Center Location: Atlanta, Georgia, USA (in-person) Programs: Paid Internships and Graduate Assistantships Focus Areas: Peace, Health, Democracy, Human Rights, International Development, Operations Internship Stipend: Spring (15 weeks): $5,100 Summer (10 weeks): $3,400 Fall (15 weeks): $5,100 Graduate Assistantship Compensation: $18.50 per hour 9 12 months, 20 hours per week Internship Deadlines: Summer 2026: March 2, 2026 (11:59 p.m. ET) Fall 2026: June 15, 2026 (11:59 p.m. ET) ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Graduate Assistantship Deadlines: Application Opens: February 13, 2026 Application Deadline: April 23, 2026 (11:59 p.m. ET) Recommendation Letters Deadline: April 30, 2026 ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Who Can Apply: Undergraduate juniors or seniors Graduate students Recent graduates (within 24 months) International students authorized to work in the U.S. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Introduction The Carter Center Educational Programs provide structured professional opportunities for students and early-career professionals interested in advancing global peace, public health, democracy, and operational excellence. With more than four decades of experience and nearly 4,000 participants worldwide, the program has become a recognized pathway for individuals pursuing careers in international development, policy, and nonprofit leadership. Through paid internships and graduate assistantships, participants gain hands-on experience supporting real projects while building practical skills, professional networks, and career direction. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); About the Carter Center Educational Programs The Educational Programs were created to cultivate informed and committed leaders who can contribute meaningfully to global peace and health initiatives. Participants work alongside experts and program teams, applying academic knowledge to practical challenges while gaining exposure to the realities of international development work. The programs emphasize professional growth, mentorship, and experiential learning, helping participants explore career pathways and strengthen technical and leadership competencies. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Carter Center Internship Program Program Overview The Carter Center Internship Program offers diverse opportunities for students and recent graduates to gain professional experience across peace, health, and operational initiatives. Interns contribute directly to ongoing projects while developing skills relevant to careers in international affairs, nonprofit management, public health, and global policy. Eligibility Requirements Applicants must meet one of the following criteria: Undergraduate students who have completed at least two years of study (minimum 60 credit hours in the U.S. system) ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Graduate students currently enrolled or enrolled within the last 24 months Recent graduates who completed their undergraduate degree within the past 24 months Additional requirements include: Authorization to work in the United States No citizenship restrictions International students enrolled at U.S.-based institutions may apply with approval from their host institution ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); All internship opportunities are based in Atlanta, Georgia. Internship Compensation Internships are paid through a stipend structure: Spring Semester (15 weeks): $5,100 Summer Semester (10 weeks): $3,400 Fall Semester (15 weeks): $5,100 Internship Program Areas Internship placements are available across three major divisions: Peace Programs China Focus (opens in new window) Conflict Resolution Program (opens in new window) Democracy (opens in new window) Human Rights Program (opens in new window) Inform Women, Transform Lives (opens in new window) Latin America and Caribbean Focus (opens in new window) Office of the Vice President of Peace (opens in new window) Rule of Law (opens in new window) Health Programs International Public Health (opens in new window) Mental Health Program (opens in new window) Special Health Projects (opens in new window) ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Operations Programs Communications (opens in new window) Development (opens in new window) Educational Programs (opens in new window) People Operations Programs (Human Resources) (opens in new window) Information Technology (opens in new window) Strategy, Innovation and Learning (opens in new window) Volunteer Services/Art Collection (opens in new window) Overseas Operations (opens in new window) DEI Internal Communications Intern Experience and Career Impact Participants often describe the internship as a launching point for professional growth. Interns gain exposure to international development leadership, apply academic knowledge in real contexts, and build practical skills valued across the nonprofit and policy sectors. Former interns have contributed to projects related to election observation, governance, and regional initiatives while developing expertise that supports future graduate study and professional advancement. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Apply Today Start your journey at The Carter Center by applying for an internship or graduate assistantship today. Internship Application Carter Center Graduate Assistantship Program Program Overview The Graduate Assistantship Program offers a limited number of funded opportunities for master s and doctoral students seeking deeper engagement in research and program implementation. Graduate assistants work closely with program teams and contribute to substantive projects while balancing academic commitments. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Program Structure Duration: 9 12 months Workload: 20 hours per week Location: Atlanta, Georgia Compensation: $18.50 per hour Eligibility Requirements Applicants must: Be enrolled in a master s or doctoral program throughout the assistantship Have completed at least two semesters of graduate-level coursework at the start of the program Remain enrolled until the end of the assistantship ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Students who graduate before the assistantship concludes are not eligible. Graduate Assistantship Program Areas Peace Conflict Resolution (opens in new window) Democracy Program (opens in new window) Inform Women, Transform Lives (opens in new window) China Focus (opens in new window) Health Mental Health Program (opens in new window) Trachoma Control Program (opens in new window) Operations Development: Donor Landscape Analysis (opens in new window) People Operations Programs Apply Today Start your journey at The Carter Center by applying for an internship or graduate assistantship today. Graduate Assistantship Application Application Dates and Deadlines Internships Summer 2026 Session Application Deadline: March 2, 2026 (11:59 p.m. ET) Start Date: May 19, 2026 Fall 2026 Session Application Deadline: June 15, 2026 (11:59 p.m. ET) Start Date: August 25, 2026 Graduate Assistantships Application Opens: February 13, 2026 Application Deadline: April 23, 2026 (11:59 p.m. ET) Recommendation Letters Deadline: April 30, 2026 Why Apply to the Carter Center Educational Programs These programs are highly valuable for individuals seeking careers in international development and global impact. Key benefits include: Paid professional experience Exposure to peacebuilding and global health initiatives Opportunities to apply academic training in real-world contexts Access to experienced mentors and professionals Strong preparation for graduate study or careers in NGOs, policy, and international organizations ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); How to Apply and Contact Information Applications are submitted through the Carter Center Educational Programs portal. Candidates can apply for internships or graduate assistantships depending on eligibility. Apply Today Start your journey at The Carter Center by applying for an internship or graduate assistantship today. Internship Application Graduate Assistantship Application For questions and eligibility clarification: Email: EducationalPrograms@CarterCenter.org Conclusion The Carter Center Educational Programs offer a competitive and practical pathway for students and early-career professionals committed to advancing peace and health worldwide. With paid positions, structured mentorship, and meaningful project experience, the internships and graduate assistantships provide strong preparation for long-term careers in international development and global leadership. Applicants are encouraged to prepare early and submit strong, well-tailored applications before the deadlines. Source: https://www.cartercenter.org/educational-programs/#dates The post Carter Center Educational Programs 2026: Paid Internships and Graduate Assistantships (Complete Guide) appeared first on Opportunities for Youth .","tags":["education","Africa","America","Asia","Australia and Oceania","Continent","Europe","Internships","Jobs","Latin America and the Caribbean","Middle East and North Africa","South America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-28T18:39:44Z","updated_at":"2026-02-28T18:39:44Z"}
{"id":"806c8842227f6804546aaa874d99864f1eddf42e","title":"NYC Teaching Fellows 2026: Become a Fully Certified NYC Public School Teacher by Fall 2026 (Starting Salary $71,314+)","url":"https://opportunitiesforyouth.org/2026/02/28/nyc-teaching-fellows-2026-become-a-fully-certified-nyc-public-school-teacher-by-fall-2026-starting-salary-71314/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-28T00:49:33Z","summary":"Are you ready to launch a meaningful career in education while making a direct impact in high-need communities? The NYC Teaching Fellows Program 2026 offers a highly selective, fully supported pathway to become a certified teacher in New York City Public Schools by Fall 2026. Designed for talented professionals and recent graduates from diverse backgrounds, the program prepares participants to teach in critical shortage subject areas such as math, science, special education, and bilingual education while earning a full-time salary and working toward a subsidized master s degree. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); If you are passionate about educational equity, student success, and leadership in urban education, this opportunity could redefine your career trajectory. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); About NYC Teaching Fellows NYC Teaching Fellows is a rigorous alternative certification program operated by NYC Public Schools the largest public school system in the United States, serving approximately 1 million students across more than 1,600 schools. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); The program recruits individuals committed to addressing educational inequities in underserved communities. Fellows receive intensive training, ongoing coaching, and professional development while working full-time as teachers. By Fall 2026, selected candidates will be placed in NYC Public Schools classrooms and begin their careers as certified educators. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Program Structure and Timeline Summer 2026 Intensive Pre-Service Training Participants begin with a 7-week intensive summer training program designed to build foundational teaching competencies, including: Instructional planning Classroom management Curriculum development Student assessment strategies Equity-centered pedagogy Fellows receive a stipend during this training period. September 2026 Full-Time Teaching Placement In Fall 2026, Fellows: Begin teaching full-time in NYC Public Schools Earn a starting salary of $71,314+ per year Receive full employee benefits Continue working toward initial teaching certification ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Graduate Education Component Participants simultaneously pursue a subsidized master s degree in education at a partner institution. This dual-track model allows Fellows to: Gain hands-on classroom experience Complete graduate coursework Earn certification Develop advanced pedagogical skills Compensation and Benefits The NYC Teaching Fellows program offers a competitive financial and professional package: Starting Salary $71,314+ per year as a full-time NYC Public Schools teacher Summer Training Stipend Participants receive financial support during the 7-week summer training period. Full Benefits Package Medical insurance Dental insurance Vision insurance Pension plan 401(k) Commuter benefits Tuition assistance Student loan assistance ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Professional Development Ongoing mentorship Coaching support Access to a network of dedicated educators Structured professional growth pathway High-Need Subject Areas NYC Teaching Fellows recruits candidates for shortage subject areas, including: Mathematics Science Special Education Bilingual Education Specific subject eligibility requirements may apply. Applicants are encouraged to review subject-specific criteria HERE . Who Should Apply? NYC Teaching Fellows seeks candidates who demonstrate: Commitment to educational equity Resilience and adaptability Growth mindset Passion for student success Willingness to work in high-need communities ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Importantly, no prior teaching experience is required. Eligibility Requirements To apply for the Fall 2026 cohort, candidates must: Hold a bachelor s degree by May 31, 2026 Have a minimum undergraduate GPA of 2.5 Be fluent in written and spoken English Have permanent authorization to work in the United States Never have participated in a program leading to U.S. or Puerto Rico teacher certification Meet additional subject-specific requirements where applicable Why Choose NYC Public Schools? NYC Public Schools is the largest public school system in the U.S., employing: 75,000+ teachers Thousands of counselors, social workers, administrators, and staff The system reflects New York City s vibrant diversity and is deeply committed to equity, inclusion, and excellence. By joining NYC Teaching Fellows, participants become part of a workforce dedicated to ensuring every student is seen, supported, and set up to thrive. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Equal Opportunity Employer The NYC Department of Education is committed to nondiscrimination and equal opportunity in employment and education. Opportunities are provided without regard to race, color, religion, ethnicity, national origin, citizenship status, age, marital status, disability, sexual orientation, gender, military status, or other protected characteristics. How to Apply Find the application link HERE . Click HERE to find the program information. Interested candidates are encouraged to apply early due to the competitive and highly selective nature of the program. Discover more job opportunities on OFY HERE . The post NYC Teaching Fellows 2026: Become a Fully Certified NYC Public School Teacher by Fall 2026 (Starting Salary $71,314+) appeared first on Opportunities for Youth .","tags":["education","Jobs","America"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-28T18:39:44Z","updated_at":"2026-02-28T18:39:44Z"}
{"id":"6e5a82e3f98cf2a1586be6cb36e0146ba2807f7b","title":"Apply Now: €50,000 Funding for SMEs Developing Space-Enabled Environmental Solutions.","url":"https://opportunitiesforyouth.org/2026/02/27/apply-now-e50000-funding-for-smes-developing-space-enabled-environmental-solutions/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T19:11:21Z","summary":"The 1st Open Call for the Financial Support Program is now open, offering funding to small and medium-sized enterprises (SMEs) that want to leverage downstream space technologies to create environmentally sustainable and circular solutions. This initiative empowers companies to integrate Earth Observation (EO), remote sensing, and satellite navigation data into innovative processes, services, or products that reduce environmental impact. What the Program Offers This Financial Support Program provides funding for SMEs to contract External Service Providers who can help design, develop, or implement space-enabled green solutions . These solutions can either: ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Improve the company s own internal operations Deliver environmental benefits to customers and end users ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Example Use Cases Optimizing internal processes to reduce waste, emissions, or resource consumption Developing products or services for environmental monitoring and resource management ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Projects can range from early-stage ideas to fully developed solutions . Funding Details Total Budget: 1,250,000 Number of SMEs Supported: 35 Maximum Funding per SME: 50,000 Who Can Apply? This Open Call is designed for SMEs that: Are based in EU Member States or Horizon Europe Associated Countries Can demonstrate potential to use downstream space data (e.g., EO, remote sensing, satellite navigation) to reduce environmental impact ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); SME Eligibility Criteria Applicants must meet the EU SME definition: Fewer than 250 employees Annual turnover not exceeding 50 million OR balance sheet total not exceeding 43 million ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Priority Areas The program gives special attention to solutions that focus on: Circularity, resource efficiency, and waste management Environmentally responsible management of raw materials Advanced environmental monitoring solutions Why Apply? This program offers SMEs a unique opportunity to: Access funding for innovation and sustainability Integrate cutting-edge space data technologies Improve environmental performance and competitiveness Build partnerships with specialized service providers ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); If your business is ready to harness space-enabled data for environmental impact , this is your opportunity to turn your idea into a funded, real-world solution. How to Apply Applying is straightforward and completed online through the OnePass platform : Register or log in on OnePass Complete your application Describe your solution and required services from external providers Submit your application Once submitted, your application will be evaluated, and selected applicants will be matched with external service providers to implement their projects. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Application Deadline 31 March 2026 at 23:59 CET (Brussels time) Timeline Overview January 2026: Open Call launch February 2026: First cut-off March 2026: Final application deadline April 2026: Evaluation and selection of first batch of winners Following months: Selection of second batch and project implementation Up to 6 months after signing: Project implementation period Final stage: Review and voucher payment Support and Guidance Applicants are encouraged to review the Guide for Applicants carefully before submitting their proposals. The guide explains eligibility, application steps, and evaluation criteria. For more details about this funding opportunities, click Here . Start your application today and contribute to a more sustainable, circular future. Discover more Funding Opportunities . The post Apply Now: €50,000 Funding for SMEs Developing Space-Enabled Environmental Solutions. appeared first on Opportunities for Youth .","tags":["education","Conferences","Europe","Grants"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-28T18:39:44Z","updated_at":"2026-02-28T18:39:44Z"}
{"id":"e23b55d9bfdeaf203e509eefb764c40dd43a2ade","title":"Apply Now: 2026 Internships at the U.S. Trade and Development Agency (USTDA)","url":"https://opportunitiesforyouth.org/2026/02/27/apply-now-2026-internships-at-the-u-s-trade-and-development-agency-ustda/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T18:13:10Z","summary":"Are you looking to gain hands-on experience in global development, infrastructure, and international partnerships? The U.S. Trade and Development Agency (USTDA) is offering a range of internship opportunities for motivated students and young professionals eager to contribute to impactful projects in emerging markets. USTDA plays a key role as the U.S. government s first mover on critical infrastructure development , helping to advance shared strategic priorities while fostering sustainable economic growth worldwide. Through its internship program, you can work alongside experienced professionals and gain exposure to international development, trade, and policy implementation. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Available Internship Openings 1. Office of Programs Internship Application Period: February 19, 2026 March 20, 2026 Department: Office of Programs Overview: Interns in this office will support USTDA s core project development activities, contributing to initiatives that drive critical infrastructure development in emerging economies. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); 2. Intern, Office of Administration / Human Resources Application Period: February 19, 2026 March 20, 2026 Department: Office of Administration / HR Overview: This role offers experience in organizational operations, talent management, and HR systems that support the agency s global mission and internal workforce development. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); 3. Intern, Office of the Chief Information Officer Application Period: February 19, 2026 March 20, 2026 Department: Office of the Chief Information Officer (OCIO) Overview: Interns will assist with IT systems, digital infrastructure, and information management, supporting the technological backbone of USTDA s global operations. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Why Apply? An internship with USTDA offers you the chance to: Gain real-world experience in international development and trade Work on projects that support infrastructure growth in emerging markets Develop professional skills in policy, administration, technology, and project management Build a global professional network within a U.S. government agency Contribute to meaningful initiatives that drive economic development and sustainability Application Deadline All internship applications close on March 20, 2026 . Early applications are strongly encouraged. To apply to any of the internship opportunities, Visit Here Take the Next Step If you are passionate about global development, infrastructure, and international collaboration, these internships at the U.S. Trade and Development Agency provide a valuable platform to launch your career. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Prepare your application materials early, tailor your resume to the role you re applying for, and highlight your interest in international development and infrastructure. Start your journey toward a global career today. Discover more Internship opportunities Here. The post Apply Now: 2026 Internships at the U.S. Trade and Development Agency (USTDA) appeared first on Opportunities for Youth .","tags":["education","Continent","America","Internships"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-28T18:39:44Z","updated_at":"2026-02-28T18:39:44Z"}
{"id":"c6909c021f2beac01ad545a8645a9b01f1787d0d","title":"European Ombudsman Traineeships 2026: Paid EU Governance Opportunity for Graduates","url":"https://opportunitiesforyouth.org/2026/02/27/european-ombudsman-traineeships-2026-paid-eu-governance-opportunity-for-graduates/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T18:10:03Z","summary":"If you re an ambitious university graduate or a student in your final year seeking world-class professional experience in European governance, transparency, public administration, or EU affairs this is one of the most sought-after opportunities within EU institutions for career-minded individuals wanting to work at the heart of EU democratic accountability and public service. Hosting Institution European Ombudsman Overview: What Is the European Ombudsman Traineeship? Digital communication Case-handling Traineeship for persons with disabilities Candidates should be nationals of a Member State of the European Union No previous paid traineeship or work contract in a European institution Bachelors degree as minimum, solid training on EU law ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Deadline: 13 and 31 March Location: Brussels or Strasbourg Compensation: approx. 1400/m The European Ombudsman Traineeship Programme is a paid, full-time, one-year internship designed for recent university graduates who want hands-on experience inside a core European Union institution. The programme offers a unique opportunity to work directly on issues related to EU administration, transparency, accountability, citizens rights, and good governance. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); Trainees are placed in either Brussels or Strasbourg, depending on the needs of the Office, and work under the direct supervision of senior EU officials, usually a Head of Unit or equivalent. The traineeship combines professional responsibility, structured supervision, mentoring, and exposure to the daily functioning of EU institutions. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); This programme is particularly attractive for candidates interested in: EU law and policy Public administration Human rights and accountability European governance and institutional relations Transparency and citizens complaints mechanisms Aim of the Traineeship The traineeship is intended to: Provide practical, real-world experience within an EU institution Allow trainees to build on academic knowledge through professional tasks Develop skills in policy analysis, administration, communication, and institutional work Promote understanding of how EU institutions interact with citizens ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Each trainee works under: A line manager who defines objectives A mentor who supports daily integration and work A structured evaluation system (mid-term and final assessment) Duration of the Traineeship Standard duration: 12 months (1 year) Extension: Not possible Exceptional cases: Shorter traineeships may be offered in the interest of the service ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Start date is typically 1 September each year. Who Can Apply? (Eligibility Criteria) 1. Nationality Applicants must be: Nationals of an EU Member State, OR Nationals of an EU accession or candidate country Eligible regions: Europe (EU + EU candidate/accession countries) 2. Educational Qualifications Applicants must: Hold a minimum 3-year university degree (Bachelor s level or equivalent) Degree must be in a discipline specified in the relevant traineeship call ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Fields commonly accepted include (depending on the call): Law Political Science European Studies International Relations Public Administration Social Sciences Communication and related disciplines 3. Language Requirements Applicants must have: Thorough knowledge of one EU official language, and Very good knowledge of another EU official language ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); English is mandatory, as it is the main working language of the European Ombudsman. 4. Prior EU Experience Restrictions Applicants must NOT have: Completed more than 8 consecutive weeks (or 2 months) of paid traineeship in any EU institution Held any paid employment (temporary, contract, auxiliary, interim agent, SNE, MEP assistant, etc.) in an EU institution ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); This rule ensures fair access for first-time EU trainees. Special Programme: Traineeships for Persons with Disabilities The European Ombudsman runs a dedicated positive-action traineeship programme for candidates with disabilities. Key Features Separate annual call (usually February) Candidates may apply simultaneously to general traineeships if eligible Open to: University graduates, or Students in at least their third year of higher education Additional Support Reasonable accommodation at the workplace Additional financial support of up to 50% of the monthly grant to cover disability-related costs ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Disability-related income does not reduce the traineeship grant Applicants must provide official proof of disability in an EU official language. Selection Procedure Application Timeline Call published: Normally February Start date: 1 September Final results communicated: By 30th June ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Required Application Documents All applications must be submitted via the online application system and include: Completed online application form CV in English Copies of diplomas/degrees (no certification or translation required) One-page motivation letter in English (required for some profiles) Incomplete applications are automatically rejected. Selection Stages Eligibility and profile screening Written test (if applicable) Interview (video call or phone) Selection is merit-based, with attention to: Qualifications Skills Motivation When candidates are equally qualified, the Office promotes: Geographical balance Gender equality Inclusion of persons with disabilities Financial Benefits and Allowances Monthly Grant Equivalent to 25% of the basic salary of an AD6 Step 1 EU official Adjusted by: Country weighting (Brussels or Strasbourg) Household allowance (if applicable) The grant may be: Reduced if the trainee receives other financial support Adjusted due to salary indexation Additional Financial Support Case-by-case lump-sum assistance may be granted Extra disability-related costs covered up to 50% of the monthly grant ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Travel Cost Reimbursement The Ombudsman reimburses travel costs at the beginning and end of the traineeship if not covered elsewhere. Covered Travel Modes Second-class train Bus or car-sharing Economy-class flight (for journeys over 500 km or sea crossings) Private car (kilometric allowance) Tickets are usually booked by the Office Up to 50 kg of luggage may be reimbursed (with approval) Insurance Coverage Full sickness and accident insurance provided Optional insurance for: Spouse Children (at the trainee s expense) Leave and Working Conditions 2 working days of leave per month No cash compensation for unused leave Sick leave: Medical certificate required after 3 days Hybrid work rules apply Strict confidentiality and ethics obligations Supervision, Mentoring, and Evaluation Initial objective-setting meeting Mid-term performance review (6 months) Final evaluation meeting Dedicated mentor throughout the traineeship Exit interview with Human Resources Termination or Suspension Either party may terminate the traineeship One-month notice required for voluntary resignation Grant payments stop during suspension Due process applies in case of early termination Legal Status of Trainees Trainees are not EU officials or staff members No automatic employment rights after completion ezstandalone.cmd.push(function () { ezstandalone.showAds(138); }); Data Protection All personal data is processed under Regulation (EU) 2018/1725, ensuring high standards of privacy and data protection. How to Apply Applications must be submitted online via the official European Ombudsman website once the call is published (normally in February). Important: Applicants may reapply in future years if unsuccessful. Apply here Key Deadlines (Typical Cycle) Call opens: February Application deadline: 13 and 31 March Interviews/tests: Spring Final decisions: By 30 June Traineeship starts: 1 September Why This Traineeship Is Highly Valuable Paid, long-term EU institutional experience Direct exposure to EU governance and citizens rights Strong CV value for EU careers, NGOs, public policy, and law Inclusive programme with strong disability support Work in Brussels or Strasbourg, the heart of Europe The European Ombudsman Traineeship is more than just an internship it s a gateway to public service, advancing democratic accountability and citizen rights within the EU. You ll gain practical EU-level work experience, expand your professional network, and earn credentials that can propel careers in governance, policy, law, human rights, and international relations. For more information visit here For more global opportunities click here The post European Ombudsman Traineeships 2026: Paid EU Governance Opportunity for Graduates appeared first on Opportunities for Youth .","tags":["education","Europe","Internships","Jobs"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-28T18:39:44Z","updated_at":"2026-02-28T18:39:44Z"}
{"id":"302e78c59a8f8ccdc1d744aa83eeefd455b13a57","title":"UNOY Internship 2025: Partnerships Officer Opportunity in the Netherlands","url":"https://opportunitiesforyouth.org/2026/02/27/unoy-internship-2025/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T18:05:23Z","summary":"The UNOY Internship 2025 is now open for applications for the Partnerships Officer position at UNOY Peacebuilders in The Hague, Netherlands. This UNOY Internship offers young professionals a valuable opportunity to gain hands-on experience in peacebuilding, fundraising, and partnership development within an international youth-led organization. Applications for the UNOY Internship close on 9 March 2025 at 23:59 CET, and selected candidates will participate in a six-month internship beginning on 28 April 2025. About the UNOY Internship Program The UNOY Internship at UNOY Peacebuilders provides young professionals with practical experience in the field of international peacebuilding and development. UNOY Peacebuilders is a global youth-led network consisting of more than 100 youth organizations across over 70 countries working together to promote peace, inclusion, and youth participation. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Through the UNOY Internship, interns join a dynamic international team and contribute to real projects that support youth-led peacebuilding initiatives worldwide. Interns work alongside experienced professionals while building skills in fundraising, partnerships, research, communications, and project coordination. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The UNOY Internship allows participants to expand their professional networks and gain experience within the international development and peacebuilding sectors. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); UNOY Internship Responsibilities During the UNOY Internship, the selected Partnerships Officer intern will work closely with the Partnership Coordinator and other team members to support various fundraising and partnership initiatives. Fundraising and Partnership Development One key component of the UNOY Internship is supporting the organization s fundraising strategy and building relationships with partners and donors. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Intern responsibilities include: Supporting the implementation of UNOY s fundraising strategy Researching potential donors and funding opportunities Identifying funding priorities and entry points for new partnerships Assisting in drafting concept notes and grant proposals Supporting relationship management with donors and partner organizations Contributing to reporting and grant management processes These activities provide interns with valuable experience in proposal writing and partnership management within the nonprofit sector. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); Financial Support to UNOY Members Another important component of the UNOY Internship involves supporting the Financial Support to UNOY Members (FSUM) program. This initiative provides small grants to youth-led organizations within the UNOY network. Intern responsibilities within this program include: Supporting the management and implementation of the FSUM program Assisting with grant monitoring and reporting processes Preparing fundraising alerts highlighting funding opportunities for UNOY members Supporting monitoring, evaluation, and learning activities ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Through this work, interns gain insight into grant management and youth funding programs. Communications and Administrative Support The UNOY Internship also includes communications and administrative responsibilities that support the organization s partnership and program activities. Intern tasks may include: Producing and editing content for UNOY s website and social media channels Supporting communications related to partnership initiatives Assisting with planning major meetings such as the Annual Regional Coordinators and International Steering Group meeting Providing general office support where necessary ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); These activities help interns develop strong communication and project coordination skills. Benefits of the UNOY Internship The UNOY Internship provides a range of benefits that support both professional development and practical experience in international development. Benefits include: A monthly stipend of 500 EUR Travel reimbursement for commuting to the office Hybrid work with the possibility of working remotely two days per week Opportunities to gain experience in international development and peacebuilding Access to mentorship and supervision from experienced professionals Networking opportunities with organizations and partners across the world The UNOY Internship also serves as a stepping stone for future careers in international organizations, government institutions, academia, and nonprofit development sectors. ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); Eligibility for the UNOY Internship To apply for the UNOY Internship, candidates must meet several requirements related to education, location, and experience. Applicants should have: A degree in peace and conflict studies, international relations, or a related field Strong interest in peacebuilding and youth leadership Excellent English speaking and writing skills Experience with data management tools and spreadsheets Strong project management and organizational skills Ability to work independently and within multicultural teams Knowledge of additional languages such as French, Arabic, Spanish, or Dutch is considered an advantage. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Applicants must also meet legal requirements for working in the Netherlands, including being a resident of the Netherlands or a citizen of the European Union. Location and Working Conditions The UNOY Internship is based in The Hague, Netherlands, a global hub for international organizations and peace institutions. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); The internship includes: A six-month duration A four-day work week (Monday to Thursday) totaling 32 hours per week Hybrid working arrangements with two remote workdays per week Interns must also have access to a personal computer and secure internet connection. How to Apply for the UNOY Internship Candidates interested in the UNOY Internship must apply through the official online application form provided by UNOY. Applicants will be required to submit: A CV Answers to several short questions about their motivation and skills (maximum 250 words each) ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); Applicants experiencing technical issues with the application form may contact the UNOY team directly via email. APPLY HERE Deadline The UNOY Internship application deadline is March 9, 2025 at 23:59 CET. Because applications are reviewed on a rolling basis, candidates are encouraged to apply as early as possible. Final Note The UNOY Internship offers a valuable opportunity for young professionals interested in peacebuilding, international development, and youth leadership to gain real-world experience in a global organization. By participating in this internship, candidates can develop critical skills, contribute to meaningful peace initiatives, and build networks across the international development community. For more global fellowships, internships, scholarships, and leadership programs, click here . The post UNOY Internship 2025: Partnerships Officer Opportunity in the Netherlands appeared first on Opportunities for Youth .","tags":["education","Internships","Europe"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-28T18:39:44Z","updated_at":"2026-02-28T18:39:44Z"}
{"id":"3cb3bdb0b2c5cc4746d54cfa086c89da237a3153","title":"Harper Fellowship 2026–2027 at The 19th for Emerging Journalists","url":"https://opportunitiesforyouth.org/2026/02/27/harper-fellowship-2026/","source":"opportunitiesforyouth","source_url":"https://opportunitiesforyouth.org/feed/","published_at":"2026-02-27T17:45:22Z","summary":"The Harper Fellowship 2026 2027 at The 19th is now accepting applications from emerging journalists interested in developing their careers in reporting, audience engagement, news product development, and nonprofit media leadership. The Harper Fellowship application deadline is March 20, 2026 at 5:00 p.m. PST, and the program offers a year-long salaried fellowship with full benefits and extensive professional development opportunities. About the Harper Fellowship Program The Harper Fellowship at The 19th is a prestigious journalism fellowship named after Frances Ellen Watkins Harper, widely recognized as the mother of African-American journalism. The program was launched in 2022 to create meaningful opportunities for graduates and alumni connected to Historically Black Colleges and Universities (HBCUs) to gain experience in nonprofit journalism. ezstandalone.cmd.push(function () { ezstandalone.showAds(127); }); Through the Harper Fellowship program, selected fellows spend a full year working with The 19th s editorial, product, audience engagement, and development teams. Fellows are embedded in their respective departments and contribute to meaningful journalism projects while gaining hands-on newsroom experience. ezstandalone.cmd.push(function () { ezstandalone.showAds(128); }); The Harper Fellowship focuses on strengthening diversity in journalism while providing fellows with mentorship, professional training, and career guidance that supports their long-term success in the media industry. ezstandalone.cmd.push(function () { ezstandalone.showAds(129); }); Harper Fellowship Tracks and Learning Areas The Harper Fellowship program includes several fellowship tracks that allow participants to specialize in different areas of journalism and media operations. The fellowship tracks include: Reporting Audience engagement News product Development (new track) Reporting Track Fellows in the reporting track gain experience covering stories through in-depth reporting and investigative work. Participants work closely with editors and journalists to produce original reporting that focuses on the intersection of gender, politics, and policy. ezstandalone.cmd.push(function () { ezstandalone.showAds(130); }); Reporting fellows are encouraged to develop their own story ideas, collaborate with newsroom teams, and experiment with storytelling across digital platforms. Audience Engagement Track The audience engagement track focuses on helping fellows develop skills in digital storytelling and audience-centered journalism. Participants learn how to distribute journalism across multiple platforms such as websites, social media, newsletters, and search engines. ezstandalone.cmd.push(function () { ezstandalone.showAds(131); }); This track also involves creating engaging social media content and collaborating with editorial and creative teams to produce compelling headlines, visuals, and storytelling formats. News Product Track The Harper Fellowship news product track introduces fellows to product design and innovation in journalism. Participants learn how to develop features and digital tools that improve audience experience and support newsroom goals. ezstandalone.cmd.push(function () { ezstandalone.showAds(132); }); Fellows work with product and technology teams to test ideas, analyze user feedback, and contribute to the development of journalism products such as newsletters, digital platforms, and audience engagement tools. Development Track The newly introduced Harper Fellowship development track focuses on the business and fundraising side of nonprofit journalism. Fellows gain hands-on experience in donor engagement, membership campaigns, and fundraising strategy. ezstandalone.cmd.push(function () { ezstandalone.showAds(133); }); Participants also learn how nonprofit news organizations sustain independent journalism through diversified revenue models and community support. Benefits of the Harper Fellowship The Harper Fellowship provides a comprehensive support system designed to help fellows build long-term careers in journalism. Key benefits include: A full-time salaried fellowship with benefits One year of mentorship and professional development Career coaching and job placement support Networking opportunities with media professionals Membership in the National Association of Black Journalists Attendance at the NABJ convention and career fair Access to journalism training workshops and seminars A professional development stipend A work-from-home stipend and wellness stipend An Apple MacBook laptop provided for the fellowship year ezstandalone.cmd.push(function () { ezstandalone.showAds(134); }); These resources ensure fellows receive both financial and professional support throughout the program. Harper Fellowship Professional Development A major component of the Harper Fellowship program is its strong emphasis on professional growth. Fellows participate in training workshops and development sessions covering topics such as: Networking and career advancement Salary negotiation Resume and portfolio building Mental health and burnout prevention Financial literacy Media industry insights from experienced journalists The program also includes career coaching and mentorship to help fellows transition successfully into long-term journalism careers after completing the fellowship. ezstandalone.cmd.push(function () { ezstandalone.showAds(135); }); Harper Fellowship Retreats and Networking The Harper Fellowship experience includes several retreats and networking events designed to connect fellows with media professionals and industry leaders. The fellowship year begins with an opening retreat that introduces new fellows to the program and provides opportunities to connect with previous fellowship cohorts. ezstandalone.cmd.push(function () { ezstandalone.showAds(136); }); Midway through the fellowship, participants attend a career development retreat focused on networking and preparing for future opportunities in journalism. Fellows also attend an annual staff retreat with The 19th team, allowing them to engage in strategic discussions, professional learning sessions, and collaborative activities. These events help fellows build meaningful professional relationships and expand their journalism networks. How to Apply for the Harper Fellowship Applicants interested in the Harper Fellowship 2026 2027 must submit an application through The 19th s official application platform. ezstandalone.cmd.push(function () { ezstandalone.showAds(137); }); The application typically requires: A cover letter explaining interest in the fellowship and career goals A resume outlining relevant experience Work samples demonstrating journalism or related skills Applicants should clearly describe how the Harper Fellowship aligns with their career aspirations and how they plan to contribute to public-service journalism. APPLY HERE Deadline Applications for the Harper Fellowship 2026 2027 must be submitted before the official deadline. Application Deadline: March 20, 2026 (5:00 p.m. PST) Applicants are encouraged to submit their materials early to avoid last-minute technical issues. Final Note The Harper Fellowship offers a unique opportunity for emerging journalists to gain hands-on newsroom experience while working alongside experienced media professionals. Through mentorship, professional training, and networking opportunities, the program equips fellows with the tools they need to build impactful careers in journalism. For individuals passionate about storytelling, public-service journalism, and media innovation, the Harper Fellowship can serve as a powerful launchpad for a long-term career in the industry. For more fellowships, scholarships, internships, and leadership programs, click here . The post Harper Fellowship 2026–2027 at The 19th for Emerging Journalists appeared first on Opportunities for Youth .","tags":["education","America","Fellowship"],"location":null,"deadline":null,"language":"en","created_at":"2026-02-28T18:39:44Z","updated_at":"2026-02-28T18:39:44Z"}
